{"text":"Recently stayed 4 nights on buisness. Very clean and confortable hotel with quiet location. The only issue we had was the poor service in the resturant in the evenings (very slow) and constant lack of menu choises that were unavailble due to waiting delivery!! The breakfasts however were great, one lady waitress who managed better than 2/3 staff in the evenings.For value for money,location and good quality rooms this is hard to beat, the beads are really confortable. Room Tip: choose room overlooking the courtyard then you aer away from the railway track See more room tips","title":"“Great rooms but imrpove the resturant service please”","location":4,"service":3,"value":5,"cleanliness":5,"date":"28 April 2013 NEW","sleepQ":5,"rooms":4}{"text":"This Premier Inn looks brand new. The service at reception on arrival was excellent and the remainder of my stay turned out the same. A very well situated hotel for Bury town center and for working in the area. The car park is only a short walk from the hotel literally 100m. It costs £5 for 24 hours. Room Tip: Make sure you have five pound coins for the parking meter and that you get your ticket stamped at re... See more room tips","title":"“Brand New in Bury”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 April 2013 NEW","sleepQ":5,"rooms":5}{"text":"Stayed for 1 night with my daughter in February. The staff were friendly and the room was clean and comfortable. We had dinner in the restaurant and the food was good. The hotel is very well located for the Metro into Manchester.","title":"“Great Cheap Hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 April 2013 NEW","sleepQ":5,"rooms":5}{"text":"Great hotel, staff, room and food. Pay car park - poor. Had to wander round for an access door to work to get to the pay machines. Hotel very handy for the Metro into Manchester or the Bus station, both only a few minutes walk away.","title":"“Only one night”","location":5,"service":5,"value":5,"cleanliness":5,"date":"22 April 2013 NEW","sleepQ":5,"rooms":5}{"text":"We stayed here last week while visiting relatives in Bury. We booked two adjoining rooms as we were two adults and two children. Rooms were very clean and had everything we needed. The location was quiet despite being beside the metro rail line. Beds were comfortable and we slept well each night. Breakfast was great especially with the kids as they could choose what they wanted and they ate for free. Best of all were the friendly and helpful staff. There is no parking at the Premier inn but there is a public car park very near. You are able to drive up to the entrance to the hotel to load and unload but you need to go through a barrier. The staff were really helpful when we were leaving, my husband was driving the car to the hotel entrance so we could load the bags. The receptionist came out to make sure the barrier lowered properly. Nothing was too much trouble for any of the staff. Thanks for making it a very easy and enjoyable stay. We would definately come back again and recommend to anyone looking for accommodation in Bury. Thank you. Room Tip: Rooms facing the hotel entrance are probably quieter as they are away from the metro line, See more room tips","title":"“You can't beat the Premier Inn in Bury”","location":4,"service":5,"value":5,"cleanliness":5,"date":"14 April 2013","sleepQ":4,"rooms":4}{"text":"The Bury Premier Inn is always. The location is central to Bury and the Metrolink stop is 5 minutes walk away. The staff are always friendly, courteous and helpful. I am looking forwards to my next stay there in a few weeks.","title":"“Another Great Stay!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 April 2013","sleepQ":5,"rooms":5}{"text":"We had a problem with getting the room key, its a DIY book in system which I haven't seen before and don't want to experience again. I want to be welcomed by a human being not a computer and you can if you're willing to hang around. But the hotel was clean, warm, comfortable. The hotel restaurant was cosy, the staff friendly and the food good at both evening meal and breakfast. There were staff available at check out. Different but weird architecture to the outside of this building. Room Tip: Rooms at the rear overlook the tram station but there was little noise, just a slight vibration as t... See more room tips","title":"“Once you get in!”","location":5,"service":4,"value":4,"cleanliness":4,"date":"8 April 2013","sleepQ":4,"rooms":4}{"text":"We really enjoyed our stay in this hotel. It's right in the city centre, the most important sights are in a walking distance. The staff was really friendly and helpful. the breakfast delicious. No doubt, I'm sure I'll come back!","title":"“Wonderful place, perfect location”","location":5,"service":5,"value":4,"cleanliness":5,"date":"4 April 2013","sleepQ":5,"rooms":4}{"text":"Yet another brilliant stay at Bury Premier Inn. It's always incredibly good value, convenient location, and the staff are so friendly and welcoming. The hotel is brand new, and rooms are brilliantly designed with everything you need. For a family with two children, the price works out incredibly low. The breakfast is a brilliant range of good quality food, for a reasonable price and children eat free. It's a convenient but quiet location. Five stars as always. Room Tip: Family rooms are spacious. See more room tips","title":"“Brilliant place to stay with the family”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 April 2013","sleepQ":5,"rooms":5}{"text":"Stayed here on Saturday 30th March for a Friends Wedding. We found the hotel to be very well located close enough to the town centre and Metrolink to walk in a couple of minutes, but far enough away not to be affected by any noise. The welcome was very good and our room was very clean, warm and quiet. We did not take any meals whilst staying and therefore we cannot comment on the quality of the food. we had a drink in the bar which was Standard prices for a hotel chain. We parked on the secure q parks at the side of the hotel which was £5 for 24 hours. All in All a very good hotel with very pleasant staff and we would definitely stay there again if we needed to stay over in Bury for the night","title":"“Clean, Convenient and Value for Money”","location":5,"service":5,"value":5,"cleanliness":5,"date":"2 April 2013","sleepQ":5,"rooms":5}{"text":"This Premier inn is very clean and tidy, however the restaurant is not the best. We stayed on Friday and Saturday, we ate in the restaurant on Friday, there were very few people eating, when we sat down we were informed they had no steak and very few potatoes, considering that the place was empty, not sure what they would have done if a few more came in, the food when came was at best ok. The only other issue was the bar which does not open at lunch time, I can understand this in the week however, this is a hotel and I would have expected to be able to get a drink on a weekend lunch time We were informed they now have a new manager, hopefully he will deal with poor restaurant.","title":"“Nice clean hotel, shame about the restaurant”","location":3,"service":4,"value":5,"cleanliness":5,"date":"24 March 2013","sleepQ":4,"rooms":5}{"text":"Stayed here with family for one night, staff were pleasant and helped book a taxi nothing was too much trouble for them. The rooms were impeccably clean and comfortable, at a decent price you can't go wrong.","title":"“Very Clean”","location":4,"service":5,"value":4,"cleanliness":5,"date":"21 March 2013","sleepQ":5,"rooms":5}{"text":"The hotel was very clean and tidy the staff where very friendly and helpful the room was on 5th floor very clean and quite. The attached restaurant was also very friendly it had quick service the food was good and the prices reasonable. Car park is right nextdoor.The hotel was in a good location not only for Bury but if you wanted to comute to manchester via public transport it was quite painless. I would recommend to friends.","title":"“Good Value for Money Conveiniant Hotel”","location":5,"service":5,"value":4,"cleanliness":4,"date":"19 March 2013","sleepQ":4,"rooms":4}{"text":"This was my 2nd visit here. First time was with my wife. This time was with my teenage son to see the football at Old Trafford, which is 40 mins away on the tram. You get much better value than in Manchester City Centre, and apart from one noisy neighbour around midnight we both got a great night's sleep. The room was spacious and air-conditioned, and the bathroom was clean. (Hot water pipes a bit noisy)! Breakfast was spot-on, although service was a little on the slow side. Apart from these small quibbles I would be happy to stay here again.","title":"“Modern and clean. Handy for the tram!”","location":5,"service":4,"value":5,"cleanliness":5,"date":"17 March 2013","sleepQ":0,"rooms":5}{"text":"Hotel and room were spotlessly clean, comfortable bed, self controlled room temperature, decent tv all sounds good except that the people in the room next door were arguing for most of the night. We were in what would be ajoining rooms so maybe this made it easier for us to hear them but it was horrendous. Then part way through the night we were woken by two male voices messing around on the corridor trying to set off the fire extinguisher! We mentioned this to a member of staff the next morning. Breakfast was amazing, delicious in fact, well worth the money. Would have been 5*s if not for the noise!","title":"“Shame about the noisy neighbours!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"16 March 2013","sleepQ":2,"rooms":5}{"text":"The reception so grand, the best in the land. It was lovely to check in, my inhibitions in the bin. Gliding through the corridor, I knew what was in store. Entering my key card, My heart was beating hard. As soon as I spied that purple upholstery, I knew I had returned to a place that is truly close to me. It is the home of so many precious memories, I will always remember nights like these. I lay down on the carpet, but tried not to mark it. It was so lovely and clean, the best I've ever seen. Freshening up in the bathroom (really nice!), the power shower was a touch of paradise. As I sat on the spotless loo, I knew there was nowhere I'd rather be as I began to relieve myself with a poo and a wee. If this hotel was a sergeant it would get three stripes, Especially for the free chocolate and the critical wipes. 'Time for a drink!' my partner exclaimed so down to the bar where a large wine I claimed. Down it in one and ordered another, the prices in here don't warrant a shudder. After a few too many, I had a dizzy head. So into the accessible lift, I was off to bed. The bed was so soft, it didn't hurt when i coughed. The pillows so comfy, unlike mine which are lumpy. Morning arrived after a great night's sleep, almost time to check out, I fear I could weep. I always make use of the tea & coffee making facilities But my favourite thing is their customer service abilities. I cried when I left. And I shall die bereft.","title":"“Ode to a Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"15 March 2013","sleepQ":5,"rooms":5}{"text":"Stayed here for 3 nights as visiting friends in the area. Easy to get into Manchester, costs £4.80 for a day return on the tram, which is directly opposite. This is a very modern, newly opened Premier Inn, has all the facilities you'd look for and was especially clean and well serviced. Staff have been well trained, so they were always asking if there was anything else you wanted etc. There are facilities to get self service Costa coffee and vending machines for late night munchies etc the foyer. We had breakfast (which you pay extra for) on 1 of the 3 days and this was adequate, nothing to write home about, but for £8odd for help yourself, who's complaining. Would recommend to anyone looking for a a decent night's sleep in the area. Beds were really comfortable and it all offered excellent value for money. Room Tip: we had a room overlooking the front, there is a tramline to the rear, but we couldnt hear any outsid... See more room tips","title":"“Very good experience”","location":4,"service":5,"value":5,"cleanliness":5,"date":"9 March 2013","sleepQ":5,"rooms":3}{"text":"This hotel has got to be the one of the best hotels I have stayed in , all the staff bar none were helpful,friendly and very keen to please . The hotel bar and restaurant were very good and great value for money , the rooms were outstanding . A real credit to the Premier inn chain","title":"“Bury premier inn......Brilliant”","location":5,"service":5,"value":5,"cleanliness":5,"date":"6 March 2013","sleepQ":5,"rooms":5}{"text":"Once again, the Premier Inn at Bury has exceeded our expectations. We stayed for 3 nights in February 2013, to attend a concert at the Manchester Arena, and to visit family and friends. We had a family room and it was kept spotless throughout our visit. All the staff were exeptionally friendly and helpful. Breakfasts were excellent, and very good value, especially as 2 kids can eat free with each adult. If you are going to the Manchester Arena (or anywhere else on the tram routes) a family ticket for the tram costs £6.50 return. The tram is only 3 minutes walk from the hotel, it takes about 20 minutes to Manchester Victoria station, and it drops you off at the Arena entrance. After leaving the Premier Inn, we went on to spend 2 nights in a supposedly \"better\" hotel in Kendal, but the rooms, food and service weren't even close to what we experienced in Bury. This is the second time we have stayed at the Bury Premier Inn and we will definitely be back next time we are visiting the area. I would highly recommend it to anyone. Room Tip: Rooms on the opposite side to the tram lines are quieter, although the tram finishes about midnight... See more room tips","title":"“Another great stay at the Bury Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 March 2013","sleepQ":5,"rooms":5}{"text":"Went to engagement party in Bury and stayed at this premier inn. It is very central for the shops and where we wanted to go. The staff were all very friendly. The food was good for the price. The only down side was the wait in between courses however there were only the two lads working the restaurant and it was very busy! Breakfast was one of the best we have ever had - it was hot, fresh and tasted good. Will definitely stay here again if in Bury as it was very clean and friendly.","title":"“&quot;Friendly place to stay&quot;”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 February 2013","sleepQ":5,"rooms":5}{"text":"Stayed here at the end of January - was my first time to stay here. Would recommend it - around 30 minutes from central Manchester by tram and buses convenient too. Definitely would recommend it. The on site restaurant also offers quality food at reasonable prices","title":"“Handy for onward connections, with comfort and hospitality”","location":5,"service":4,"value":4,"cleanliness":5,"date":"25 February 2013","sleepQ":0,"rooms":5}{"text":"had a family funeral to go to in Bury ,and had to stay overnight.hotel was in a good location,very near metro and bus station.the hotel was very clean,and staff very helpful,food was very good.would visit again .ideal for shopping as within walking distance of all shops.","title":"“city stay”","location":5,"service":5,"value":4,"cleanliness":5,"date":"23 February 2013","sleepQ":5,"rooms":5}{"text":"We stopped at the Premier Inn in Bury as we were going to see the Lion King at the Palace Theatre in Manchester. Prior to our stop a member of staff from the hotel had rung to say we had rooms which were opposite each other.There is a car park nearby £5 for a 24 hour stop if you have your ticket validated. The location is excellent , you are less than a 5 minute walk away from the Metrolink (which for us was part of the whole experience of our stay!!). The hotel was quiet ,clean and the staff were all very friendly. We had an evening meal on our return after the Lion King which was very good. Although we waited a while for our starters the quality of the food was very good. We would definitely stop here again to visit Manchester","title":"“Great place to stay”","location":0,"service":0,"value":0,"cleanliness":0,"date":"12 February 2013","sleepQ":0,"rooms":0}{"text":"We were in Bury for a friends daughters diving competition and the Premier Inn was very conveniently located. I've never really thought of this brand of hotel as anything other than a quick overnight stay with little in the way of frills, and very basic service and food - how wrong I was! From the minute I walked in the greeting was warm and efficient. Our room was spotless and well appointed (apart from only one sachet of coffee per person!) with a decent bathroom, quality TV and fittings. Every member of staff greeted us with a smile and actually cared whether our stay was going well. We had an evening meal at the in-house Thyme restaurant and the prices, choice and quality of food and service was perfect. Again, the staff were polite and helpful. A perfect nights sleep was had by all and another delight followed...breakfast! Again, a wonderful choice and exceptional quality all served by more helpful well trained staff. Check out came and was dealt with perfectly with the same cheery service we were given on arrival. If you ever have to visit Bury or even Manchester which is only 15 minutes away via the local tram I can thoroughly recommend The Bury Premier Inn. You won't be disappointed!","title":"“When is a budget hotel not a budget hotel? When it's the Premier Inn, Bury!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 February 2013","sleepQ":5,"rooms":5}{"text":"My first visit to a Premier Inn and I am very impressed. Located very close to the Metrolink, friendly efficient staff, simple but stylish and comfortable spotless room all at an unbelievable price. What more could you ask for.","title":"“Impressed”","location":4,"service":5,"value":5,"cleanliness":5,"date":"8 February 2013","sleepQ":4,"rooms":4}{"text":"This is the second time I've stayed at the hotel within a couple of months. Overall the hotel is great, it's super clean, quiet and comfortable but there are a few areas that let the place down. Compared to the previous visit to the hotel I found the bed very hard and uncomfortable, I got around 7 hours sleep over the two days. The service is great but I was asked to sponsor a lad on reception when checking out. I informed the team member that there was a fault with a shower in my room and he just didn't seem to care and just went on to ask me to sponsor him, I felt this was quite unprofessional. The bar and restaurant is only open during certain hours, during the day you can't get a drink or food, the company is certainly missing out on revenue with this. Overall though a great stay I would stay here again.","title":"“Second stay at hotel, little things let it down.”","location":5,"service":4,"value":5,"cleanliness":5,"date":"3 February 2013","sleepQ":0,"rooms":4}{"text":"We took advantage of the January sale and booked a room for two for £19. We were visiting family in Manchester, but were drawn to this hotel because of the price and Metrolink to the City. The hotel is just a two minute walk from the metro station and is easy to get to thanks to a subway under the main road. The staff were very friendly, and the room was one of the cleanest I've been in. I don't think I've had a better nights sleep in a hotel before.","title":"“Wonderful one-night stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 January 2013","sleepQ":5,"rooms":5}{"text":"Had the pleasure of staying here for one night during a visit to Bury. The hotel has quite a striking facade indeed, in fact I must do some research into who the architect was on this new build. The hotel is typically \"new\" Premier Inn, very, very plush indeed. I would say their rooms should really be rated at least 3 or 4 star. We were welcomed by a fantastic girl on reception who was very friendly and asked us all the usual questions about whether we had used Premier Inn before etc... she couldn't have done better. The rooms were beautiful as per usual, very comfortable and clean. Adequate facilities and lovely bathrooms. Although we didn't eat in the restaurant it looked amazing, really modern and classy looking, it is one of the \"Thyme\" branded ones that you find at many of the new Premier Inns these days. The menu looked very good too and the prices excellent. Our room overlooked the Metrolink station but the rooms are so well insulated and sound-proofed that we didn't get disturbed at all. We parked on a secure car park right next door to the hotel and were happy that our car was safe for the night. The walk from the car park is literally seconds away. Another brilliant stay in a beautiful Premier Inn. Well worth the visit and we will certainly be going back without hesitation. Room Tip: They all look amazing, however my friends stayed again on one occassion and got a corner room which... See more room tips","title":"“BEAUTIFUL!!!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"27 January 2013","sleepQ":5,"rooms":5}{"text":"Just stayed here for 2 days. Hotel is really handy for visiting other areas on the metrolink. The food was great probably the best premier inn we have had. Staff very friendly, but it did seem a little under staffed. Would have no hesitation staying here again.","title":"“Great location, very handy for tram &amp; rail network.”","location":5,"service":4,"value":4,"cleanliness":4,"date":"27 January 2013","sleepQ":0,"rooms":4}{"text":"Whatever you do, dont be put off by the look of this hotel; it's what's inside that really counts. I had the please to stay here 15-17 January (2013) and it surpassed my expectations by far. The reception staff were very friendly (Janet in particular) and couldn't help enough. It was so nice to feel like a valued customer for a change. We'd pre-booked breakfast and that didnt disappoint. We were even late on one occasion but we weren't turned away. Parking facilities do not belong to the hotel, but are based right next door and seemed to be a fairly safe place where I left my car for 2 days without moving it. No problem. It was in one piece when I got back. I slept on the extra bed in the room which was extremely comfortable and the bedding was crisp and warm. Would thoroughly recommend this if you need somewhere friendly. It even has a bar. Room Tip: A room above the reception perhaps, as we never heard any outside noise. See more room tips","title":"“Looks Aren't Everything!”","location":4,"service":5,"value":5,"cleanliness":5,"date":"23 January 2013","sleepQ":5,"rooms":5}{"text":"Great location for us visiting family and friends have been 5 times and enjoyed every time. Hotel nice and clean, staff helpful and friendly, will be back again very soon hopefuly. Had a great weekend with family celebrating partners birthday, had a lovely meal and a great night. Would recomend this hotel to anybody visiting this part of the country","title":"“Wonderful weekend”","location":5,"service":5,"value":4,"cleanliness":5,"date":"21 January 2013","sleepQ":5,"rooms":5}{"text":"We stayed in the Bury Premier Inn from the 6th to 12th January 2013 and I would thoroughly recommend it to others. The beds were comfortable, the showers were good, the room spacious & quiet - despite the proximity to the tram line, there was plenty of choice for breakfast & above all else the staff were lovely. Really welcoming, friendly & helpful.","title":"“Lovely hotel, excellent service”","location":5,"service":5,"value":4,"cleanliness":5,"date":"21 January 2013","sleepQ":5,"rooms":5}{"text":"I booked a room in the Premier Inn in Bury mainly because of the location. The location is indeed very convenient for the Metrolink interchange (only some 5 minute walk) and the famous Bury market and other excellent shops nearby. However I was also pleasantly surprised by the hotel itself – its unusual modern design, a very friendly staff, comfortable and very quiet bedroom. The hotel prides itself on making the stay comfortable and “guarantee a good night’s sleep or your money back”. And yes, a good night sleep we had after all that shopping! The room rate via the advance online booking was very good too (£29 for a double room) I can certainly recommend this hotel which is only some 20 min a tram ride from the centre of Manchester.","title":"“Shop till you drop... into a comfortable bed”","location":5,"service":4,"value":5,"cleanliness":4,"date":"21 January 2013","sleepQ":5,"rooms":5}{"text":"Lovely central location. Friendly ,helpful staff. Rooms large, clean, warm and well maintained. Unable to find fault with this hotel. Parking was next to hotel and whilst it wasn't included in the price there was a reduction for hotel visitors and the car park was very secure.","title":"“Great value hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"20 January 2013","sleepQ":5,"rooms":5}{"text":"We use this premier inn when visiting family in Bury, the location is perfect, it is only a ten minute walk to family and 5 minutes into the town centre. Very quiet and warm comfortable rooms. undercover car park, next door to the bus station which is perfect for Manchester city centre shopping. Would recommend this premier inn any time.","title":"“Perfect location”","location":5,"service":4,"value":5,"cleanliness":5,"date":"18 January 2013","sleepQ":5,"rooms":5}{"text":"This was our second stay at this hotel,the first being fine. We paid for a meal deal,sat down for dinner at 7 pm,by 9 pm we had been served two courses.There were about a dozen people dining. A spicy dish that three of the party had was more like vindaloo,a burger was so dry as to be inedible. Excuses were that they were short staffed,had a late rush of guests etc, The bottom line is that the quality and service were totally unacceptable. Whilst the staff were pleasant they seemed to have no control of events. Two stars is probably generous .","title":"“Dire dining experience”","location":2,"service":1,"value":2,"cleanliness":3,"date":"17 January 2013","sleepQ":3,"rooms":3}{"text":"Great friendly staff. Lovely clean room, Dinner was excellent, decent price and close secure CHEAP parking !!! Close to city centre for a great night out - could not recommend them more. Visit to Bury market was also a fun thing to do - great meat and fish market Room Tip: If a light sleeper - ask from room opposite Tram side - but too be fair I was not bothered by this See more room tips","title":"“One Night - excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 January 2013","sleepQ":5,"rooms":5}{"text":"Check in staff explained the Premier policy at check in, that is if you are unhappy with anything, let them know. 24 hour staff, Costa machine in reception, fabulous location, next to tram stop, across the road from pubs, restaurants and shops. My friends stayed in a prebooked hotel nearby, paid double what i paid (£35) and had a few moans. My stay was spot on.","title":"“It's everything they say on the advert.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 January 2013","sleepQ":0,"rooms":5}{"text":"We stayed 6 nights in the Premier Inn Bury on a training course. The staff were extremely friendly and helpful. Nothing was too much bother. Especially Janet, Julie and Thulani who went the extra mile to help. We arrived on the evening the usual staff were having their Christmas Staff night out, and they had been replaced by staff from other hotels. They were extremely nice, explained they were from another area, but were a really good advert for Premier Inn. I would definately stay at this hotel again, and would recommend it for anyone else thinking of booking. Room Tip: We were told that we might hear a lot of noise from the trams which pass quite close at the back of... See more room tips","title":"“Well priced hotel with helpful friendly staff”","location":5,"service":5,"value":5,"cleanliness":4,"date":"14 January 2013","sleepQ":5,"rooms":4}{"text":"we spent christmas and new year in manchester, bury and really enjoyed it. the hotel was located perfectly in a quiet area yet minutes away for shopping and getting on and off metro links and trams. we hired a car but was not worth it because we used the metro links to Manchester Arndale and Blackpool. Shopping in Arndale was fabolous! The hotel is very clean and described as advertised. Good rest night sleep, everything organised and food at the 'Thyme' was good. Staff was friendly and ready to help. Well done and i recommend it! Room Tip: A/C unit is quiet and TV has a good mixture of channels See more room tips","title":"“Great holiday with less hassle”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 January 2013","sleepQ":5,"rooms":5}{"text":"Very slow check in as computers were down..made us run late for a funeral we were attending. Returned to hotel at 9 to eat,the restaurant was empty by then... The tomatoes that came with my steak were mouldy and the lettuce leaves in the side salad were all brown,husbands burger was so dry he couldn't eat it..We were still expected to pay for it though...although he was offered a free beer!!!! Tried to get to sleep which was impossible due to the trams rumbling past our window every five minutes...Eventually dropped off to be woken up at 4am by the most inconsiderate people in the room above us...stomping and jumping about...what is it with some people? Husband had to go down to reception to complain after listening to them for over an hour and me banging on the ceiling did not work...Managed to drop off again only to be rewoken by the trams again...Have stayed in many Premier Inns and this is the only time I have experienced so many problems... Room Tip: ask for a room on the side away from the tram line!! See more room tips","title":"“Worst nights sleep in a long time,Eat elsewhere if you want fresh food.”","location":2,"service":2,"value":4,"cleanliness":5,"date":"8 January 2013","sleepQ":1,"rooms":4}{"text":"I stayed here on Christmas Evening after visiting family. Check in very smooth, hotel room amazing, bed very comfortable, shower and bath were amazing, location is very good my room over looked the Metrolink station, luckily it was on Boxing Day therefore didn't have early trams ( this would have likely been an issue with noise). Went down for breakfast the next day but didn't choose to eat simply because I felt slightly intimidated by the fact staff were just stood there chatting away.. Strange I know! Would reccomend to anyone.","title":"“Great stay”","location":5,"service":3,"value":5,"cleanliness":5,"date":"30 December 2012","sleepQ":0,"rooms":5}{"text":"Fantastic hotel thee best premier inn I have stayed in! Superb staff, fab location, kids loved the trams! Cannot fault it at all. If I did have any complaint it would be that we had to leave....but we will be back!","title":"“We will be back”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 December 2012","sleepQ":0,"rooms":5}{"text":"Went to watch Man Utd game which booked through Thomas Cook and the cheaper hotel option was Premier Inn Bury. Further, I went to book for another night stay online which to my surprise, the rate is reasonably cheap. Which lead to my scepticism about the quality of room that my family going to have. To my surprise, not only so near to Metro station, which is so convenience for a tourist like us (although it is a bit outskirts from Manchester Picadilly - about 30 mins with Metro), the hotel especially the room was so comfortable. A family of 4, we had 2 single bed and 1 queen size bed in a reasonable size room. Bathroom was clean too, that is more important. Staff were friendly. Breakfast spread was reasonable, but not much option for us Muslim. But still, we had our stomach full before we leave the restaurant. Overall enjoyed the stay","title":"“Great stay”","location":3,"service":5,"value":5,"cleanliness":5,"date":"24 December 2012","