{"User":"Nik P","Cities":0,"text":"Fantastic welcome by the staff on St George's day,,,,I have stayed here before and again I was welcomed with a smile, some humour and very quick efficiency. All good with room, clean, fresh, and warm. Will I stay here again,,,yes.","title":"“All good here.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Macclesfield, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 April 2013 NEW","sleepQ":5,"rooms":5}
{"User":"Sally147","Cities":0,"text":"Comfortable, clean & cheap (compared to some local B&Bs) - this is the ideal base for our monthly trips to watch the BriSCA F1 at Coventry Stadium. The breakfast at the adjacent TFI Friday is excellent too with very friendly staff & a relaxed environment. Highly recommended...","title":"“Does everything it says on the tin!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Colchester, Essex","cleanliness":5,"Helpful":0,"date":"22 April 2013","sleepQ":5,"rooms":5}
{"User":"OrangeHerbert","Cities":0,"text":"In brief my stay was comfortable and left me refreshed for the next day. It was easy to find, great staff and for the money I paid represented very good value. Only quibble is the shower wouldnt get hot but upon bringing this up on check out they understood and looked to rectify it for the next occupant. My first experience of a Premier Inn - is a good one!","title":"“Decent for a quick stopover”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Portsmouth","cleanliness":5,"Helpful":0,"date":"19 April 2013","sleepQ":5,"rooms":4}
{"User":"Wendys300761","Cities":0,"text":"Clean and comfortable, newly refurbished, friendly staff. Only used for a one night stay for a family party. Very easy to find and next to lots of shops and places to eat within walking distance. Next to a busy A46 so you have to keep the windows closed.","title":"“Clean and comfortable”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Shrewsbury, United Kingdom","cleanliness":5,"Helpful":0,"date":"8 April 2013","sleepQ":4,"rooms":5}
{"User":"Lee537","Cities":0,"text":"I stayed at the hotel for one night and had pre booked breakfast which was to be served at the TGI Friday next door. Breakfast was served until 9am and I arrived at 2 minutes past nine. I was met at the TGI Friday door by a very abrupt and rude member of staff, who said that she could not serve me breakfast as it had gone 9am. I looked across the restaurant which was still busy with breakfast dinners and continental style food was still laid out. I asked again if I could go in and the answer was a short and abrupt \"No\"! I was not even offered the opportunity to just grab some toast, etc, which was readily available, as opposed to a full cooked breakfast. On returning to the hotel reception I spoke to the reception staff who advised that TGI's were always turning people away at breakfast and that they did not know what t o do about it! I pointed out that maybe it would have been helpful to tell customers on check in, that TGI's are strict about timings! I did get my money back for the breakfast and was directed to a Morrisons down they road who did an all day breakfast, actually for half the price of Premier Inn/TGI's. The end result was that Premier Inn/TGI Lost custom, I was inconvenienced. worth noting also that I had spent money in TGI the night before having dinner! Would say that the hotel itself was good and staff were friendly.","title":"“Good hotel, pity about TGI Friday's”","hotelReviews":0,"location":4,"Reviews":0,"service":2,"value":4,"Location":"","cleanliness":4,"Helpful":0,"date":"4 April 2013","sleepQ":0,"rooms":4}
{"User":"ShaneE933","Cities":0,"text":"Modern and refurbished, Great room, excellent friendly staff, great location for exploring area. TGI fridays next door (does get busy and loud so get in early!) and another great pub across the road!!","title":"“Brilliant!!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Cambridge, United Kingdom","cleanliness":5,"Helpful":0,"date":"4 April 2013","sleepQ":5,"rooms":5}
{"User":"smoggy_chris","Cities":0,"text":"I have stayed in this particular Premier Inn a number of times mainly because of its location. Its a pity the PI chain dont have a breakfast inclusive policy as they could then compete with Holiday Inn Express and Best Western which are pretty much the same price. Still, you get what you pay for and PIs are the same wherever you go. However, my room did not have a shaving point which is a basic requirement. The room was comfortable and the shower was good. The staff are always excellent, very friendly and helpfull.","title":"“Average Inn”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":3,"Location":"Stockton-on-Tees, United Kingdom","cleanliness":4,"Helpful":0,"date":"30 March 2013","sleepQ":4,"rooms":4}
{"User":"RoaminRichard","Cities":0,"text":"Usual high quality PremierInn. Enjoyed my stay. I arrived late in the evening so didn't try out the restaurant this time. Reception staff helpful and checked me in with a minimum of fuss. Room was large, spotlessly clean and was comfortable.","title":"“Good as always”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Port Talbot, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 March 2013","sleepQ":5,"rooms":5}
{"User":"claire w","Cities":0,"text":"We stayed here with family as a base to attend a Medieval Banquet at nearby Coombe Abbey. We got a great room rate and we were only ten minutes away from the Abbey. The staff were welcolming and friendly and very helpful when I lost my room key! Located close to the motorway which made it easy to find. Rooms were clean and comfortable. We will definately stay here again.","title":"“Excellent location, comfortable stay.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Birmingham, United Kingdom","cleanliness":5,"Helpful":0,"date":"23 March 2013","sleepQ":0,"rooms":5}
{"User":"McDanster","Cities":0,"text":"Consistent quality and comfort. Hard to find anything to complain about other than: i) Wifi went down on first night and took 24 hours to return ii) You cant book a table at the partner restaurant TGI TGI in Coventry is rammed! I hand not been to one for years and was surprised to find it packed on a Wednesday night. You can't book a table, so we had to wait for 20 minutes at the bar which was fine. The food was as you expect when it arrived and they were very hospitable. They have the latest flat screen LED Samsung TVs which are excellent. Should put a footpath in place so it is practical for guests to goto the pub across the road. All in all, a very good option for those travelling on business. I will come back.","title":"“Good value, sensible prices”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Brighton, United Kingdom","cleanliness":5,"Helpful":0,"date":"22 March 2013","sleepQ":5,"rooms":4}
{"User":"Squgiggle","Cities":0,"text":"Perfect for our purposes, which was to see rugby earlyish on a Sunday morning at the rugby grounds nearby. The rooms were immaculate, the staff very friendly and welcoming. Comfortable beds and good value!","title":"“Perfect for our purposes!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 March 2013","sleepQ":5,"rooms":5}
{"User":"liz c","Cities":0,"text":"Friendly and helpfull staff, Great value for money.First time using a Premier Inn and was very impressed with the size of room and en-suite. Bed very comfy. Despite being close to roads, the rooms are well insulated so had a great nights sleep. We didn't use the TGI Friday for breakfast because of bad reviews, but were told by others that it was quite good! Room Tip: we had an upstairs room, may be quieter than ground floor. See more room tips","title":"“Great budget hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Colchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 March 2013","sleepQ":5,"rooms":5}
{"User":"LondonLeanne_M","Cities":0,"text":"My husband and I booked this Premier Inn given its easy access to motorway en route to London, can't fault the hotel itself, wonderful staff, really clean and a great night's sleep. However the restaurant is TGI Fridays, now I'd checked reviews and they were mixed based on the evening meals. I went ahead and booked the all you can eat breakfast, it operates on timed slots which makes sense as it gets busy. When we arrived at 9.15 many of the tables hadn't been cleared or cleaned, the whole place is in need of a deep clean and update. The cooked breakfast was swimming in grease and the cutlery was dirty, it's a shame as the hotel is great. TGI's needs to improve its standards, once again can't fault the staff who were really friendly. My advice regards breakfast is to find a good cafe in Coventry, we ate out for our evening meal. I've based my score on the hotel itself.","title":"“Great hotel bad restaurant”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"London","cleanliness":4,"Helpful":0,"date":"10 March 2013","sleepQ":4,"rooms":4}
{"User":"JackColchester","Cities":0,"text":"I regularly use Premier Inns because I know what I will get. This one is as good as any and the staff are very approachable and smile a lot. The restaurant has a good value as much as you can eat breakfast. It is clean and modern and rooms have large TVs if that is your thing. There are no shaver points but I believe adapters are available on request.","title":"“A clean comfortable reasonably priced hotel.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Colchester","cleanliness":5,"Helpful":0,"date":"4 March 2013","sleepQ":5,"rooms":5}
{"User":"38Duncan","Cities":0,"text":"floor noise from rooms above spoiled sleep and food from Fridays on evening not good for the price I use Premier inn on a regular basis and with the exception of the good reception staff this particular inn will not be on my return to list Room Tip: Do not have ground floor as noise from 2nd floor creaking etc poor room 9 a non no See more room tips","title":"“noise from rooms on second floor stopped good nights sleep.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":3,"Location":"Richmond, United Kingdom","cleanliness":4,"Helpful":0,"date":"12 February 2013","sleepQ":1,"rooms":3}
{"User":"Aaron W","Cities":0,"text":"Typical Premire Inn facilities except there was no bar/communal area which was a bit disappointing. I was not made aware of the good night guarentee upon my check in and the room above me was noisy from 6am onwards stopping a good nights sleep. Overall the room was clean and tidy. The internet connection was not massively fast.","title":"“2 night stay for a show at Stoneleigh Park”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":3,"Location":"Kessingland, England, United Kingdom","cleanliness":4,"Helpful":0,"date":"11 February 2013","sleepQ":2,"rooms":4}
{"User":"jemma s","Cities":0,"text":"staying here now. friendly quick.easy check.in. clean room. fulfilled all our requests. extra touches like rubber duck for kids. beds and cot made up. blankets for baby cot. lovely!! would stay here again. quiet too","title":"“fab clean friendly”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"uk","cleanliness":5,"Helpful":0,"date":"10 February 2013","sleepQ":0,"rooms":5}
{"User":"rebecca k","Cities":0,"text":"Stayed here for 4 nights, and was impressed by the staff, and the double glazing. I feared it would be noisy as it is situated very near two roundabouts and a main road, but the room was quiet, and there were numerous signs in the corridors asking people to be quiet during the hours of 10pm to 7am, which seemed to be observed. So the hotel is standard premier inn, quiet, comfortable, nice bed, and sparkley clean!! The one fly in the ointment was having to eat at TGI Fridays, next door, because the hotel doesn't have its own dining room and sends you there for breakfast. The staff were a little loud, but very helpfull. Unfortunately breakfast was dryed out one day, and swimming in water the next. (that will teach me to be healthy and have poached eggs instead of fried!!). Also walked out of an evening meal because the music was so loud that I couldn't hear the waitress, and had to shout to be heard.","title":"“Suprisingly quiet but inflated price”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":1,"Location":"luton","cleanliness":5,"Helpful":0,"date":"8 February 2013","sleepQ":4,"rooms":4}
{"User":"Ade-the-great","Cities":0,"text":"Recently refurbished, reasonable size room for family of 4. Had adequate amenities. Parking isn't secure, but didn't feel to bad about leaving car overnight. Biggest issue was having driven for hours to get there and picking this hotel for its adjoining restaurant to find the restaurant didn't take bookings and would only let us join a waiting list (of nearly two hours!) You'd be crazy to do that with two tired hungry kids! So. overall great rooms and staff, but don't rely on eating at the restaurant next door!","title":"“great rooms, but don't rely on eating at the restaurant next door!!!”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Ipswich, United Kingdom","cleanliness":4,"Helpful":0,"date":"4 February 2013","sleepQ":4,"rooms":4}
{"User":"colininahill25610","Cities":0,"text":"We stayed here Saturday night and the receptionists were very friendly and had a great sense of humour. We needed a taxi to go to another hotel where our friends were staying and the reception booked it. Within minutes, it arrived. Receptionist was very chatty and friendly while we waited. Our room was very clean as was the bathroom and we were very surprised at the huge Samsung plasma on the wall. Hair dryer and fabulously lit vanity table in the bedroom which is helpful for us ladies getting ready. Bathroom was well stocked with hand wash and shower gel in a dispenser. Towels and bedding were all beautifully clean with no marks on. Only problem we encountered was noisy neighbours above us but not the hotels fault. We were next to the road and we couldn't hear any outside noise at all like at some hotels. All in all, we would happily stay here again. The staff are a credit to your hotel. We didn't have breakfast the next morning but anyone who went was more than happy with it and it was good value.","title":"“Staff very friendly and very high quality for a premier inn.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Kingston Upon Hull","cleanliness":5,"Helpful":0,"date":"28 January 2013","sleepQ":0,"rooms":5}
{"User":"Perry_Mountier","Cities":0,"text":"Clean and tidy premises with helpful staff. Rooms were larger than average with an excellent, large flat screen TV. TGI's is the onsite eatery although the breakfast experience could be better managed.","title":"“Comfortable stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Romford, United Kingdom","cleanliness":5,"Helpful":0,"date":"28 January 2013","sleepQ":5,"rooms":5}
{"User":"Paul G","Cities":0,"text":"Average reception welcome, busy doing not much. Hotel rooms all clean although could do with a spruce on paintwork etc. Dinner & breakfast at the TGI Fridays next door should be avoided at all costs. Find somewere else to eat; reception suggests the nearby pub. ALthough this does not help for breakfast.","title":"“Good Hotel - Poor TGI Fridays”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":5,"Location":"Swindon, United Kingdom","cleanliness":4,"Helpful":0,"date":"24 January 2013","sleepQ":5,"rooms":5}
{"User":"User855","Cities":0,"text":"Very Clean. Easy access to key roads. Helpful staff. Well lit rooms. Wifi expensive. When a lot of places provide free wifi these days. Take your own £G or 4G dongle. These will set you back only £1 a day instead of £3 a day. Try other local eateries close by. Room Tip: Try to avoid affiliated TGI Friday for Dinner and Breakfast unless you want noisy surroundings and... See more room tips","title":"“Premier Inn -Binley”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"London, England, United Kingdom","cleanliness":5,"Helpful":0,"date":"17 January 2013","sleepQ":5,"rooms":5}
{"User":"rhinocheeks","Cities":0,"text":"I don't usually review the generic hotels such as premier inn as I find them to be much of the same however, I felt that on this occasion the staff deserved a special mention. We stayed here for one night to attend a suprise party in the area. The room was very clean and comfortable to the expected standard of a Premier Inn. On check in disaster struck for us when it became apparent that my suitcase had been left at home ...... 300 miles away - all I had was what I was standing in causing instant panic - it was 3 in the afternoon and the party was due to start in 3 hours - in addition to this my job was to blow up the baloons for the event. Not only did the reception staff spring into action and organise a taxi to get me into town to buy make up/toiletries/outfit etc Sarah A and Caroline very kindly offered to sort out the baloons and basically bent over backwards to help out ..... when I returned from town Caroline had blown up all of the baloons and had them ready in reception for us to collect. Their assistance in our little emergency was a great help - I would definitely stay here again - thanks again girls!","title":"“Excellent Reception Staff - lovely Clean Room”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Oxford, England","cleanliness":5,"Helpful":0,"date":"13 January 2013","sleepQ":5,"rooms":5}
{"User":"Paul_Connelly_Oldham","Cities":0,"text":"This is a modern lodge with large and well appointed comfortable rooms. Hot water was almost instantly available. The bath was full size and the shower was good and powerful. Parking is available directly outside the lodge. There is a TGI Fridays next door which serves a great selection of food and drink. Room Tip: Rooms facing the car park are better as there is a main road on the other side which can be quite no... See more room tips","title":"“Great Stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Oldham","cleanliness":5,"Helpful":0,"date":"11 January 2013","sleepQ":5,"rooms":5}
{"User":"covlad1987","Cities":0,"text":"Room was very clean, comfortable and spacious! Girls on the desk were very helpful, held open doors for me as I had a large bag. Fire alarm did go off twice at 4am and 7am - which was annoying, but we found out this was due to smoking in one of the rooms which the hotel could not help. I did write an email to say apart from this, the stay was brilliant and they gave us our money back!!! Top Class service! Will definatley stay here again!","title":"“Brilliant!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry, United Kingdom","cleanliness":5,"Helpful":0,"date":"3 January 2013","sleepQ":5,"rooms":5}
{"User":"Ray S","Cities":0,"text":"We had a comfortable stay The bed was comfortable and the television was a good size There was ample tea and coffee in the room. We did not like having to go to TGI FRIDAYS for breakfast and if we stay here again we would not book the breakfast but go elsewhere.","title":"“Good Customer Service”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":3,"Location":"Torrevieja, Comunidad Valenciana, Spain","cleanliness":5,"Helpful":0,"date":"1 January 2013","sleepQ":5,"rooms":4}
{"User":"Trisha H","Cities":0,"text":"Have stayed in this hotel a few times. It is close to shops, and has a TGI's next to it. The staff are very friendly and the rooms are very nice and clean. The rooms can get very hot but the quality of the bed makes up for it as i always get a good night sleep. The tv is of a good size but the beds should be re positioned so that they are face on to the tv.","title":"“Lovely Stay”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Coventry","cleanliness":5,"Helpful":0,"date":"31 December 2012","sleepQ":5,"rooms":5}
{"User":"CoventryCarter","Cities":0,"text":"After reading some reveiws on this hotel i was quite worried. Although we should not have been. When we arrived the lady on reception was very friendly and helpful. The room was very nice and the bathroom, the shower could have more pressure but thats the only thing i could find that could be improved. Free wifi for 30 minutes is a bonus and very good one. This hotel for £31 per night is great value and will definatley use again if in Coventry. TGI Fridays great as well, we didnt have breakfast as you can can get cheaper anywere else. Ignore bad reveiws this is a great hotel for one night or even more i wouyld gladly stay too.","title":"“Very Good Surprise”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Brussels, Belgium","cleanliness":5,"Helpful":0,"date":"30 December 2012","sleepQ":5,"rooms":5}
{"User":"Andrew131","Cities":0,"text":"Yes, the bed was comfortable, the room s adequate however I left feeling disappointed. On arrival the front of house employee couldn't be bothered to stand to welcome me and my partner. Then I was presented with a check-in card on which THEY decided my partner was female - which he is far from!! I corrected this on the card, including his name, yet my invoice still showed the incorrect details. The next morning, housekeeping was knocking at my door at 11.20 when check out was at 12pm, I advised I would be about 20 minutes. 20 minutes later, they entered my room without warning, when I just exited the shower! I left feeling very embarrassed and disappointed","title":"“Poor Service and lack of Inclusion”","hotelReviews":0,"location":5,"Reviews":0,"service":1,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 December 2012","sleepQ":5,"rooms":5}
{"User":"allibea","Cities":0,"text":"Many thanks to Katie for her excellent customer service skills. We did not stay at this hotel but called in as we were lost and needed directions to the Bromsgrove Central premier inn. Katie kindly printed us directions and advised us we were only about 40 mins drive away. We were very impressed with her professionalism and courtesy.","title":"“excellent customer service skills”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"yorkshire","cleanliness":0,"Helpful":0,"date":"9 December 2012","sleepQ":0,"rooms":0}
{"User":"OzYorkshire","Cities":0,"text":"Good hotel recently refurbished, great check in, the 2 ladies at the desk were very good. Pity about TGI Fridays, loud music, no choice of beers, only freezing cold lager. Breakfast was only OK, I would stay again but get breakfast elsewhere.","title":"“Good hotel, pity about TGIs”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Malham, United Kingdom","cleanliness":4,"Helpful":0,"date":"7 December 2012","sleepQ":4,"rooms":4}
{"User":"Captainduck27","Cities":0,"text":"We were staying at this Premier for a schools relay gala in Coventry the next day, having had previous good experiences with Premier. This was no exception, friendly staff, nice rooms with suitable beds, immaculate bathrooms and no road noise. Attached to the Premier is a TGIFridays, which makes a pleasant change from your normal pub/beefeater. The hotel is also situated literally minutes away from the city centre too, don't bother with the more expensive, inner city ones. Our only complaint would be that the fire alarm went off once, at 4:30 & again at 7:09. This however was dealt with very well, the staff most apologetic and was not down to the hotel itself, but a room upstairs was smoking. So, overallall brilliant stay and would most definately recommend this hotel.","title":"“Good overnight stay, despite the fire alarm going off twice in the night...”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Ivybridge, United Kingdom","cleanliness":4,"Helpful":0,"date":"7 December 2012","sleepQ":0,"rooms":4}
{"User":"Toyah1","Cities":0,"text":"6 of us stayed here on a Sarurday night. Check in was good. Rooms are basic but really nice, had a lovely smell in them. Everything was there that we needed. Fire alarm went of in the middle of the night for no reason, everything was fine and staff didn't know why it had gone off. Upon check out staff asked us it everything was ok with out night's sleep, we said yes apart from the fire alarm going off, so they gave us our money back. Excellent service...Even before this happened we liked everything about this hotel.","title":"“Great hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Cheshunt, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 November 2012","sleepQ":5,"rooms":5}
{"User":"kari s","Cities":0,"text":"Was attending event at Stoneleigh. This hotel is well placed and easy to find. Lovely welcoming staff and really clean decent sized room. Great power shower. Had no problems and got a good nights sleep. Didn't try the food after reading reviews on here but Morrisons and Macdonalds are close by.","title":"“Excellent value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Chelmsford, United Kingdom","cleanliness":5,"Helpful":0,"date":"12 November 2012","sleepQ":5,"rooms":5}
{"User":"mikyak","Cities":0,"text":"Took the kids after a day at Warwick castle got the hotel and popped to TGIs to book for dinner and were told, can't book that late, an hour wait, just have to queue. Not feasible with two hungry kids. Crossed the estate to the pub, same wait there, so ended up with, joy, McDonald's. Need our warning. Book in advance if you want dinner. Great hotel, clean and with friendly staff. Room Tip: Book for dinner! See more room tips","title":"“Great value hotel, shame couldn't get into TGI Fridays for dinner”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Sheffield, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 November 2012","sleepQ":5,"rooms":5}
{"User":"joshuaFrance","Cities":0,"text":"Just returned from a trip to England, Booked a couple of nights, just as good as last time, clean, friendly, and a good size room, Carolyn ( hope I its right) has the nicest, friendliest welcoming smile, and it doesn't change. In brief, a very good hotel.","title":"“Back again”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"France","cleanliness":4,"Helpful":0,"date":"7 November 2012","sleepQ":4,"rooms":4}
{"User":"Oxford_lad","Cities":0,"text":"We had a good stay in the hotel, no problems with the good location (for us), very comfortable and quiet room, and friendly staff. However, the experience was soured by the very poor breakfast experience at TGI Friday, to a point where we'd seriously not consider taking breakfast in a Premier Inn with no dedicated restaurant again. We had booked for 9.30am as requested by the hotel staff but arrived to find no cups or cereal bowls, no hash browns, fresh fruit, croissants, muffins, porridge, skimmed or semi-skimmed milk. We were told the restaurant had run out due to not knowing the number expected for breakfast. Restaurant staff told us this happens every Sunday morning. And to top it off, what food was left was cleared away promptly at 10am! We spoke to the manager and ended up taking their apology in the form of complimentary breakfast. But unfortunately Premier Inn failed on this occasion to deliver on their promise of a Premier breakfast and this has disappointed us. Room Tip: All good I would say. See more room tips","title":"“good hotel...but avoid the awful breakfast at TGI Friday”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Oxord, UK","cleanliness":5,"Helpful":0,"date":"5 November 2012","sleepQ":5,"rooms":5}
{"User":"Mark_Jonesy","Cities":38,"text":"I stayed for one night whilst away on business. Staff at check-in were very friendly and helpful. My room was at the end of the corridor which was brilliant as it meant I had no passing foot traffic. My room was very clean, modern and well appointed. The bed was very comfortable and I was impressed with the large flat screen TV. The room was very quiet and overall I had a very good nights sleep. For £29 this was an absolute bargain and I have nothing but praise for this particular Premier Inn - I highly recommend it!","title":"“Excellent stay”","hotelReviews":22,"location":4,"Reviews":83,"service":4,"value":4,"Location":"Coventry, West Midlands","cleanliness":4,"Helpful":38,"date":"2 November 2012","sleepQ":5,"rooms":5}
{"User":"Jemma W","Cities":0,"text":"Room was clean and comfortable although I had trouble keeping the room warm throughout my stay. A jumper sorted that though. The staff were friendly and greeted you every time you went through reception. What amazed me was how quiet my room was considering how near a main road the hotel is located. There was also building work going on at the rear of the hotel but I didn't hear a thing. So much better than previous Premier Inn's I have stayed at. I would recommend going to the local supermarket for food of an evening though as the TGI Friday's is very expensive for what you get. However the supermarket is right next to the hotel and there is another cheaper but across the road. Room Tip: Request rooms over looking car park See more room tips","title":"“So quiet :)”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Birkenhead, England, United Kingdom","cleanliness":4,"Helpful":0,"date":"1 November 2012","sleepQ":5,"rooms":5}
{"User":"KentFamily_11","Cities":0,"text":"Stayed here last Saturday night as a family of two adults and two children. Booking in was easy and the room was clean, fairly spacious, comfy beds, the kids beds were made up and the heating temperature was just right. Our room was facing the busy road but we didn't experience any road noise. Was dissappointed with breakfast at TGI's but will review them separately. Convenient stay at pleasant hotel.","title":"“Does what it says on the tin”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":4,"Location":"Kent","cleanliness":5,"Helpful":0,"date":"31 October 2012","sleepQ":0,"rooms":4}
{"User":"TheParkers52","Cities":0,"text":"Having used several Coventry hotels recently, this one has been the first that has inspired me to write a review. The bedrooms appear to have been recently modernised and on each of my stays here, have been cleaned to an exceptionally high standard. Although this is not the prettiest hotel I have stayed in , the location more than makes up for its lack of kerb appeal. It gives easy access to all areas of Coventry and as it is not a city centre hotel has ample free parking. All of the staff i came across seemed happy to help. This particular Premier Inn is adjacent to a TGI Friday`s restaurant which was enjoyable but the reception staff were also happy to recommend other local places to eat. I also liked The Cocked Hat pub across the road for evening meals. There is also a Morrisons supermarket within walking distance if you need any provisions. Room Tip: the ground floor rooms were great for families but i prefer a first floor room so no one is above me... See more room tips","title":"“Modern Rooms + Free Car Park + Happy Staff”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Bristol, United Kingdom","cleanliness":5,"Helpful":0,"date":"22 October 2012","sleepQ":5,"rooms":5}
{"User":"london j","Cities":0,"text":"Stayed in early October for a night good sleep very restful, staff just so friendly and great customer service fab! TGF was closed so breakfast was accross the road in a pub just to much messing around room also a bit chilly so went to bed early and was really cosy. A bit over priced regarding facilities or lack off ! but had to rate well due to high standard of cleaning, comfort of bed and staff customer service.","title":"“good nights sleep”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":2,"Location":"London","cleanliness":5,"Helpful":0,"date":"17 October 2012","sleepQ":5,"rooms":4}
{"User":"Lisa D","Cities":6,"text":"We have stayed at this Premier Inn several times, purely as a one-night stop over. The rooms are comfortable, as you would expect from this chain. We had one issue a while ago with a very cold room, and was told that the thermostat resets itself at 8am to 16 degrees! .. no wonder we were cold! ... They immediately offered us a refund, no quibbles at all. The only downside to this Premier Inn is that there is no onsite restaurant, and you have to go to TGI Fridays for your breakfast - not something I'm keen to do early in the morning, however there is a Morrison's very close by with a cafe that serves a more than adequate breakfast!","title":"“Ok for a short stop over”","hotelReviews":6,"location":5,"Reviews":6,"service":5,"value":5,"Location":"Coventry, West Midlands","cleanliness":5,"Helpful":15,"date":"16 October 2012","sleepQ":5,"rooms":5}
{"User":"bondgirl01","Cities":0,"text":"I stayed here whilst on a business trip with collegues and just had to say how fantastic the service and hotel was. I was a bit weary when my company said i would be staying here as i read the review previous but was pleasantly surprised (i think some people just live to complain). The welcome was warm and the staff were fantastic, i passed one of the housekeepers on my way to my room and she was polite and told me if i needed anything i could just ask which i found to be lovely. Overall a fantastic stay and will recommend it to any other collegues working in coventry! Room Tip: All rooms have a 42\" tv which is an added bonus See more room tips","title":"“fantastic!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"manchester","cleanliness":5,"Helpful":0,"date":"9 October 2012","sleepQ":5,"rooms":5}
{"User":"Steve P","Cities":0,"text":"I stayed here while on business for a week in May 2012. The rooms are fine and the large plasma HD TV is a definite bonus. The place had the look and feel of an airport hotel (which is what it is really as it's very near the airport), with very narrow corridors making it feel a little claustrophobic. The main downside to me was the attached TGI's. Don't get me wrong I'm not complaining about the food but for someone to stay here on business, I really can't be bothered with all of the hustle and bustle of TGI's when I go in there on a night. I much prefer a hotel with a proper bar and restaurant, and I'd highly recommend the Premier Inn at Earlsdon park as a better alternative, with huge rooms, a great bar and restaurant and superb staff.","title":"“Decent hotel”","hotelReviews":0,"location":3,"Reviews":0,"service":3,"value":3,"Location":"Sunderland, United Kingdom","cleanliness":4,"Helpful":0,"date":"6 October 2012","sleepQ":4,"rooms":3}
{"User":"Jane G","Cities":0,"text":"We weren't expecting much from our stay - we had a cheap deal from hotels.com which included breakfast. What a lovely surprise - from the helpful staff on reception to the clean, well laid out room to the very nice breakfast in the restaurant next door - it was everything we needed for our night away. The wifi cost an extra £3 but we expected that so it wasn't a shock. We ate our evening meal at a pub down the road (Cocked Hat) after reading the reviews on here and that was good too.","title":"“Pleasantly surprised”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Knutsford, United Kingdom","cleanliness":5,"Helpful":0,"date":"30 September 2012","sleepQ":4,"rooms":5}
{"User":"Ray E","Cities":0,"text":"I have stayed at a lot of premier inns for both business and pleasure and always find that they provide a good standard, however this hotel was let down by TGI Fridays ( Terrible, Greasy, Indifferent) dont let this put you off the hotel just eat off site. If on a premier inn meal deal you can ask to eat at one of the restaurants across the road.","title":"“Don't eat here”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":4,"Location":"Jarrow","cleanliness":4,"Helpful":0,"date":"28 September 2012","sleepQ":4,"rooms":4}
{"User":"Dennis T","Cities":0,"text":"I highly recommend any stay at a Premier Inn, While my personal stay was an overnighter I am sure that the comfort and cleanliness, helpfulness of staff and supplied facilities provided were more than i would have expected.","title":"“Overnight Stay at Premier Inn”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Leighton Buzzard, United Kingdom","cleanliness":5,"Helpful":0,"date":"26 September 2012","sleepQ":5,"rooms":5}
{"User":"BerkshireCritic","Cities":0,"text":"This budget hotel provides a good night sleep in a comfortable clean room. Parking is good however, some inconsiderate drivers without disabled parking badges take advantage of the disable parking bays. The restaurant, TG Fridays gets very busy and noisy. Room Tip: Book breakfast and dinner on arrival as the restaurant, TG Fridays gets very busy. See more room tips","title":"“Does what it says on the tin.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Woodley, Berkshire","cleanliness":5,"Helpful":0,"date":"24 September 2012","sleepQ":5,"rooms":5}
{"User":"Magretha","Cities":0,"text":"We used this Premiere Inn as a stopover between family visits. Front of house staff were friendly and informative. The room was very clean with everything that we needed. The bed was comfy and the TV huge. There were plenty of extra tea/ coffee/sugars available. Our only beef was a 'plonker' walking around at 2 am searching loudly for his room. We mentioned this in the morning and were immediately offered a refund. We declined as we felt that it was hardly their fault. The breakfast was good in the adjoining TGI Fridays. Will stay there again.","title":"“Great room, friendly and professional staff.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Broadstairs, United Kingdom","cleanliness":5,"Helpful":0,"date":"23 September 2012","sleepQ":4,"rooms":5}
{"User":"hegel54","Cities":0,"text":"We had booked this hotel from Australia relying on the advice of Tripadvisor as we hadn't heard of \"Premier Inn.\" We arrived after a long business day to be greeted in a friendly enough fashion and, when I mentioned my spinal problem and resulting back ache, were told that our room was on the first floor but we were assured it had a good bed. We then struggled to take luggage up the stairs but the room seemed clean enough. The shower had a disappointing trickle which was completely inadequate and then into bed... The bed was firm except for the groove in the middle from hard use and we both clung onto the sides all night to avoid elbows in ears etc etc I wouldn't have said anything in complaint as it wasn't worth conflict for the sake of a single night but, unfortunately the manager asked if everything was OK and was told. Sure, they gave us a refund but, this hotel makes 3rd place on Tripadvisor's list of hotels in Coventry!!! We have tried some of the others and found them shockers by world standards. We had just had a very pleasant three nights at the Sheraton Skyline in Heathrow so we're not serial complainants but can only think that people with very low expectations would think Premier Inn was OK unless the only criterion is cleanliness as this place scored highly on this! Room Tip: Errr...Birmingham might have better hotels... See more room tips","title":"“Very Poor”","hotelReviews":0,"location":5,"Reviews":0,"service":1,"value":1,"Location":"Perth, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 September 2012","sleepQ":1,"rooms":1}
{"User":"Sunandmoon10","Cities":0,"text":"The usual Premier Inn quality which I expect. My bedroom and bathroom were very clean and I just had to tell the cleaning lady on my way out just how impressed I was. I also mentioned it to the reception staff as I was leaving and they were delighted to hear it. I had unfortunately left my mobile at a relative's house on the night I was staying at the hotel and the reception lady was very helpful in allowing me to make a phone call to find out where it was. I slept well, very comfy bed and good blackout curtains.","title":"“Very clean and comfortable”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":4,"Location":"Manchester","cleanliness":5,"Helpful":0,"date":"14 September 2012","sleepQ":5,"rooms":4}
{"User":"Helen R","Cities":0,"text":"clean quiet and good proximity to shops etc.kids 6 and 10 happy.staff helpfull,and polite.did not use restaurant so cant comment.i would come back again.i would say it was value for money.a little drinks fridge would have been nice as i dont drink hot drinks.","title":"“value for money”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Coventry, United Kingdom","cleanliness":5,"Helpful":0,"date":"9 September 2012","sleepQ":5,"rooms":5}
{"User":"Ron M","Cities":0,"text":"Recent refurb but excellent in every respect. Very perky and helpful staff. The TGI Friday's on site is very handy. Birthday bash there was good. Breakfast at TGI's also excellent. Although next to busy junction no noise in rooms.","title":"“Excellent stop over”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Flint","cleanliness":5,"Helpful":0,"date":"2 September 2012","sleepQ":0,"rooms":5}
{"User":"bluebell1778","Cities":0,"text":"Always looking for a decent place to stop for a night when traveling and was glad I picked this one. Welcome at reception was great and we were dealt with efficiently, our room was on the first floor (no lift) and was a really good size and looked as though it had been recently given a makeover, with a great tv on the wall, the room and bathroom were clean, all we really needed to be comfortable, extra coffee and milk etc were easily available at reception. Plenty of free parking, will definitley use again.","title":"“Try this premier inn for a stopover”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Erskine, United Kingdom","cleanliness":4,"Helpful":0,"date":"27 August 2012","sleepQ":4,"rooms":4}
{"User":"born-travel2012","Cities":0,"text":"I did not like it, although I had spent ages looking at the reviews before going. No air con in rooms (it was not mentioned on the web site) and it was very hot and difficult to sleep in. They had fans, but the rooms were hot and sticky anyway. Also, no telephone in the room, so if one does not have a mobile phone and there is an emergency, no way to call for help. Staff were very friendly, the rooms were clean. The room lighting was too low, a bit dingy for my taste. For dining there was only the TGI Friday (inferior breakfast) on the premises; my elderly father did not feel comfortable eating dinner in a party atmosphere; unfortunately, there was no other dining option on the premises for him. This may be good fun for others but not for us, a family spanning three generations. We paid far too much (£51 per room per night) and for that we got a hot room, no telephone and a very limited breakfast at extra cost.","title":"“Not for young families or older people”","hotelReviews":0,"location":2,"Reviews":0,"service":3,"value":2,"Location":"London, United Kingdom","cleanliness":4,"Helpful":0,"date":"23 August 2012","sleepQ":4,"rooms":4}
{"User":"WATO1129","Cities":0,"text":"this hotel is just off the A46 not far from the M69 and the Coventry Airport. lots of car parking. room was very nice and clean with a big flat screen TV on wall. all the usual mod cons of a premier inn at a good price. there is some building works going off opposite but hardly any noise hear from the works. handy TGI Fridays next door. well worth a stay","title":"“handy location near to coventry airport”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"leicester","cleanliness":5,"Helpful":0,"date":"19 August 2012","sleepQ":5,"rooms":5}
{"User":"george m","Cities":0,"text":"We stayed in this Premier Inn for the First Time as we got a Great Deal on the Internet £29 per night,we stayed there for 3 Nights,we try and visit Family in Coventry every year and have stayed at a lot of local Hotels,This Premier Inn from the moment we arrived at the Reception they were always polite and made us so welcome,everytime you go in and out they ask could they help you with anything and its great to see that they make the Customer feel welcome at all Times.The Room and Toilet were 1st class,very clean..Great T.V...Car Parking is no Problem as plenty of spaces..Never had Breakfast or Food as I went to meet Family.. What would I like added to Premier Inn...Small Fridge in the room to keep Drinks. Would I stay in this Premier Inn Again....Yes..","title":"“Ahoy..Visiting Family In Coventry.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Greenock, United Kingdom","cleanliness":5,"Helpful":0,"date":"3 August 2012","sleepQ":5,"rooms":5}
{"User":"DDMacca","Cities":0,"text":"A 2 night stay over and was really pleased with the hotel. The room was spacious, clean and soap and shower gel provided in the bathroom, refreshment plenishments available as bedding choices. My partner was very pleased with the TV! The staff were excellent, very friendly and helpful, as we had a bit of a crisis on the day of the wedding, they were accommodating in allowing a close family member to use the facilitiy in our room. We also had to change our pre booked breakfast plans to the next day.which was also sorted out for us. Would definitley recomend and stay again..","title":"“Wedding stay over”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":5,"Location":"Bristol, United Kingdom","cleanliness":4,"Helpful":0,"date":"1 August 2012","sleepQ":4,"rooms":4}
{"User":"Cloudinthesky1970","Cities":0,"text":"Having won tickets from the school to see the football games in covenrty stadium we wanted an inexpensive place to stay overnight. This was ideal We were treated well as we arrived, the room was ready made up for four had four sets of lovley big bath towels and four cups with he kettle. Extra milk ect was available at a side desk and my daughter got some hot chocolate from reception plus the the special surprise for the kids ( I'll not say any more) Room and bathroom by clean, free wifi 1/2 per day was idea the tv provided a great boon as it was the opening of the Olympics, the TVs are restricted on volume so a bit hard to hear but at least you won't get disturbed by others. Dinner and breakfast at the adjoinng place was fine or you could go to morrisons just a short walk away ( handy for the toothpaste we forgot ) Room had a fan and a proper hair dryer which with long hair my girls really need. Would definanly use again if we ever are in the area","title":"“Ideal for any overnight trip”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Norwich, United Kingdom","cleanliness":5,"Helpful":0,"date":"1 August 2012","sleepQ":5,"rooms":5}
{"User":"Gideon V","Cities":0,"text":"The room had everything we needed and even a better Television than we expected. However, the food at breakfast ran out very quickly. The staff were very friendly and welcoming. The room was a nice size and very tidy. Room Tip: All rooms are nice. See more room tips","title":"“Stay in Coventry for Olympics”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"30 July 2012","sleepQ":5,"rooms":5}
{"User":"TuesdayChester","Cities":0,"text":"I haven't stayed at a Premier Inn for years and was pleasantly surprised at how good this one was. Lovely big rooms, soap & shower gel in the bathroom, a choice of pillows - none of them as rock hard as the Travelodge ones. Cable tv. Extra tea & coffee supplies were available in reception. We booked 4 rooms for family get together. The 2 couples with small children both said the kids slept in longer than expected due to the thick curtains making the room dark. The staff were really helpful too. We were too late for breakfast, so they recommended Morrison's who do a huge breakfast for £4.35. I automatically book a Travelodge if I need a cheap overnight stop, but from now on, I'll be checking Premier Inn first.","title":"“A super hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Chester","cleanliness":5,"Helpful":0,"date":"29 July 2012","sleepQ":5,"rooms":5}
{"User":"Celtic_Samurai","Cities":0,"text":"Not bad, very clean and good staff. Road noise not bad as set back from the road. I had a Hippo in the room above but other than that all ok. Building site next door but they didn’t start to early or finish late and will probably be done by September looking at the way its going. TGI Fridays as the restaurant and that made a nice change.","title":"“Typical Premier Inn but with TGI Fridays”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":4,"Location":"Forest of Dean","cleanliness":5,"Helpful":0,"date":"27 July 2012","sleepQ":3,"rooms":4}
{"User":"regulartraveller9999","Cities":0,"text":"We have just spent two nights in this hotel, a lovely welcome by the staff and the room was lovely and big. Plenty of car parking spaces. Dont believe others there was no problem that could not be fixed. Across the road is a Toby Cavery which was a excellent evening meal, with lovely staff. Don't forget to ask at reception for the hair dryer before you wash your hair. Iron and board also available at reception. Room Tip: All rooms are good See more room tips","title":"“Excellent”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Cardiff, United Kingdom","cleanliness":5,"Helpful":0,"date":"26 July 2012","sleepQ":5,"rooms":0}
{"User":"linda m","Cities":0,"text":"Myself and my family stayed here as a stop off for our holiday the following day. We were pleasantly surprised at how lovely the hotel was, the greeting from staff was welcoming which was great after such a long journey, we then got into the rooms and were surprised at how big they were even with 2 extra single beds in also the cleanliness could not be faulted. We were not able to have breakfast in the morning as we had to leave early and the previous night we ate at the pub accross the road which was extremely cheap and the food was fantastic. Considering we only payed £29 for the room which we booked online the service and hotel exceeded expectations and i would definately stay here again. Thank you binley what a great start to our holiday!","title":"“Great start to our family holiday”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"oxford","cleanliness":5,"Helpful":0,"date":"24 July 2012","sleepQ":5,"rooms":5}
{"User":"jdtanner","Cities":0,"text":"My stay at this hotel was largely good, but was let down by a few issues: 1. The shower water pressure is terrible! Easily the worst I've experienced at a hotel. 2. The soap dispenser my shower was broken (seems to be a common complaint) 3. No wifi on the night I was staying...which was a real pain in the bum. 4. The room I stayed in had a distinct 'fried food' smell about it. I woul imagine this was due to the TGI Fridays kitchens venting goodness knows what into the atmosphere (not really Premier Inn's fault) 5. The TGI Fridays is terrible! 45 mins to wait for a table, even though the restaurant was half-full. The food was rubbish, and my ears are still ringing from the noise. The staff at Premier Inn did suggest the pub over the road for a quieter meal, but I stupidly ignored them. I mentioned all of these to the staff on leaving, but the. 'good night guarantee' wasn't offered. If I hadn't been in a hurry I might have asked them to honour it. In general, it is a good (and very clean) place to stay for a night.","title":"“Good...but a few faults”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":4,"Location":"Derbyhsire, UK","cleanliness":5,"Helpful":0,"date":"22 July 2012","sleepQ":0,"rooms":3}
{"User":"Dix0n_Family","Cities":0,"text":"This is the first time we had stayed here and we would definitely come back. There is plenty of car parking space. The staff were helpful and friendly giving us different options on where we could eat. We had a spacious and very clean family room (double and two single beds). The kids loved the large flat screen TV. The only downside was the breakfast at TGI Friday avoid it at all costs! The carvery just down the road provided an excellent evening meal at a very reasonable price - wish we'd gone there for breakfast","title":"“Great Premier Inn - shame about breakfast”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Cockermouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"20 July 2012","sleepQ":5,"rooms":5}
{"User":"johnny L L","Cities":0,"text":"Stayed here a while ago and am returning again soon. Firstly the welcome was fantastic and the staff were full of energy also not robotic which you can get with a lot of hotels. I booked my future stay the day we checked out which was nice and easy to do. The adjacent TFI'S wasn't brilliant but the pub accross the road was fantastic so we still had somewhere to eat. I found the rooms to be great and had everything you needed i.e hairdryer shower gel and huge TV's. Looking forward to going back! Room Tip: The pub accross the road is better if you like it to be nice and quiet whilst you eat. See more room tips","title":"“WARM, FRIENDLY STAFF”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"york","cleanliness":5,"Helpful":0,"date":"17 July 2012","sleepQ":5,"rooms":5}
{"User":"Helen S","Cities":0,"text":"Booked last minute for early getaway for Silverstone GP. Spotlessly clean, no noise despite warning on PI website, loads of room, excellent facilities for price, friendly, efficient staff. Room Tip: Ask for room facing away from traffic junction. See more room tips","title":"“excellent stop over”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Ripon, United Kingdom","cleanliness":5,"Helpful":0,"date":"16 July 2012","sleepQ":5,"rooms":5}
{"User":"Nicklunac","Cities":0,"text":"This hotel is in good condition and the staff are very helpful. A lot better than the alternative budget chains.","title":"“Great value for money and convenient location”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Fleet, United Kingdom","cleanliness":5,"Helpful":0,"date":"2 July 2012","sleepQ":4,"rooms":5}
{"User":"Tracey G","Cities":0,"text":"Stayed on Sat 23rd June . Room was very clean and comfortable, staff were very friendly . Hardly any noise from other rooms . Good picture on the TV . Take your own toiletries as none provided , but you can help yourself to more tea/coffee etc in the reception area.","title":"“Great value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Birmingham","cleanliness":5,"Helpful":0,"date":"25 June 2012","sleepQ":5,"rooms":5}
{"User":"sarah c","Cities":0,"text":"Really nice clean, modern rooms in this premier inn but the cooked breakfast offered is very poor - to the extent that lots of guests go next door to Morrisons! - my recommendation - stay here, eat elsewhere! Room Tip: ask for a ground floor room as there is an airport nearby! See more room tips","title":"“NIce facilities &amp; friendly staff but poor breakfast”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Exeter, United Kingdom","cleanliness":5,"Helpful":0,"date":"25 June 2012","sleepQ":4,"rooms":5}
{"User":"Matt5","Cities":0,"text":"Stayed for one night as significantly cheaper than premier inn next to the LG arena. The hotel was very clean and easy to find. All the staff were very friendly with the hotel being around 20 mins from the LG. The room was comfortable but the shower pressure was lower than expected. TGI was good value and reasonably priced. Overall an excellent stay for the money.","title":"“Good value and friendly staff”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Norwich","cleanliness":5,"Helpful":0,"date":"17 June 2012","sleepQ":0,"rooms":5}
{"User":"Sarah T","Cities":0,"text":"very friendly and helpful staff. Recently had a makeover","title":"“visit”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"suffolk, England, United Kingdom","cleanliness":5,"Helpful":0,"date":"9 June 2012","sleepQ":5,"rooms":5}
{"User":"thiseldome","Cities":0,"text":"Lovely hotel and staff.The dispensers in the bathroom are very trying.Do not recommend breakfast it was tasteless,and the service was non existant,recommend you try Morrisons for half the price.","title":"“thiseldome”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Newcastle upon Tyne, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 May 2012","sleepQ":5,"rooms":5}
{"User":"DebbieG60","Cities":0,"text":"This is a great option for reasonable accommodation, the rooms have been upgraded with a geat bathroom, big television and lovely beds oh and WiFi, can't really ask for more. The only slight downside is the shopping centre that is being built - the construction team start early and you can hear them if the windows are open but that won't go on for ever. Staff are lovely, Room Tip: Normally ask for a room at the back See more room tips","title":"“The second most comfortable hotel bed ever!”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Bournemouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 May 2012","sleepQ":5,"rooms":5}
{"User":"HouchensHead","Cities":0,"text":"After traveling from the Isle of Wight and staying at a below average, very poor, supposedly 4* rated hotel in Symonds Yat, (near Ross on Wye in Herefordshire), we had a further journey to Coventry for a couple of days to visit family. We had booked both hotels some time ahead and was really looking forward to a short break. After the bad experience of the first hotel, we arrived at the Premier Inn in Binley. What an absolute breathe of fresh air! Truly wonderful! As soon as we arrived, we were greeted by a lovely lady on the desk. We went up to our room (51) and couldn't have been more happy! Extremely clean, beautiful large bed, welcome tea and coffee on the table (plus ample in reception if you wanted more!), a HUGE TV set on the wall - not some cheap tat hanging on a bracket by threadbare screws as in most hotels! Great choice of channels on the freeview selection. As I said, we had booked well ahead and got the room for a really good price - well worth it! We had previously stayed at the Premier Inn at Sparrow Hall, Coventry and were equally perfectly happy! I can't comment on the breakfast at TGI Fridays as we didn't want breakfast. (My wife and I are not big eaters), so my blank response in no way reflects any opinion. Would we stay again? ABSOLUTELY! No need to look elsewhere! We love Premier Inns!","title":"“Superb as usual!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry","cleanliness":5,"Helpful":0,"date":"25 May 2012","sleepQ":5,"rooms":5}
{"User":"WorldTraveller580","Cities":0,"text":"First stay in a Premier Inn. Receptionist made her welcome sound geniune, which can't be easy. She was very helpful and avoided that jaded sing-song response one encounters so often - well done, I really appreciated that. Building was clean and well kept, the room also. Everything appeared new. Room very quiet at night - slept like a log - all equipment worked, and no complaints about the shower. My only gripe was TGI Friday - it was heaving all evening (which was good for them) but there is no way I am going to eat dinner being deafened by dance anthems. Probably an age thing, to be fair - I was the oldest one there - but a short trip to a decent restaurant is definitely called for. The TGIF take-away option I settled for was truly awful and was a mistake that will not be repeated. In total: Hotel good and I will recommend it for colleagues in future - good value, but TGIF bad.","title":"“Good choice for a hotel.”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Brighton","cleanliness":5,"Helpful":0,"date":"15 May 2012","sleepQ":5,"rooms":4}
{"User":"hellen73","Cities":0,"text":"Having never stayed in a premier inn before I was a little wary, as being used to 5* hotels!!! We were attending a wedding in Coombe Abbey & this was only 5 miIes away.Having read mixed reviews about premier inI was a little wary.The guy on check in was very friendly & polite.We had 2 rooms next to each other, the rooms were small but were clean.There is also pub on the site that can be reached by an enclosed corridoor. We ate dinner there, standard pub food, it was ok not the best by my children thought it was ok so they were happy Breakfast next day was ok, great value as kids ate free & they loved it, cereals, toast cooked breakfast, yoghurt &fruit This is a budget hotel & for what we paid for 5 of us it was a bargain .This premmier inn is certainly worth a visit if your on a budget. If like us you are attending Coombe Abbey this is ideal as its 2 minutes away Room Tip: Rooms furthest away from reception, get less noise as everyone has to pass through the corridoors &a... See more room tips","title":"“Friendly staff,Good breakfast, Excellent value for the price.Try it !!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"wales","cleanliness":5,"Helpful":0,"date":"4 May 2012","sleepQ":5,"rooms":5}
{"User":"ali_m199","Cities":0,"text":"I've stayed here several times over the last 5-years and have always found this Premier Inn to be nice and clean with lots of parking spaces. it's also conveniently located. sadly it would seem that in an effort to save money, the moguls at Premier Inn have reduced the amount of water that comes out of the shower (it's something I've noticed at other Premier Inns) and it's very poor. it's also the case that the standards at TGI Friday's (next door) have yet to improve. when i arrived at 8pm i was told i would have to wait an hour for a table - this despite the fact that were plenty of empty tables available - i decided to eat elsewhere. unfortunately i didn't have this option the next morning, having already paid to have breakfast included. the TGI staff were helpful and polite, however the plates, cutlery, cups etc, were either stained or not properly cleaned - and i mean all of them. the food was also mediocre, and despite asking for a poached egg, i was given a fried egg. if this were an isolated incident then i wouldn't bother to complain, however on my previous visits to this TGIF, there has always been something to complain about, be it the service, bland food, or getting the order mixed up so by all means stay here, just try to avoid having to eat at TGIF","title":"“nice hotel, let down by mediocre shower and dreadful TGI Friday's”","hotelReviews":0,"location":4,"Reviews":0,"service":0,"value":3,"Location":"Glasgow, United Kingdom","cleanliness":4,"Helpful":0,"date":"4 May 2012","sleepQ":4,"rooms":4}
{"User":"Linda8287334","Cities":0,"text":"Great service and great comfort. Had everything one would need for an enjoyable stay. Very friendly helpful staff.","title":"“Great Hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Dublin, Ireland","cleanliness":5,"Helpful":0,"date":"30 April 2012","sleepQ":5,"rooms":5}
{"User":"ahhahah","Cities":0,"text":"clean , comfy ,good nights sleep , great shower , lovely staff & extra tea coffee & sugar WELL DONE PREMIER INN x x x","title":"“extra tea,coffee sugar &amp; friendly staff”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"eastbourne","cleanliness":5,"Helpful":0,"date":"29 April 2012","sleepQ":5,"rooms":5}
{"User":"RAW1000","Cities":0,"text":"The Premier Inn had recently been refurbished and some of the public corridors were still being painted. The rooms were neat and cle