{"User":"Sue-Rugby","text":"A huge room that was quiet and very clean. The staff are very friendly. We stayed as we were involved in a theatre production at the theatre (Albany Theatre) that is in the same building. This makes a good combination. Unfortunately the car park is not owned by the hotel and is costly. If you are staying a few nights and don't mind a walk, then parking in the middle of the roundabout under the ring road is only 50p from 6pm until 7am (I think).","hotelReviews":0,"location":5,"Location":"Rugby, United Kingdom","Helpful":0,"date":"29 April 2013 NEW","sleepQ":5,"Cities":0,"title":"“Sue”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"LJB270","text":"Spent three nights in this hotel and was very pleased with both the accommodation and service. The room we had was enormous and everything was spotlessly clean. Could not fault the staff. As the hotel wasn't full breakfasts were being cooked to order and this was a great bonus. Only a ten minute walk from the centre of the city and a couple of minutes walk from a couple of really good restaurants. A very good hotel at an extremely good price.","hotelReviews":0,"location":4,"Location":"Hertfordshire","Helpful":0,"date":"26 April 2013 NEW","sleepQ":5,"Cities":0,"title":"“The only place to stay in Coventry”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":4,"rooms":4}
{"User":"AstirGrob","text":"Good location close to restaurants. The building has been updated and my room was large and clean. Staff were very helpful and parking was easy in the multi-storey car park next door at a cost of £4.5 for the night. Breakfast was good, although I had to wait a long time for it to come.","hotelReviews":0,"location":4,"Location":"London, United Kingdom","Helpful":0,"date":"25 April 2013 NEW","sleepQ":4,"Cities":0,"title":"“Good Quality &amp; Service”","Reviews":0,"value":4,"service":5,"cleanliness":4,"rating":4,"rooms":4}
{"User":"D W","text":"First stay in premier inn very satisfied will definitely use again Hotel breakfast was excellent previously stayed at Hyatt birmingham and breakfast was far better at premier inn The hotel overall was great fir the price paid","hotelReviews":0,"location":5,"Location":"West Midlands","Helpful":0,"date":"22 April 2013","sleepQ":5,"Cities":0,"title":"“Excellent”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Stuart H","text":"Very good stay at good value. Bed comfortable, and very quiet, especially considering the city centre location. Also within easy walking distance of the City Centre. This hotel easily outdoes hotels such as Hilton. The breakfast was probably the best I've experienced - cooked to order and of high quality. And the member of staff couldn't do enough to help. Other hotels could learn a thing or two from these guys. Yes, the Lenny Henry advert is cheesy, but it does exactly what it says on the tin. And it does it very well! A new convert to Premier Inn, and I will be staying much much more.","hotelReviews":0,"location":5,"Location":"Cologne, Germany","Helpful":0,"date":"22 April 2013","sleepQ":5,"Cities":0,"title":"“Excellent value, excellent service &amp; excellent staff”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Smartloobylou T","text":"Had not expected to be staying here but checked in and straight out of Hilton in Coventry and fell for Lenny Henry's sales pitch. This place outdoes Hilton in terms of modernness, fantastic staff, great bed, great pricing, and half the price. Delighted with my first experience of Premier Inn. Very central with good car park practically adjacent and excellent Pizza Express next door even tho hotel also has bar and restaurant. It does what it says. Very happy budget conscious business traveller","hotelReviews":0,"location":0,"Location":"","Helpful":0,"date":"16 April 2013","sleepQ":0,"Cities":0,"title":"“Fab value, quality and service”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"patrick m","text":"The hotel is clean and the staff are helpful, so no complaints there. However, once you enter the car park at the front of the hotel you only have 30 minutes to get your car out before you will be slapped with a £100 parking fine! When were arrived, we were waiting 15 minutes at reception before any staff arrived, and when the staff did arrive they did not let us know that we now only had 15 minutes to move the car before we would have to pay £100 fine (£60 if paid in 14 days). We had left the car in the car park for 58 minutes from 21:48 on a Thursday evening and received a £100 fine 4 days later. Staff should let guests know during the booking in process that they are against the clock or will be facing a large parking fine. Some rooms are also quite a distance from reception - so no chance of booking in, dropping the bags and getting back to move the car within 30 minutes. Room Tip: Move your car within 30 minutes of entering the car park or you will receive a £100 fine! So with t... See more room tips","hotelReviews":0,"location":2,"Location":"Basildon, United Kingdom","Helpful":0,"date":"15 April 2013","sleepQ":3,"Cities":0,"title":"“Watch out for &pound;100 parking fine if you park outside for more than 30 minutes !”","Reviews":0,"value":2,"service":3,"cleanliness":3,"rating":1,"rooms":3}
{"User":"C D","text":"I stayed at this hotel for two nights over a weekend whilst attending a nearby conference. The staff are all very young and friendly and helpful. If possible ask for a room at the back of the hotel and at the end of a corridor. For my first night I was at the front and only a couple of doors down from the stairs and lift. I was woken by banging doors in the night., that said the staff were happy to move me when I asked for a quieter room for the second night.","hotelReviews":0,"location":3,"Location":"Welwyn Garden City, United Kingdom","Helpful":0,"date":"15 April 2013","sleepQ":3,"Cities":0,"title":"“Smart new Premier Inn”","Reviews":0,"value":4,"service":4,"cleanliness":5,"rating":4,"rooms":4}
{"User":"A TripAdvisor Member","text":"The Premier Inn is very easy to book and very reasonably priced - but they don't compromise on service or the quality of the rooms / cleanliness. To me a comfortable bed and good nights sleep is worth everything and Premier Inn delivers. Also the staff were really helpful and friendly, food was good. The only downside was no parking - but in a city centre you can forgive this.","hotelReviews":0,"location":3,"Location":"Newcastle upon Tyne, United Kingdom","Helpful":0,"date":"10 April 2013","sleepQ":5,"Cities":0,"title":"“Great nights sleep”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"Michael vvv S","text":"Booked for 5 nights on business. Firstly IF YOU HAVE A CAR BUDGET FOR AN EXTRA £72 per week!l! There is no car park and whoever runs the \"recommended\" one next door should be shot Note it costs £10 to park in the ramada car park 100 yards away - per week. Just go into the ramada reception and ask for a weeks pass. That's quite a difference. in fact stop in the ramada rather than here. Second night I got stuck in a lift for an hour. The alarm doesn't work. Or more to the point it probably does work and none of the staff care. Eventually I ended up phoning reception from a broken down lift 20 minutes later and they had no clue that the lift had broken down. Good training premier inn. God job there was no fire eh? Ended up having to trek up the same 6 flights of stairs 3 times when my card stopped working. This is NOT THE MEMBER OF STAFFS FAULT. Training training training dear prem inn Actually the staff were actually very nice by and large. 1 star is for greed. 1 star is for putting my life in danger.","hotelReviews":0,"location":0,"Location":"Newcastle upon Tyne, United Kingdom","Helpful":0,"date":"9 April 2013","sleepQ":0,"Cities":0,"title":"“Car parking and broken lifts”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":1,"rooms":0}
{"User":"BrianT81","text":"Good value for money, excellent location for visiting Coventry, the room was large and comfortable. the hotel is a little lacking in atmosphere but has all you need for a good stay, would certainly stay there again","hotelReviews":0,"location":5,"Location":"Cardiff, United Kingdom","Helpful":0,"date":"5 April 2013","sleepQ":4,"Cities":0,"title":"“Coventry central”","Reviews":0,"value":0,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"TeesideNorthandsouth","text":"As per a previouse review Am a PI regular Good choice of Hotel Clean Fresh Modern look inside Excelent service from beginning to end A bit of a walk to town, but it cant be that bad as we walked to town 3 times in 48 hrs. Parking is easy, right next door Only slight issue is cost of parking, but you do get a discount as staying at Premier Inn Room Tip: Be prepaired to do some walking if you are out and about See more room tips","hotelReviews":0,"location":4,"Location":"teeside","Helpful":0,"date":"29 March 2013","sleepQ":5,"Cities":0,"title":"“Yet another good premier inn”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"Ray131262","text":"As a regular PI guest across the UK this hotel like the others delivers a high standard of comfort and service. The staff were exceptionally friendly with excellent customer service skills, nothing was too much trouble. Decor is new, clean, modern, tidy and very nice! Rooms are typical PI style and have tv, kettle bathroom with shower very comfy bed and aircon. Excellent rooms. A small cosy bar with tv (sound down) and a small restaurant with good quality food, although it is a bit squashed in there I found with other guest tables. The big problem for me regarding this hotel is the parking. It's and urban location so concrete jungle, hi rise flats and other hotels which means no on site parking except the car park next door which was circa £9 for an overnight stay. The issue is that you can pay in the lobby of the hotel but it only takes coins, not even notes or cards. The car park operators insist you can pay by phone via an automated system which took me 20 mins on my mobile in the reception area setting up an account, then declaring how long I was parking for in hours when all I wanted to do was pay at the machine and get a drink!,, so if you are coming by car be prepared! But other than that a great welcome and comforting stay! Well done","hotelReviews":0,"location":3,"Location":"Holyhead, United Kingdom","Helpful":0,"date":"21 March 2013","sleepQ":0,"Cities":0,"title":"“URBAN LOCATION - EXC QUALITY AND STAFF - HASSLE PARKING THOUGH”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Lorse","text":"Would usually say that most Premier Inn's were good and do the job but this was great. Set in an old Museum like building. Nice Bar, Big Rooms, would definitely stay again. Best Premier Inn I have ever seen. Staff great 2.","hotelReviews":0,"location":4,"Location":"Cardiff","Helpful":0,"date":"21 March 2013","sleepQ":5,"Cities":0,"title":"“Fab Hotel, not what you expect”","Reviews":0,"value":5,"service":5,"cleanliness":4,"rating":4,"rooms":4}
{"User":"Rick A","text":"Room was superb, very high quality finish to match the grand features of the building. Lots of TV channels to choose from. Could have done with more tea bags though! Staff were exceptionally friendly, especially at breakfast, which was freshly cooked to order and very tasty. Room Tip: Try not to get a room near the lift or stairs as on a previous visit I had a room there and the nois... See more room tips","hotelReviews":0,"location":5,"Location":"Cheltenham, United Kingdom","Helpful":0,"date":"17 March 2013","sleepQ":5,"Cities":0,"title":"“Lovely hotel”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"philip q","text":"stayed 3 nights good clean hotel. Walking distance for city centre. Staff were all very friendly and helpful. We ate in the resturant each night good choice of menu. The bar area has a good seating area for drinks or coffee. The only thing to spoil it is the main entrance has automatc doors which allow cold air in making it chilly sat there. I feel sorry for the receptionists who have to sit there !!. Room Tip: high floor rooms are very quiet See more room tips","hotelReviews":0,"location":4,"Location":"bath","Helpful":0,"date":"14 March 2013","sleepQ":5,"Cities":0,"title":"“weekend break in coventry”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"Emma J","text":"Stayed here for two nights while we were exhibiting at Crufts, saw the same young lady on reception on the way in and the way out, she was very friendly, polite and professional. An asset to Premier Inn. The staff were all very commendable and can't do enough to help you. Rooms were just beautiful and the whole building feels very luxurious, not at all like a budget hotel. Food was delicious, reasonably priced and free 30 mins wifi is certainly an added bonus.","hotelReviews":0,"location":5,"Location":"Stoke-on-Trent, United Kingdom","Helpful":0,"date":"11 March 2013","sleepQ":4,"Cities":0,"title":"“Friendly staff, lovely rooms, beautiful building”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"MikeSiberian","text":"Played a gig at a pub up the road which finished at one in the morning - taxi home in a rattling black cab £35 or stay in this place £50 ? Obviously a no brainer. The good lady appreciated all the usual premier inn comforts- the staff were ace and after a nice lie in I was sober enough to drive us both home in the motor that i'd left at the pub. Its no frills but the formula is working - other hotel chains take note. Previously I stayed at the Ramada up the road after a gig and the room was bloody freezing on arrival! It was a tenner cheaper but I'd rather have been warm. Keep up the good work Premier , I shall stay again. Room Tip: Get hammered and they all look the same! specially with that purple theme going on!! See more room tips","hotelReviews":0,"location":5,"Location":"Coventry, United Kingdom","Helpful":0,"date":"8 March 2013","sleepQ":5,"Cities":0,"title":"“Taxi home or stay here? no brainer.”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":4,"rooms":5}
{"User":"Christines_Friend","text":"The hotel has been cleverly crafted from the building which previously housed the city's Technical College. The room I stayed in was clean and well appointed. The 3 members of staff I encountered were unfailingly helpful. Given the low usage the breakfast was part buffett parked cooked to order and struck me as very good VFM. The evening menu is a bit limited but (a) its a Premier Inn so what do you expect and (b) was well cooked and promptly served. Room Tip: My 3rd floor room had a sealed window but the air con was more than adequate. No noise at all See more room tips","hotelReviews":0,"location":4,"Location":"London","Helpful":0,"date":"8 March 2013","sleepQ":4,"Cities":0,"title":"“Interesting Venue”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":4,"rooms":4}
{"User":"2179locke","text":"Sitting inside the technical college as was this new Premier Inn (opened 2012) is a real find. Quiet even the road side rooms, and the usual Premier Inn comfort. The only niggles are - if the room is away from the router the wifi can be slow. And if any staff go off at short notice there has been slow service on a couple of occasions. A paying car park, but very secure","hotelReviews":0,"location":5,"Location":"Milton Keynes, United Kingdom","Helpful":0,"date":"6 March 2013","sleepQ":5,"Cities":0,"title":"“Great new build hotel”","Reviews":0,"value":4,"service":3,"cleanliness":5,"rating":4,"rooms":4}
{"User":"dj1","text":"I booked this for 1 night without checking TripAdvisor, as I like staying in Premier Inns and the location of this one was spot on for my night out with friends. After a great stay, I thought I'd write a review and I'm not at all surprised to see this is the first choice of hotels in Coventry. The last time I was in this area, this building was an old technical college, and it's been superbly converted into a really unusual Premier Inn, retaining many of the art decco features including leaded windows and a beautiful brass railed staircase. My room was large and an interesting odd shape. Large windows looked out over the not too pretty Coventry skyline. The bathroom was spotless and what you can expect from a Premier Inn. I noticed silly things like the care that had been taken in lining up the mugs and aligning the spare pillows. Breakfast was cooked to order (I am not sure if this is usual) and the food was better than expected. The decor of the newly decorated restaurant is very nice and better than most Premier Inns in terms of style. The two members of staff that I came across - the young lady on check in and the lady managing and serving breakfast were both friendly and efficient. All in all, a really pleasant experience and frankly, you'd be daft to stay anywhere else. Parking is round the corner and paying for that is a bit of a pain, but the receptionist was helpfeul in explaining the system and getting me change. You do need to factor in the £8.10 (24 hour rate) to park, but overall good value even so.","hotelReviews":0,"location":5,"Location":"Milton Keynes","Helpful":0,"date":"4 March 2013","sleepQ":5,"Cities":0,"title":"“Don't go anywhere else”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"yedder","text":"stopped overnight on 2nd febuary 2013, lovely hotel, old college building, room was great, large, quiet and warm, restuarant fine, £19 for night, Highly recomend. Used as base to go horse riding for wifes birthday present. Ideal. Carpark charges £8.10p in multi-story, but barriers were out of order so did not have to pay really, worth checking before getting ticket from hotel reception. Staff were great, only little criticism was nothing to keep myself and my 8 year old occupied for a while, when we recently stopped in a Premier inn at Hemel Hempstead there was a pool table and gambling m/c! - which we thoroughly enjoyed for an hour or so and i was constantly being dragged off to the one armed bandit to fill with hard earned readies. but i do like a gamble now and then, Worth thinking about---.coventry. Highly recomend this hotel. Room Tip: no preference, 2nd floor very quiet, See more room tips","hotelReviews":0,"location":5,"Location":"Wellington, United Kingdom","Helpful":0,"date":"3 March 2013","sleepQ":5,"Cities":0,"title":"“lovely building”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":5,"rooms":5}
{"User":"mcmahos","text":"Had a few nights here on a business trip. The building is a former technical college. Staff were extremely helpful and friendly. Room was large and clean, and looked like it had been recently refurbished. Any previous stays at a Premier Inn have always had a buffet-style breakfast, so was surprised to find that orders were taken for cooked breakfasts, albeit you could ask for any quantity of any of the items (eg 3 sausages, 2 fried eggs etc). Cereals and toasts/croissants were self service. Evening meals were fine, although as were we eating as a group close to closing time (10pm) several items were unavailable.","hotelReviews":0,"location":3,"Location":"Ardrossan, United Kingdom","Helpful":0,"date":"1 March 2013","sleepQ":4,"Cities":0,"title":"“Good quality and friendly”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":4,"rooms":4}
{"User":"Kopite52","text":"I wrote a 'good' review about this hotel last year but like a lot of city centre Premier Inn's parking is a problem. The stress when using the official car park where you are supposed to pay before you park is bad enough, with all its rules and regulations - but beware you will certainly get a fine if you ignore the warning signs outside about the 30 minute maximum parking on the front forecourt. I ignored this on day one of check in and stayed longer maybe an hour. A month later I got a charge to my credit card of £60 as a fine for overstaying. Then because it was a rental car from Sixt the rental co hit me with another £25 \"administration charge\". So £85 in total. There is a camera covering the car park entrance. It photographs the number plates of all vehicles on the way in and on the way out then calculates the time, if you are over you will get the £60 charge. Suggest you look for street parking but it is very limited near by and you have to leave by about 10am latest as most street slots are 2 hours only from 8am.","hotelReviews":0,"location":4,"Location":"Sentosa Island, Singapore","Helpful":0,"date":"27 February 2013","sleepQ":4,"Cities":0,"title":"“Car Park Warning &pound;85 charge !”","Reviews":0,"value":4,"service":5,"cleanliness":4,"rating":4,"rooms":4}
{"User":"NrlY","text":"Stayed here in End Jan since we need to attend convocation at Warwick University. Got the Winter deal for 19pounds per night. Checkin was super easy. There is a kiosk and key in the confirmation #, keys are given from Kiosk. There was a staff there that guided, but it was easy to do on our own. The room was excellent! It was clean, looks bright, modern, WONDERFUL BED. 'Guaranteed good night sleep' slogan was really fitting. The only thing amiss was the hotel did not come with it's own parking space. There is a multistorey car park beside it which charged about 9 pound per full day. If you have a car, there is another Premier Inn in conventry (South) which has parking facility. I would probably stay there if I had a car and Earlsdon if I don't drive. Room Tip: None as the rooms are auto assigned. The standard room is big enough. See more room tips","hotelReviews":0,"location":3,"Location":"Shah Alam, Malaysia","Helpful":0,"date":"27 February 2013","sleepQ":5,"Cities":0,"title":"“Excellent Bed, Nice big rooms, good stay!”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":4,"rooms":4}
{"User":"ArthurGough","text":"Premier Inn at its best, great staff who are keen to please. Good breakfast and decent restaurant with limited choice. Plenty more varied restaurants nearby. Parking a problem but multi storey next door as with many other city centre hotel locations. Large comfortable rooms, only 1 lift otherwise, due to the age of the magnificent building that houses the hotel, some long steep staircases to climb.","hotelReviews":0,"location":4,"Location":"Liverpool, United Kingdom","Helpful":0,"date":"26 February 2013","sleepQ":5,"Cities":0,"title":"“Premier Inn at its best”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Joanne D","text":"Staff were more than helpful, I had broken my foot the day before, so was very worried, and the night before at home couldn't get upstairs to bed, so it was lovely after a great night out, laying in a big big bed. Manager was very compassionate about my leg, staff ran to hold door open, reception staff very polite and moved our room nearer to the lift. Janet at breakfast was very good and made sure we had a great breakfast to start the day. On the whole nothing was to much trouble, when we arrived and I ordered a drink whilst my husband park car, they served me at the table. We would def like to stay here again and would recommend.","hotelReviews":0,"location":5,"Location":"Coventry, England, United Kingdom","Helpful":0,"date":"25 February 2013","sleepQ":5,"Cities":0,"title":"“Excellent nights rest”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"amanda31","text":"We had a weekend away , Saturday - Monday . The staff were lovely and extremally helpfull. Food was great as we included the meal deal in the room price . Location was great as we went to retro race , Transport Museum and cinima . Amber , sam and norma were on duty and couldn't help any more than they did .","hotelReviews":0,"location":5,"Location":"hertfordshire","Helpful":0,"date":"24 February 2013","sleepQ":0,"Cities":0,"title":"“Amazing Staff and super Amazing Rooms and facillitys”","Reviews":0,"value":0,"service":0,"cleanliness":5,"rating":5,"rooms":0}
{"User":"Robert C","text":"I have only stay in Premier Inns for business, this one is like all the rest but the rooms are bigger. The breakfast was brilliant, the service and all the staff were attentive without being that ingratiating American style suck up. The building is pretty impressive, but the stairs and entrance to the reception are poorly signed. The only problem is parking! There is a multi Story car park next door to the Hotel, BUT you must pay when you start parking which is fine if you knew this fact! The car park has no barriers or tickets, you need to have ESP to know that you need to pay up front. If you call the \"pay by phone\" they won't take any money after you have parked as I assume the want to issue the £100 fine. I'll update you if they try to fine me, I am a past expert at small claims court so they had better accept my late payment! Room Tip: Big rooms, See more room tips","hotelReviews":0,"location":4,"Location":"Clitheroe, England, United Kingdom","Helpful":0,"date":"21 February 2013","sleepQ":5,"Cities":0,"title":"“Great Hotel beware Parking Trap”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Steve B","text":"Just outside the main city, parking an issue, but possible. Rooms and hotel comfortable and clean. Restaurant adequate, but choice in the City (10 minute walk).Decent Freeview TV in room. Best (nearly) in the City I've found yet.","hotelReviews":0,"location":4,"Location":"","Helpful":0,"date":"21 February 2013","sleepQ":5,"Cities":0,"title":"“Comfortable and well located”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":4,"rooms":5}
{"User":"touchline","text":"Booked early and got a great price for a double room. Hotel is just off the City centre and in great condition. Very clean with good quality facilities and our room was large. Freeview TV and air conditioning in our room. We asked for an iron and an ironing board, the duty Manager brought it straight to our room! All staff are very friendly and their customer service is good. We did not want any food, but you can either book in advance or pay waiter service at the table. A good selection of drinks at the bar, which is a nice area to drink and meet. Although only for one night, this hotel was more that we expected. Would stay in any Premier Inn after this superb experience.","hotelReviews":0,"location":5,"Location":"Luton, Beds","Helpful":0,"date":"17 February 2013","sleepQ":5,"Cities":0,"title":"“Great value for money.”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Mike R","text":"I recently stayed here for 8 nights whilst attending a trade show at the NEC. Located close to the centre of Coventry with many options of local pubs and restaurants nearby yet only 25 min drive to the NEC it suited my group perfectly. We did eat out for 3 of our 8 nights but for the other 5 the hotel restaurant was absolutely fine. The hotel staff were wonderful, 100% happy to help and advise. We did have an error in our booking (which was made via Premier inn's central booking) but Matt (the duty manager) sorted it quickly to my 100% satisfaction. Errors can occur anywhere but are not always rectified as well as was done here. The only downside is the limited wardrobe and drawer space in the bedrooms, not a problem for 2 or three nights but when staying 8 nights to set up and run a trade fair you need to bring a few extra hangers to use on the coat hooks. I will certainly book my group here again.","hotelReviews":0,"location":5,"Location":"Leyburn, England, United Kingdom","Helpful":0,"date":"11 February 2013","sleepQ":4,"Cities":0,"title":"“A very pleasant stay”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"JenM487","text":"We have just returned from a weekend in Coventry. We stayed in this Premier Inn and found it excellent. The rooms were large and well equipped and the breakfast was great value for money. A special mention must be given about the young staff who were efficient and went out of their way to be helpful. I would certainly stay here again.","hotelReviews":0,"location":5,"Location":"Stockport, United Kingdom","Helpful":0,"date":"10 February 2013","sleepQ":5,"Cities":0,"title":"“Great Stay”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Andrew C","text":"Fantastic staff. Great room. Good food. And the building, a former Technical College, built in 1935 is stunning. The original lobby and staircase is largely unaltered with the reception for the Prem Inn being off the side and whilst a shame it doesn't make use of the space, it is good that it does not damage the interior. Very friendly and helpful staff really made it though.","hotelReviews":0,"location":5,"Location":"Chichester, United Kingdom","Helpful":0,"date":"7 February 2013","sleepQ":5,"Cities":0,"title":"“excellent stay in a beautiful building (well, lobby and staircase!)”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Jane M","text":"Myself and a business colleague stayed at this hotel as it was quite convenient to the NEC. Very reasonably priced, nice comfortable rooms and other areas, such as bar and restaurant. We took the 3 course meal deal option and got the Premier breakfast thrown in, which was a real saving. Staff could not do enough for us, would definitely go back again. Room Tip: Rooms at the back of the hotel might suffer from early morning noise from the laundry delivery truck... See more room tips","hotelReviews":0,"location":5,"Location":"Colchester, United Kingdom","Helpful":0,"date":"6 February 2013","sleepQ":5,"Cities":0,"title":"“Brilliant staff, very comfortable hotel !”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"PatricVO","text":"Great hotel. Location perfect for trains and town center -5 min. Walk. We have just stayed here whilst visiting the NEC for a trade fair. Just 20 mins on the train. The hotel was everything that we've come to expect from Premier Inn; clean; comfortable; great, well equipped rooms. What made the hotel outstanding was the staff... Especially Ruth and James, who made us very welcome and helped us with local maps, amenities and advice... We would highly recommend this hotel...","hotelReviews":0,"location":0,"Location":"Marbella","Helpful":0,"date":"5 February 2013","sleepQ":0,"Cities":0,"title":"“Awesome!”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"baal","text":"Stayed here as my daughter had an interview at Coventry Uni and we found it to be one of the best Premier Inns we've stayed in.We chose to stay here as it was close to the railway station.( the city centre one would have been nearer to the Uni). The staff were very friendly and helpful. The rooms were large and very clean. We ate in the on site restaurant( thyme restaurant ). We payed £23 for a three course evening meal along with drink and breakfast next day. Food was typical family pub type and quite good. The breakfast next day was excellent and all foods were branded and not cheap versions. Reception staff gave us a map of coventry and highlighted our route to the Uni. They kept our case until we returned later in the day free of charge. On returning a lovely young man named James went out of his way to ask my daughter how she had done and then directed us back to the railway station. A taxi is cheap at £3:40. I would stay here again.","hotelReviews":0,"location":5,"Location":"north wales","Helpful":0,"date":"3 February 2013","sleepQ":5,"Cities":0,"title":"“Excellent Pemier Inn”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"vicguy45","text":"Stayed here for a couple of nights for work. Apparently only opened a year ago, so everything was new and clean. Bed was comfy, service was excellent, and despite the very cold weather, lovely and cosy. The restaurant was quite decent too, and the whole stay was remarkably cheap. Big cudos to Kayleigh, who seemed to be there all the time, and did all the jobs, but was always cheerful and friendly. And very efficient. Would happily stay again.","hotelReviews":10,"location":5,"Location":"Coventry, West Midlands","Helpful":9,"date":"3 February 2013","sleepQ":5,"Cities":14,"title":"“Excellent hotel”","Reviews":26,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Balix","text":"I tend not to review Premier Inns as one is much like another but I'm making an exception for this one for a number of reasons. I'm not sure of the history but the hotel is housed within an old public building just outside the ring road and is just a short walk from the Skydome and city centre beyond. The reception staff were very friendly and only too happy to give out advice. The room was indeed like nearly all other Premier Inn rooms I've stayed in - plenty big enough, comfortable bed, and perfectly adequate. No Corby Trouser Press, mini bar, batrobes, shower caps, sewing sets etc but as I didn't need any of them they were not missed. They offer you half an hour of free wi-fi per day so even if you are staying one night you can get it twice. It is £3 per day after the free half hour. This is a better deal than many hotels though I'd still like to see all hotels offering wi-fi as a service rather than a revenue stream. Breakfast was £8-95 for the full English, not bad value at all and it is served until 10:30 which is good for those of us who don't need to be up with the lark. So far, nothing out of the ordinary for a Premier Inn. What clinches the five star rating is the fact it cost just £19 for the night. A clean and comfortable room in a near city centre location for nineteen quid? Bargain!","hotelReviews":0,"location":5,"Location":"Troon, UK","Helpful":0,"date":"28 January 2013","sleepQ":5,"Cities":0,"title":"“Coventry Bargain”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"maddy f","text":"We recently stayed overnight at this Premier Inn as my daughter had an interview at the University the following day. We had to travel in terrible weather - the snow was appalling and a journey that should have taken around three and a half hours took closer to six. When we arrived we were exhausted and cold. However,the warmth of the welcome at this hotel soon cheered us up! The hotel receptionist could not have been more help and our rooms were spacious and spotless. The next morning our breakfast was beautifully prepared and we thoroughly enjoyed our time there. Once again, the receptionist went out of his way to help us, offering advice on how to get to the University and calming my daughter's nerves! The best part of it all was that we only paid £19 for our rooms - it was one of the best £38 we have ever spent and we wished we were staying longer. It is safe to say that of my daughter ends up at Uni in Coventry, we will be making lots of trips to this hotel!","hotelReviews":0,"location":5,"Location":"durham","Helpful":0,"date":"27 January 2013","sleepQ":5,"Cities":0,"title":"“A port in a storm!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Nottsguyonhistravels","text":"I've stayed at this hotel on a number of occasions for business and have enjoyed my stay every time. Sometimes being in a hotel on your own can be rubbish but the staff are great, friendly, welcoming, cheerful, what more can I say. The food is great, tastes fresh, well cooked, and tasty. Chose the meal deal when I stayed and even on the limited menu there is such a good choice. Can't rate this hotel high enough, by far better than the other Premier Inn in the centre. Look forward to my next stay next week.","hotelReviews":0,"location":5,"Location":"","Helpful":0,"date":"22 January 2013","sleepQ":0,"Cities":0,"title":"“Amazing staff, Fab hotel”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"annavcarter","text":"We were really happy to get a huge family room in this fantastic building and also had super service from the check in staff and a great breakfast. Only small gripe was no parking, but we parked on street very close to hotel.","hotelReviews":0,"location":4,"Location":"Norwich, United Kingdom","Helpful":0,"date":"18 January 2013","sleepQ":4,"Cities":0,"title":"“Great value”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"MKdons L","text":"I loved this hotel, if it was a person I would marry it, but that's going too far. I loved the 5 star service from the restaurant the food was quick and lovely the most food i really enjoyed but the dry cucumber let it down on the starter. The waitress Sam was completely professional and I think she has been taught by Gordon Ramsey she is that good! I had a great night i got a wake up call on the dot which was beautiful I got woken up by a nice female voice. Lovely. I enjoyed everything about the hotel but the blowy machine was little bit annoying, I had to turn down the a/c from 24 back down to 22 but it was on 19 when i was there. In room 206 i had a little bit of dirt on the bath but apart from that it was brilliant. I think the baths are the best baths in the world. The bed was a bit firm but thats because i am used to softer beds. But the bed was better than my own. I loved the duvet and the pillows, everything was clean, the mirror had lights on. I really wanted to stay another night but i couldnt, when i win the lottery i will come and live here!!!","hotelReviews":0,"location":4,"Location":"London, United Kingdom","Helpful":0,"date":"16 January 2013","sleepQ":4,"Cities":0,"title":"“The best hotel of the year by all standards”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"wendy a","text":"I stayed at this hotel for 2 nights in early Jan this year (2013) with a friend. From the moment we arrived, we were looked after very well. The staff at reception were extremely helpful, and those at breakfast too. Everybody working there was cheerful and smiling. Our room was warm, clean and comfortable. Check out and breakfast times were very good (some can be much too early). The price of the room was fantastic - we got the special offer of £19 per room. Because it was such good value, we bought breakfasts on both mornings and couldn't believe how good the choice was. We also loved the fact that cooked breakfasts are ordered and come to you fresh. I will definitely choose Premier Inn again.","hotelReviews":0,"location":4,"Location":"Leeds, United Kingdom","Helpful":0,"date":"13 January 2013","sleepQ":5,"Cities":0,"title":"“An excellent hotel experience”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Ei O","text":"I cannot begin to describe how warm the staff have been with me during my stay in Coventry. I have had a fantastic time with James (the manager) and Gabor. They have been kind, attentive, thoughtful and considerate throughout my stay. There was nothing that more I could ask for in a hotel stay. I wish I could thank the staff more but all I can do is write this review and encourage as many people as possible to enjoy this rare delight in low cost hospitality. Please enjoy Coventry Premiere Inn and all it has to offer. The modern design is a stunning addition to the city centre. Room Tip: 2nd floor has a delightful Coventry. See more room tips","hotelReviews":0,"location":5,"Location":"Barcelona, Spain","Helpful":0,"date":"12 January 2013","sleepQ":5,"Cities":0,"title":"“Probably the best hotel experience I've ever had”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"BigAde9","text":"We visited this hotel just before Christmas and stayed for one night. Finding the place meant navigating Coventry's scary ring road system and high-speed roundabouts, but wasn't too difficult. The hotel is the old technical college and has been open as a hotel less than a year so everything is new and clean looking. The building itself is stunning and the old entrance hall is well worth a look before you go into reception (a door immediately on the right as you go in). Very friendly receptionist and nothing was too much trouble. Unlike most receptionists I've met she seemed most genuine and didn't seem bored or wearing a fake smile. Taxis booked and change found for the parking machine with a smile. Rooms were clean and comfortable, bathroom the same. High ceilings, air-conditioning. All spotless and very nice. Breakfast had a free kids meal offer and was one of the nicest breakfasts I've ever had in a hotel. Not cheap perhaps, but very good for the quality of what you got. Parking is the only thing that isn't great, while not being terrible either. There are a handful of 30 minute parking spaces outside the front of the hotel for unloading/loading. Otherwise there is a multi-storey next door that you have to park in. At £8 for a day (payable at a machine in the hotel reception), it isn't exactly cheap and I felt a bit uncomfortable leaving the car in a multi-storey overnight. There is plenty of waste ground around the back of the building, so I don't see why this couldn't be utilised as a proper hotel car park? Only other problem was that just before checkout both our room keys (that had been working fine)stopped working... we were well before the 12pm deadline for checkout so I don't see why this happened. On balance though a very nice stay. Not quite as cheap as it first appears once £8 for parking and £8 pp for breakfast is added on, but I would argue still good value. Premier Inn have a winner on their hands in this place.","hotelReviews":0,"location":5,"Location":"Sussex","Helpful":0,"date":"10 January 2013","sleepQ":4,"Cities":0,"title":"“Great hotel - friendly, clean and comfortable”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"Jmd67","text":"Stayed for one night at this premier inn. The lady on reception was lovely and really helpful she showed me how to check in with their new system. I managed to lock myself out of my room and she was really polite and said it happens all the time. Nothing was too much trouble for her. The room was bright and airy no complaints.","hotelReviews":0,"location":4,"Location":"Coventry, United Kingdom","Helpful":0,"date":"9 January 2013","sleepQ":4,"Cities":0,"title":"“Overnight stay”","Reviews":0,"value":5,"service":5,"cleanliness":4,"rating":4,"rooms":4}
{"User":"InstructorMan","text":"The experience was great from the moment we entered. The impressive building used to be a Technical College and, inside, it's all marble, pillars and brass. The room was spacious, comfortable and very clean with the feel of a room in a much more expensive hotel with an excellent shower and other facilities. The breakfast was excellent with very friendly service but the star was James who was on reception when we arrived and also in the morning. Nothing was too much bother for him and he made us feel right at home through our stay. Will definitely stay there again and highly recommend it as great value.","hotelReviews":0,"location":0,"Location":"Luvverley Devon","Helpful":0,"date":"6 January 2013","sleepQ":0,"Cities":0,"title":"“Great value in grand surroundings”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"baylis123","text":"Excellent and polite service from ALL staff. Breakfast food really very good. See no reason at all for any one to complain about the food and service at this premier inn. Our room 233 was very spacious and noise free. Quality of towels provided was superb. We loved every bit of our stay at this Premier Inn and will use again often. Staff Very very hekpful and friendly. Room Tip: ROOM 233 very spacious and noise free!! See more room tips","hotelReviews":0,"location":5,"Location":"Burnham-On-Sea, United Kingdom","Helpful":0,"date":"31 December 2012","sleepQ":5,"Cities":0,"title":"“Visiting Coventry and Using Premier inn Earlsdon for first time”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Michelle W","text":"Not sure if it was just the Christmas spirit but just returned from an amazing 2 night stay at this hotel. Staff friendly and helpful - room spacious and clean and a bargain at just £19 per night. Breakfast good value and plenty of choice as good as any 4* hotel. Having to pay for parking is a negative but as the hotel wasn't full was allowed to leave my car at the front of the hotel for the second night foc! Would definitely return! Thanks to James and the staff for making it such an enjoyable stay.","hotelReviews":0,"location":4,"Location":"Bury, United Kingdom","Helpful":0,"date":"27 December 2012","sleepQ":5,"Cities":0,"title":"“Welcoming and friendly!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":4}
{"User":"CapeTownInAugust","text":"All these amazing reviews you read are infact true! I booked early enough in advance to get my room for £29 - it was huge, clean and lovely and felt more like a £129 than a £29 room. If it wasn't for the fact I had come to the area for a busy conference, I'd have happily stayed in my room all day. I called a few times before coming to ask questions etc and every time I called the staff were lovely and super helpful. The great customer service continued when I arrived. I was there over Xmas day when there was no public transport and when I asked someone on staff for a number for a cab firm they told me not to waste my money - they would drive me to my destination themselves! I was ridiculously touched by this : ) Other staff members were equally helpful in trying to find attendees at my conference who might be able to help me with rides. I was incredibly happy with my choice of hotel and wish you a great stay here, too!","hotelReviews":0,"location":0,"Location":"London","Helpful":0,"date":"26 December 2012","sleepQ":0,"Cities":0,"title":"“A total gem of a place - amazing value and fab customer service”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":0}
{"User":"Stewart W","text":"It ticked all the boxes for convenience, price, location (close to the pretty Spon End), the staff were all friendly, bed comfortable, bathroom spotless and the English breakfast was good. But, the room was at 18 degrees on arrival, which was not the warm welcome one would have preferred. And, when set to the maximum of 24 degrees, it never felt anywhere near that figure","hotelReviews":0,"location":4,"Location":"London, United Kingdom","Helpful":0,"date":"10 December 2012","sleepQ":3,"Cities":0,"title":"“Only let down by cold room”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":3,"rooms":4}
{"User":"Sarah Q","text":"Stayed for the whole weekend and was well greeted by friendly and useful staff. Didn't mind the car parking prices (£8.10 for 24hours) as double that at premier inns near us! Location is brill 10min walk into town. The staff were great answering all our awkward questions and made us feel very welcome even remembering us every morning and saying hello. We had a family saver room and it was huuuugeeeee and premier really have made an effort to make sure we get a good nights sleep from letting us choose our heating,pillow choices and providing a very comfy bed. Overall a more than pleasant stay finished off with an unlimited breakfast!","hotelReviews":0,"location":5,"Location":"Fordingbridge, United Kingdom","Helpful":0,"date":"9 December 2012","sleepQ":0,"Cities":0,"title":"“Best premier!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"joeal_9","text":"A colleague and myself stayed for four nights during December 12. Upon arrival I was really impressed by the friendly welcome and help with the check in process which is completely different from any hotel I had ever stayed in before. My room was spotlessly clean and maintained to a high standard during my stay. The food was good and the restaurant experience was well complimented by the friendly staff. All in all a very pleasant stay, and as promised by Premier Inn's \"a good nights sleep\" Room Tip: If possible pick a double or family room. See more room tips","hotelReviews":0,"location":3,"Location":"Ballymoney, N.IRELAND","Helpful":0,"date":"9 December 2012","sleepQ":5,"Cities":0,"title":"“Excellent”","Reviews":0,"value":4,"service":4,"cleanliness":5,"rating":4,"rooms":4}
{"User":"LCNtraveller","text":"Liked: Can put sign on door to NOT clean the room. Glad there are no extra cushions on the bed just for decoration. Hairdryer is right where it’s needed, by a mirror and plugged in. Three electrical outlets above desk. Light-blocking drapes. Wi-fi works even in farthest room. (Wish it was a security-enabled network.) Dual-flush toilets. I had a spacious room with sofa. Didn’t like: I do not like the screens for registering. I still had to deal with the reception staff to (1) buy a wi-fi voucher, (2) request a room on the quiet side of the building – so the room keycard had to be rescanned. What is the point of using the screens? It is misleading to advertise “Free wi-fi” when only 30 minutes per day is free. I always have to buy vouchers for more access. I also wish it was a security-enabled network. Why do I have to open Internet Explorer before another browser can be opened? Room could use a luggage stand. Bathroom needs more towel rods. Windows can’t open. No heat in the bathroom, so it was cold in December. Why are towels replaced when I haven’t left them in the shower/tub? The stated water-saving policy isn’t being followed. I sometimes noticed that Reception was unstaffed, or no one in sight. (Nowhere for them to sit?) In spite of these issues, I will still occasionally choose to stay at Premier Inns. The rooms are generally large and comfortable, with most conveniences provided. Room Tip: Rear side, far end of hall, was nice and quiet. See more room tips","hotelReviews":0,"location":4,"Location":"Victoria, Canada","Helpful":0,"date":"8 December 2012","sleepQ":5,"Cities":0,"title":"“Very nice after the screen sign-in”","Reviews":0,"value":4,"service":4,"cleanliness":5,"rating":4,"rooms":5}
{"User":"CashMc","text":"Hotel is set in a stunning building and has a large number of rooms. Bar is 24 hours and prices didn't seem too bad. On site parking is for a maximum of 30 mins and and longer needs to be in the next door multi storey (2 min walk). There is a reduced pay meter in the lobby of the hotel or do what we did and use the app to keep it topped up. £4.50 for 12 hour stay. Rooms are more than big enough and have usual tea making facilities, TV and phone. Bathroom wasn't too cramped either.","hotelReviews":0,"location":5,"Location":"Whitley Bay, United Kingdom","Helpful":0,"date":"2 December 2012","sleepQ":0,"Cities":0,"title":"“Shame about the parking”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"RamsgateKevin","text":"Stayed for one night, travelling through on business and to spend an evening with my son who is at University in the city. As a veteren Premier Inn user, i find all their staff very well trained, genuinely friendly and eager to please. This hotel is no exception. The bar has a particularly nice atmosphere for a chain hotel group. The hotel is a little way (20 min walk) from the heart of the City but is only a cheap taxi ride in bad weather. The car parking, however, is detached and rather expensive for an overnight stay. Room Tip: Ask for a room at the rear See more room tips","hotelReviews":0,"location":3,"Location":"Ramsgate, United Kingdom","Helpful":0,"date":"1 December 2012","sleepQ":5,"Cities":0,"title":"“Good value, very friendly”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":4}
{"User":"yggdrasil1","text":"Very welcoming, helpful staff and rooms spotless. For what you pay at this place it is a bargain. 10 Minutes walk from Coventry's city centre. I had an issue with people in this hotel and have spoken with the manager about it who showed great concern and emailed me and phoned afterwards to take all the details. Very professional service.","hotelReviews":0,"location":4,"Location":"Kidderminster, United Kingdom","Helpful":0,"date":"28 November 2012","sleepQ":4,"Cities":0,"title":"“The best premier inn I have seen.”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"McFarlane09","text":"my husband ,myselfi and our 2 adult sons stayed here on 23/11/2012- this is now the 4th time we've used this hotel when we've visited the area- everything fabulous as usual. Absolutly nothing to complain about- clean, pleasant,airy spacious rooms . We really enjoyed our breakfast and have no doubt we will be back here again. good efficient staff too","hotelReviews":0,"location":5,"Location":"Gateshead, Tyne & Wear","Helpful":0,"date":"27 November 2012","sleepQ":5,"Cities":0,"title":"“back again and still just as good”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Joan M","text":"This hotel has maintained its \"new\" appearance, and the room was pristine clean and neatly furnished. The bathroom is spacious, clean and well appointed. The staff are all friendly and helpful, and the restaurant provides excellent quality breakfast for the price. The site is quiet, and the only drawback is lack of on-site parking, though there are 2hr spots in the surrounding streets. Room Tip: They are all good! See more room tips","hotelReviews":0,"location":4,"Location":"Coventry, United Kingdom","Helpful":0,"date":"21 November 2012","sleepQ":4,"Cities":0,"title":"“Fantastic service”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Jo B","text":"We have just had the most brilliant weekend at this wonderful hotel. The staff were really helpful and obliging - nothing was too much trouble. Food excellent, they are trialling a new menu which we hope remains as it had excellent choices; really comfortable lounge area. Great atmosphere we loved the art deco building with all the original features in the grand entrance, hard to think that it was once a Technical College! Our room was spacious,comfortable and very clean as was the bathroom, all tiling/grouting really gleaming. We had worried about the car park thinking that it might be a long way to walk but it is literally next door to the hotel and really convenient. This was our very first time to Coventry, we had travelled up for the Car Show at the NEC, we left our car at this car park and got the train which took us right into the Exhibition Centre, a really cheap and frequent service and cost less than parking at the NEC. I would certainly recommend this Hotel. A special commendation should go to Kayleigh, the Receptionist, who took so much trouble sorting out everything for us and to Paul our waiter for also being so very helpful. In fact all the staff were SO pleasant and cheerful which is so rare nowadays.! Thank you all, we would certainly stay again.","hotelReviews":0,"location":5,"Location":"Bideford, United Kingdom","Helpful":0,"date":"19 November 2012","sleepQ":5,"Cities":0,"title":"“DELIGHTED”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Kevin B","text":"Stayed for one night, helpful and welcoming staff. Room very clean and lots of space. Breakfast a little on the expensive side but very assessable and very helpful staff their too. The only downfall is the parking and the price of parking.","hotelReviews":0,"location":5,"Location":"Swanley, England, United Kingdom","Helpful":0,"date":"19 November 2012","sleepQ":5,"Cities":0,"title":"“A very nice stay”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"paddyandlin","text":"Well this was a diffrent experience, very accessible relly nice staff and really easy to use. I cannot fault this hotel for accessibility if i tried hard the only issue is using the card to call lift and no electronic bedroom door. but great hotel well done premier Inn for once you listened to disabled people. PS might be nice to have a bit more signage . Room Tip: If you cannot use the machine go in bar area and staff will help. See more room tips","hotelReviews":0,"location":4,"Location":"Hertfordshire","Helpful":0,"date":"18 November 2012","sleepQ":5,"Cities":0,"title":"“WOW”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Johnmw","text":"A lovely Art Deco building, spacious, quiet room and all the staff unusually helpful, happy and accommodating. The parking is in a multi storey next door not owned by Premier Inn, I paid for one car for four days and another for four days but just overnight, total cost just shy of £80 which took the shine off the excellent room rate, the machine in the Premier Inn lobby takes cash but no cards or notes, you can call to pay by card, this took me about an hour on the 'phone in total, I spoke to about 10 different people, I was told they didn't take cards, to pay the hotel staff, shunted off to the automated system which won't allow you to pay, etc, etc, very frustrating and would put me off staying here again.","hotelReviews":0,"location":3,"Location":"Southampton","Helpful":0,"date":"13 November 2012","sleepQ":5,"Cities":0,"title":"“Great hotel but BEWARE THE PARKING”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"Sheena34","text":"I stayed here for three nights, on business, and have to say how impressed I was. Large bedrooms with ample computer/work station space. Everything was super clean and very comfortable. The building is beautiful and allows for broad corridors instead of the claustrophobic narrow, noisy ones of other Premier Inns. Although you can only park in front of the hotel for 30 minutes (drop off and collection), the multi-storey car park is less than a minute's walk away. Staff members were excellent and very helpful. I would highly recommend this Premier Inn and would stay here again.","hotelReviews":0,"location":5,"Location":"UK","Helpful":0,"date":"6 November 2012","sleepQ":5,"Cities":0,"title":"“THE BEST YET!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Worxelminxy","text":"Stayed here for one night in September. Not your conventional check in process and if you're not used to it then it's a bit confusing. The building is stunning and rooms are a good size and very clean and different from your usual Premier Inn. I would stay again if in the area","hotelReviews":0,"location":4,"Location":"London England","Helpful":0,"date":"5 November 2012","sleepQ":4,"Cities":0,"title":"“Unusual check in”","Reviews":0,"value":4,"service":3,"cleanliness":4,"rating":4,"rooms":5}
{"User":"Lesley D","text":"This was our first visit to a Premier Inn and was a very enjoyable one. The staff were friendly & helpful and all gave excellent customer service. The restaurant offers a varied menu at a reasonable price. We went for the meal deal - 3 course dinner + glass of wine, beer or soft drink & a Premier brekfast for £22.99! Our grandaughter had a free breakfast as she is under 16. The choice at breakfast was very good and cooked to order. We were most impressed by our visit. Would use Premier Inn again as 1st choice.","hotelReviews":0,"location":5,"Location":"Weston-super-Mare, United Kingdom","Helpful":0,"date":"31 October 2012","sleepQ":5,"Cities":0,"title":"“Super place to stay”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"PKA03","text":"What a great idea to take this lovely old building and adapt part of it for the purposes of a Premier Inn. As far as the Premier Inn was concerned we were, as is usually the case, treated to a lovely stay. Friendly, helpful reception staff, excellent, efficient bar and restaurant staff, lovely room, spotlessly clean, fantastic meal in the evening and a wonderful breakfast the next morning. The whole of the Premier Inn was up to the usual high standard and our stay was wonderful. Parking was easy to access in the multi storey next door, and Coventry was within easy reach by foot. The building is fantastic and the staircase provides you with a architectural treat as all the original features are retained and the new hotel fits inside the old technical college beautifully. We were told the old theatre is to be reopened and this will make this a first class venue. The development is excellent and I would highly recommend a stay here, for the superb quality of this Premier Inn with the bonus of staying in such a beautiful building.","hotelReviews":0,"location":5,"Location":"Mansfield","Helpful":0,"date":"28 October 2012","sleepQ":5,"Cities":0,"title":"“Architectural Treat...”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Patricia H","text":"This Premier Inn was stunning. We stayed there with friends for two nights as we were visiting the NEC. We had adjoining rooms which was great. The rooms and bathrooms were spotless and the staff were very helpful and friendly. Would not hesitate to stay there again if the need arises.","hotelReviews":0,"location":5,"Location":"Bradford, United Kingdom","Helpful":0,"date":"22 October 2012","sleepQ":4,"Cities":0,"title":"“Fab”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"EssexJdV","text":"We stayed in this hotel for one night in July for my son's graduation. The hotel was newly opened and everything was fresh and new. The staff on the front desk (Kayleigh) was a bundle of fun. So helpful and friendly. The rooms were massive, clean and well appointed. The beds are really comfy. We had breakfast the next day and it was fresh and well cooked. Again the staff were brilliant. We enjoyed it so much we decided to book a return trip for a couple of days later in the year. We waited until premier Inns did a £19 promotion and booked in for 2 nights. When we turned up Kayleigh was on the desk again and immediately remembered us. The check in was simple and done by a self check in computer which produces your key cards. The staff help you with this process but it is foolproof and simple. The rooms were just as good and the breakfast if anything was better. The hotel is walking distance from the city centre and several great restaurants (Try Cosmos for a Pan Asian experience and great value) we took a trip to Stratford Upon Avon the next day as this was only 20 minutes away. The only down side with this hotel is that there is no free parking and you have to pay for the multi story next door. However there is limited on-street parking nearby as long as you park after 4pm and move by 10am as the restrictions are 2 hrs between 6pm and 8am. Overall I would HIGHLY recommend this hotel despite the fact that it looks like council offices or a college (which it used to be)","hotelReviews":0,"location":5,"Location":"Essex","Helpful":0,"date":"21 October 2012","sleepQ":5,"Cities":0,"title":"“Best Value around”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"tobysmum","text":"I studied at Coventry Technical college in the mid-eighties and on a recent trip to Coventry decided to stay there in it's new guise as a Premier inn. Our family room was very large and immaculate, we only paid £30 for it and decided to have breakfast which was really good. The staff were exceptionally friendly. We parked on the Albany Road with no problems.","hotelReviews":6,"location":5,"Location":"Coventry, West Midlands","Helpful":17,"date":"21 October 2012","sleepQ":5,"Cities":7,"title":"“Cov tech looking good.”","Reviews":9,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"jackie b","text":"this is a lovely old college, refitted to a modern and stylish finish. very clean, excellent value for money. Food was superb and the meal deal which included breakfast was excellent. staff very very well trained and provided great customer service.","hotelReviews":0,"location":5,"Location":"newcastle","Helpful":0,"date":"18 October 2012","sleepQ":5,"Cities":0,"title":"“brilliant”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Monica J","text":"I rate this Premier Inn A****** the location was good, the staff excellent, rooms excellent, as was the facilities offered. Would highly recommend. The meals were excellent value for money, served fresh, diet restriction catered for. The Hotel is located close to city centre and for visiting the surrounding regions.","hotelReviews":0,"location":5,"Location":"Flint, United Kingdom","Helpful":0,"date":"15 October 2012","sleepQ":5,"Cities":0,"title":"“My stay at Earlsdon Park Premier Inn, Coventry”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Steve P","text":"I've been working in Coventry since May and have stayed at this hotel for the vast majority of this time. Having been to several nearby hotels and other Premier Inn's, I have to say that this must be the best Premier Inn in the country. The rooms are all superb, massive and with good facilities. I'd actually heard someone complain that their room was too big???? It's a very nice building as well, having been a college until being converted, so much nicer than staying in some purpose built hotel which lacks any character. (Theres always the Ramada opposite for that) It's also in quite a good location, being only about 5 minutes walk from the Skydome and city centre. I've even brought my family down to stay midweek on a couple of occasions during the school holidays, and nothing was a problem for the hotel. The restaurant and bar are excellent, very reasonably priced and I've always had great meals. Breakfast is also superb with a massive amount of choice. Overall though, the reason I've chosen this hotel as my base during the week is all down to the staff. From the reception staff, to the bar/restaurant and kitchen staff, to the hotels management, they've made me feel unbelievably welcome. I'd like to name some of them to see they get recognised, but as every single one of them is great I fear I'd miss someone out! I've witnessed just how helpful they are time and time again, and this is the reason that they get so much repeat business. Well done to everyone at the hotel, you're a credit to Premier Inn's!","hotelReviews":0,"location":5,"Location":"Sunderland, United Kingdom","Helpful":0,"date":"6 October 2012","sleepQ":5,"Cities":0,"title":"“Absolutely superb!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"linda j","text":"apart from parking this was a fab stay, sadly can't remember the girls name on desk but so good at her job. resturant staff in evening good, but breakfast staff excellent Norma and Sian did fab dispite the fact I noticed some customers were expecting too much they were always so polite, those two are a winning team and deserve more pay thanks to all the staff for a great stay especially as I was far from relaxed as my daughter was booking into uni the next day and I was dreading that day! out of the two hotels I have stayed in at cov this is the best","hotelReviews":0,"location":4,"Location":"Newport, United Kingdom","Helpful":0,"date":"4 October 2012","sleepQ":5,"Cities":0,"title":"“second stay in coventry and I will stay here again”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Naki K","text":"be aware, apparently they have a lot of these problems at this hotel, but if you drive, and park outside to check in, they automatically fine you £60, if you take more than 15 minutes., which invariably it will, if you want to take you luggage to your room. its a large hotel and my room was right at the far end, and i had to do three journeys to manage my luggage. i was given a non working key card, so had to go back to reception again, which delayed my check in further, and now i have to appeal against the fine. its a shame, as otherwise this is a good hotel, with very friendly and helpful staff. they really need to get a grip on this situation as i would not stay at a Premier Inn again, and get charged £60 for the privilege of checking in? i would have given 5 star a review, but i cannot let it slide that they fleeced me at check in. outrageous to treat guests like this. if you arriving by foot or taxi, then yes no problem, but the poor old motorist gets stiffed yet again. Room Tip: don't go here if you are driving! See more room tips","hotelReviews":0,"location":5,"Location":"London, United Kingdom","Helpful":0,"date":"3 October 2012","sleepQ":5,"Cities":0,"title":"“they will fine you for parking more than 15minutes at check in!!”","Reviews":0,"value":5,"service":2,"cleanliness":5,"rating":3,"rooms":5}
{"User":"martintwigg","text":"Simply the nicest, best value for money hotel of its class I have ever stayed in. It may not have the extra facilities of a four star, but the service and cleanliness was better than most 4 star business hotels I have stayed in. The breakfast staff were amazing.","hotelReviews":0,"location":4,"Location":"Edinburgh","Helpful":0,"date":"2 October 2012","sleepQ":5,"Cities":0,"title":"“Best Value for Money Ever”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"lappins","text":"I sometimes stay during the week and am always impressed with the attitude of the staff. They are obviously well trained, and are most welcoming and friendly. The rooms are large, clean, modern and comfortable. The food in the restaurant is good too. Not sure if there is a full-time chef present, but the food is well cooked and presented. They say that you get what you pay for, but I have paid much more for food of a much lower standard.","hotelReviews":0,"location":4,"Location":"Glasgow, United Kingdom","Helpful":0,"date":"1 October 2012","sleepQ":4,"Cities":0,"title":"“Clean modern hotel with great customer service ethos”","Reviews":0,"value":4,"service":4,"cleanliness":5,"rating":4,"rooms":4}
{"User":"Heather2119","text":"As always, a beautiful, spotless, large and comfortable room - you can never go wrong with a Premier Inn. Be warned, you do have to pay for parking here though. Staff ( I think his name was James) at the reception was lovely. Bed comfortable, breakfast yummy. Room had a fantastic view of the sunrise over Coventry. Would love to stay again. Room Tip: Got a disabled room - lovely big bed! See more room tips","hotelReviews":0,"location":5,"Location":"London, United Kingdom","Helpful":0,"date":"26 September 2012","sleepQ":5,"Cities":0,"title":"“Premier Inn - Fantastic as always”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Kopite52","text":"This was a much anticipated stay for me as I spent 4 years in Coventry Technical College in the 1970's as an engineering apprentice and I was keen to see inside the building again 40 years later. Premier Inn have done a great job in the conversion of their half of this lovely iconic building. [There aren't many lovely period buildings like this in Coventry so I was happy to see how well it has been used]. Check in was quick and easy with help from the friendly front desk staff to use the auto check in counter. I loved the old staircase in the building it's hardly changed from how it looked 40 years ago after a sympathetic renovation - lovely. The staff is this hotel are great - they are well trained, personable and a real asset to PI. I especially want to commend 'Norma' a waitress in the breakfast room and Kyleigh (?) on reception very very helpful ladies. Also James the bar manager was great and Paul on breakfast service. The rooms are standard PI if a bit larger than normal - very comfortable bed and pillows. Being a new PI (only 9 months old) the bathroom is very new and everything works really well, with a great shower. Rooms are cleaned very well each day. The breakfast is great all you could want and is well cooked and delicious. The bar/restaurant has been decorated quite stylishly and is a \"stand out\" in Coventry which is not blessed by much style anywhere and this is better than its normally dismal pubs and restaurants. I've already mentioned Norma in the bfst room who has great customer service attitude - couldn't be more helpful (employee of the month ?) Now the 2 negatives. 1. Parking - I didn't even attempt to go in the hotel car park - so many awful things have been written about it - I didn't want the stress nor the cost. Side street parking is quite difficult - I was there 5 nights and always got a spot (just) either in Albany Road (limited to maybe 20 cars or less) or in Butts/Queens Rd outside all the local restaurants. Parking here is restricted in the day till 6pm to 2 hours. Very difficult if you can't get in these 2 roads - the Rugby Club next door looks 'safe' but they have clamping threats posted all over the fence. Better not risk that. Across in Windsor St is possible but hard to get a spot and it isn't great walking back from there in the evening. All the side roads off Albany Rd are 'residents parking' only. So parking IS a big problem - you may be lucky but it's 50-50 most nights if you'll get a spot 2. Smoking - any kerb appeal the old college has is ruined by literally hundreds of cigarette butts discarded on/in/around the main entrance - not a very nice welcome. Nobody ever seems to clean or sweep these up - why isn't someone in management looking at this and ensuring it's done, this is a terrible first impression. Looks like the back door exit of a nightclub on Sunday morning - there seems no pride in anyone wanting to clean it up. Why would you want this to be the 'Welcome' mat for your customers? Shame on you. If I was the manager I'd have someone out there every 15 mins sweeping up. Would I stay again? Well it's a bargain for £29 a night if you can get one of those offers, so Yes I would stay again at that price. It's not worth the advertised door rate of £57. I would need to have the £29 a night rate but it's not worth more than that, so I'd go elsewhere if the price was higher. Breakfast was great and would make me return. Staff were all great !! Car Park issue and cigarette butts (I know it's called \"The Butts\" but that's no excuse) would mean a 'No' for me but 2 problems that a caring management can easily sort out. Over to you PI to comment please! Room Tip: Rooms facing The Butts are large and with lots of light from the big 1930's metal framed windows... See more room tips","hotelReviews":0,"location":3,"Location":"Sentosa Island, Singapore","Helpful":0,"date":"23 September 2012","sleepQ":5,"Cities":0,"title":"“Lovely building, great staff &amp; rooms, car parking a problem”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"365drills","text":"Straight to the point this venue is going to get a slap over the wrist for TWO issues. 1) Parking. Its £8+ Per night in the car park next door and this is NOT mentioned on the website (see photo uploaded) All other Premier Inns TELL you if its chargable parking. Not good! 2) Wifi IS NOT FREE as per advert out of front. Its chargable after half hour. You are allowed a taster or \"Trial\" period but its not free. So big rap over the knuckles for this. For a £58 room that adds an extra £8 for parking and £3 for wifi. When looking for a best local rate the real cost is £69 Overall no complaints about this new hotel in general. All clean and tidy. I booked this venue to be close to RICOH arena for an exhibition. But really I should have stayed out of town and near the motorways. If you want a place to crash the night there are better and cheaper without getting stuck in the Coventry ring road in rush hour. Overall I was annoyed that the \"Extras\" cost me. And when I was looking for a place to stay these things add up. Added by stealth.... ALSO one big tip. There are STREETS you can go park in if you want to avoid the £8 charge right opposite the carpark. The car park is not really \"safer\" because its open access and no barriers. My tip. Go park in the street and save some money. THEY DONT TELL YOU THIS ON ARRIVAL !!!!!","hotelReviews":0,"location":3,"Location":"LONDON","Helpful":0,"date":"22 September 2012","sleepQ":4,"Cities":0,"title":"“Naughty! Severe wrap over the knuckles for this venue. Misleading”","Reviews":0,"value":1,"service":3,"cleanliness":5,"rating":2,"rooms":4}
{"User":"Marco G","text":"This is definately the best Premier Inn i have had the pleasure to stay in so far. The staff were very friendly, helpful and knowledgeable. The room was spacious and immaculate. Great nights sleep on a well presented comfy bed, bliss! The dining area is very modern and the staff are super friendly, which is always nice. My only gripe is you had to park in a paying car park which is situated right next to the hotel, the cost is £8.10 for 24 hrs as long as you use the paying machine by the reception, otherwise it will cost you £9, so a 10% discount is offered to staying customers.","hotelReviews":0,"location":4,"Location":"High Wycombe, United Kingdom","Helpful":0,"date":"19 September 2012","sleepQ":5,"Cities":0,"title":"“Best Premier Inn i have stayed in”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Marty788","text":"Premier in have done it again, another fantastic conversion of an old building. I went here when this was a college many years ago and it's so good to see part of it being put to very good use. Not much more I can say about the hotel, rooms were large and well equipped, everywhere was spotlessly clean (Which could be a challenge as building work is still going on to restore the old theatre at the back of the building) The restaurant was probably one of the best Premier Inn restaurants we have visited, service was first class (Thanks to a waitress called Sam, she was so helpful) and the food was well cooked. This being a new Premier Inn has the new Self-Service computer check-in but the staff were there to help and explain in detail how it works. The only thing that lets this one down is the car-parking which is next door in the multi story and very expensive, but you do get a discount token from reception. Make sure you have the right change for the machine as it did not give change when we were there, just gave me a voucher to collect £2:30 from the car park office which was closed!! To add to the annoyance of being over charged when we reached the barrier it was open so we didn't need to pay anyway, £10 wasted!!","hotelReviews":0,"location":4,"Location":"South East","Helpful":0,"date":"18 September 2012","sleepQ":5,"Cities":0,"title":"“Very Good - we loved it”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":4,"rooms":5}
{"User":"bernie4787","text":"great hotel in coventry pity that people from corby have to stay there, they might think coventry is bad , i went to corby once and the only good thing was the road out of there,perhaps david a should check out corby sometime as it has little to offer in the way of anything","hotelReviews":0,"location":0,"Location":"coventry uk","Helpful":0,"date":"18 September 2012","sleepQ":0,"Cities":0,"title":"“great hotel”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"fionafreesia","text":"I have now stayed in this hotel on eight or ten separate occasions and each time it's been faultless. The staff are incredibly friendly and helpful, especially James, Norma and Sam. They remember your name and can't do enough for you, including going out and buying my friend some tights when she laddered hers, and giving them to her on the house. The building is a lovely art deco building with a fantastic glass ceiling. I've stayed in lots of different rooms and they have all been large, with a desk and either a sofa or a comfy chair with a large, really comfortable bed. They have a choice of pillows and the cleaning standards are high. All the staff say hello and seem genuinely friendly without being sycophantic.There is a happy atmosphere and they all seem to really enjoy their work. They have handy powerpoints by the bed for your phone or your lap-top, and all the basics are there, to a very high standard. No safes in the rooms and no biscuits or bottled water, no little bottles or soaps in the bathrooms, but I never use those things anyway. They do have soap dispensers in the bathrooms and I think you can buy a toiletry pack if you've forgotten what you need. One small niggle is they say they have free internet access but it's actually only free for half an hour. After that it's £3.00 for 24 hours or £10 for a week, which is much better than many places I've stayed, although I think it should be free in all hotels nowadays. Anyway if you're looking for a great place to stay in Coventry, this is it. Room Tip: I think they're all good. Maybe I've just been lucky! See more room tips","hotelReviews":0,"location":5,"Location":"Oxford, United Kingdom","Helpful":0,"date":"16 September 2012","sleepQ":5,"Cities":0,"title":"“The best business hotel I've stayed in”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"David A","text":"This is a lovely building and hotel it is a shame it is in Coventry which I found to be very boring and has no character. We stayed 26th August 2012 and after finding the multi storey parking prices at £9.00 per night very expensive considering you had a 10-15 minute walk to the City Centre. Lucky for use the machines were out of order and after checking with the hotel we parked there for free, but we did find alternative parking in a nearby street foc. The hotel it self is in a beautiful big building and I agree use the stairs to appreciate the grandness of this building. The room was big but unfortunately no view from the window. We did have breakfast in the morning which was of a very high standard especially the sausages I would even go to say this was one of the best breakfasts I have ever had in a hotel better that the Hilton's in Manchester. The staff in breakfast area were excellent they were very attentive and had excellent customer service skills. I was that impressed with the whole experience I had to pass my comments onto the Duty Managers before I left. I don't think I would be back to this hotel only if it was for business as I did't like Coventry for shopping. Room Tip: Use the stairs to see how wonderful this building is See more room tips","hotelReviews":0,"location":5,"Location":"corby","Helpful":0,"date":"16 September 2012","sleepQ":5,"Cities":0,"title":"“Pity it is in Coventry”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Jefferson C","text":"after a long day behind the wheel, and having stayed at the worst of Travelodge's the night before, what a wonderful experience this hotel was. The building was stunning, the staff very welcoming - the check-inn was efficient. Upon entering the room, I knew that I'd picked a great place to stay. The room was spotless. Bed super comfortable and bathroom spotless. We dined in the restaurant and took advantage of the dinner and breakfast special price - both meals were perfect. Definitely would stay here again - and be happy to stay here even if I wasn't paying.","hotelReviews":0,"location":4,"Location":"Divonne-les-Bains, Rhone-Alpes, France","Helpful":0,"date":"15 September 2012","sleepQ":5,"Cities":0,"title":"“Premier Inn - Premiere Experience”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Alpesh P","text":"Stayed here on 1st September for one night with my wife and 3 year old daughter in a family room. Room was clean, tidy and stay was comfortable. Breakfast was very good and the staff were very friendly and helpful.","hotelReviews":0,"location":0,"Location":"","Helpful":0,"date":"2 September 2012","sleepQ":0,"Cities":0,"title":"“Good value, very clean and comfortable”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"mulder1969","text":"this hotel was very comfortable and the staff were very friendly. one of the staff whose name was ruth was really really helpful. i only met her in the morning on the way to breakfast but she made my stay in the country very comfortable. she went out of her way to help me out and kept asking whether or not i needed anything else. my two teenage daughters loved the hotel and the free wi fi although we would have loved to have a little extra free time, but considering other hotels charge £10 for 24 hours this hotels £3 fee was nothing. the breakfast was hot and there was a wide variety to choose from. marie took us to a table and made sure we had everything we wanted. we felt sad on leaving but we had booked another hotel and so had to go. definitely would recommend this hotel to others if you travel to coventry stay here. it's beautiful inside and out. best of all? the parking was free.","hotelReviews":0,"location":5,"Location":"London, United Kingdom","Helpful":0,"date":"31 August 2012","sleepQ":5,"Cities":0,"title":"“helpful staff, beautiful building big rooms”","Reviews":0,"value":3,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Michaela B","text":"Must say I was extremely impressed with this Premier Inn. Easy to get to from the ring road and the multistorey is just next door. The room was very large and extremely comfortably for 2 adults and 2 children and the air con really made a difference on some very warm days. Could not hear any noise in the corridors, other rooms or outside. The staff were very friendly and the restaurant very good for breakfast as well as dinner. 15 min walk into the city centre and can definately recommend the Transport Museum! The large staircase within the hotel is a lovely feature. Would definately stay again - wish all were of the same standard","hotelReviews":0,"location":5,"Location":"Skegness, United Kingdom","Helpful":0,"date":"29 August 2012","sleepQ":5,"Cities":0,"title":"“The Best we have stayed in so far !”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"slappymarine","text":"I stayed on the top floor, room was spacious, clean, location was very good, parking is a bit of a problem if you're driving but there are plenty of pay and display car parks around. Breakfast was very good, good choices and good quality coffee.","hotelReviews":0,"location":5,"Location":"Truro, United Kingdom","Helpful":0,"date":"26 August 2012","sleepQ":5,"Cities":0,"title":"“Excellent location and service”","Reviews":0,"value":5,"service":5,"cleanliness":4,"rating":5,"rooms":5}
{"User":"FreyaEd","text":"This is the first time I have stayed in a Premier Inn and it won't be the last. This particular branch was located in a beautifully converted building that used to be part of a college. The staff were attentive and polite and every inch of the hotel was spick and span. The breakfast was a very reasonable £8 for an all-you-can-eat buffet (the sausages were delectable) and included everything you would expect from bacon and eggs to yoghurt and mueslei. Although my favourite part was the top of the range coffee machine. :-) The hotel is located a stones throw from the city centre but the only problem was the lack of car parking spaces. There were three disabled spaces out front but that was it. I was told that there was a Pay and Display carpark out back but luckily, we were visiting friends so we could park our car in their driveway. Having said that, we enjoyed our stay thoroughly. The bed was ridiculously comfortable and we were given two lots of pillows to choose from. Firm or soft. Also, each room is equipped with an AC unit, which was a nice touch. Premier Inn offers a money back guarantee if you have a sleepless night so you can be sure that the rooms are soundproofed well and are extremely comfortable. Even the shower was perfect as our room had a power shower in the en suite as well as complimentary body wash and soap. The only thing missing was toothpaste but my husband and I always bring our own on vacation anyway. Thank you Premier Inn. You can be sure we'll book in again the next time we visit!","hotelReviews":0,"location":5,"Location":"Worcester, United Kingdom","Helpful":0,"date":"24 August 2012","sleepQ":5,"Cities":0,"title":"“Great location, great food, great staff!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"puffpod","text":"Premier Inn is Premier Inn. You know what you’re going to get and if you just want a good value bed for the night in a clean and comfortable room it’s a no-brainer. In some cities you get fleeced for the privilege and some are quite cheap. Coventry Earlsdon is the latter. It also has something extra – what a terrific building ! A tip: do NOT use the lifts as you might miss the incredible Art Deco stairways. Another surprise: the room was unusually large for this price point (a chez longue in a Premier Inn ?) - must be something to do with the really cool building again. Another piece of advice: its’ 9 quid to park in the attached car park overnight and the machines are cash only. The nearest cash point in the fuel station opposite charges £1.99 for withdrawals, so if you’re as pedantic as we are you’re walking back into Coventry to get some cash. Come on Premier Inn, in this day and age ? I know the car park is officially nothing to do with you, but back in the real world: sort it out !","hotelReviews":0,"location":4,"Location":"Leicester, UK","Helpful":0,"date":"16 August 2012","sleepQ":5,"Cities":0,"title":"“Great Building”","Reviews":0,"value":4,"service":4,"cleanliness":5,"rating":4,"rooms":5}
{"User":"stevie70","text":"We stayed here overnight and, as usual, we got a good welcome in reception. This Premier Inn has self check inn machines which seemed simple to use and the receptionist was very helpful. The room was, as you would expect, typical of a Premier Inn in furnishing, layout and cleanliness. Our room was at the front but the double glazing muffles traffic noise to a minimum and we didn't hear other guests next door or in the corridor outside. The restaurant was very good with very pleasant service and breakfast was good however the waitress was on her own to start with so could have been a bit quicker. We took the meal deal which gives 3 courses plus a drink and breakfast the next morning for £22 which gives a slight saving. Parking is in a multi storey next door for which there is a charge but you do get a discount coupon if you ask at reception. Overall, I don't think you can go wrong here. We're not overly fussy but expect good service which is what we got.","hotelReviews":0,"location":4,"Location":"Essex","Helpful":0,"date":"5 August 2012","sleepQ":4,"Cities":0,"title":"“Typical Premier Inn, can't go wrong”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Leviboarder","text":"Couldnt fault this hotel after a recent stay. It certainly gives alternative budget hotels a run for their money. Parking isnt a problem. There is plenty of on street (free) parking nearby (across the road by the pub). The staff were very efficient and friendly anf the hotel, despite being quite large, was very quiet and comfortable.","hotelReviews":0,"location":5,"Location":"Exeter, United Kingdom","Helpful":0,"date":"5 August 2012","sleepQ":5,"Cities":0,"title":"“A very nice hotel”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"366GKA","text":"My 2 sons and I stayed there for the F1 this July (2012). We were very impressed with the facilities from the time of our arrival. Although we drove 40 miles to Silverstone everyday, we had a great weekend. We were very happy with all the hotel staff especially our friendly waitress whose name escapes me now. Having spent 15 years in cramped, overpriced cottages during the British Grand prix weekends, I have now come to a decision to stay at this hotel henceforth. I can't wait for the 2013 calender to be published so I can book my room!","hotelReviews":0,"location":5,"Location":"Meopham, United Kingdom","Helpful":0,"date":"31 July 2012","sleepQ":5,"Cities":0,"title":"“Excellent Hotel that puts &quot;posh&quot; hotels to shame”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Swoshy","text":"I travel a lot on business but staying here i was having a night away with my family for the Olympic football. I was a hotel manager myself until i gave it up about 5 years ago to spend time with the family, so i find myself subconsciously judging hotels when i stay there and i really have not got a bad word to say about this hotel, which is why i am writing this review so soon(i only stayed last night!). The food, rooms and staff are amazing! The restaurant is not huge but big enough for the hotel and very modern and stylish but not over the top. The food was amazing. Fresh and tasteful. Matt(i believe?) served us food in the restaurant before we went to the game. He was friendly and helpful throughout. He seemed like such a genuinely nice guy. Also Kayliegh on check in was just the most lovely girl, we ended up standing and talking to her about 20 minutes before we went up to the room. She answered all our questions about the Olympic stadium, the hotel and the fact it used to be a college. Nothing we asked for was too much, maps, taxi quotes, timetables for trains. She also had a little joke with my daughter, who is obsessed with the TV show Friends about the characters. Cannot fault her at all. The staff when we got back to the hotel were lovely as well, although we pretty much went straight to bed, but i should point out this hotel has a 24hr bar(yes they do!). The rooms were spotlessly clean. The beds were extremely comfortable and considering we were a family of four there was still plenty of space in there. There are small flat screen TV's, with enough channels to keep the kids entertained. Bathroom was slightly small but considering there only needs to be one person in there at a time that wasn't a problem. The towels and linens were also clean, i would say brand new. soft and comfortable. The location is great as it right next to the city center but not in the middle, so without the noise. 5 minute walk or 10 minute leisurely stroll. The only gripe i would have would be the car park but remember, it IS a city center hotel and the prices are not as bad as if you stayed somewhere else, for example London! If you stay here, make sure you take a walk down the main staircase into the foyer where the college reception used to stand, definitely worth a look. It was also mentioned that the theater in the college is to be re-opening soon, something to look out for!","hotelReviews":0,"location":4,"Location":"Birmingham","Helpful":0,"date":"26 July 2012","sleepQ":5,"Cities":0,"title":"“What a stay!”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Huw C","text":"Spotless, great staff, reception, bar & at breakfast. Really friendly place to stay and centrally located Normal premier inn etc, but really new and clean and best of all I only paid £29. Would definately stay there again when next in Coventry","hotelReviews":20,"location":0,"Location":"Coventry, West Midlands","Helpful":37,"date":"24 July 2012","sleepQ":0,"Cities":26,"title":"“Best Premier Inn by far”","Reviews":65,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"Hollie H","text":"Only living down the road we decided to have a meal here a few months ago and the food and service was excellent. My partner has been ill recently so we decided to have a change of scenery and stay the night. We have the meal deal ( 3 course meal and breakfast) all I have to say is WOW! the rooms are lovely, the food is amazing and the staff are brilliant. We could not fault a thing! The hotel was busy with Olympic events happening around the city but the staff dealt with it brilliantly and you are always made to feel like a 5 star guests. Out of all the restaurants in the area we have decided to return later in the week to treat the whole extended family to a meal! Show of the little gem sitting around the corner from us! Can't wait to stay again!","hotelReviews":0,"location":0,"Location":"","Helpful":0,"date":"21 July 2012","sleepQ":0,"Cities":0,"title":"“Yet again perfect!”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"bluebell02","text":"stayed here on sat 14thjuly cannot fault his this hotel the staff were fab and really looked after the 6 of us breakfast was five star and so were the staff who could not do anough for us we all had a very enjoyable time, the hotel was very busy with dart players but we were looked after very well, well done staff.","hotelReviews":0,"location":5,"Location":"east yorkshire","Helpful":0,"date":"16 July 2012","sleepQ":5,"Cities":0,"title":"“fantastic”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"GlaseS5","text":"What a little gem. We booked this hotel with some worry, having stayed at Travelodge hotels before and tar'd them with the same brush, how wrong we were. Travelodge should take some hints from Premier Inn. First of all, the service! Upon entering the hotel I was greeted by the happiest smile from the young woman behind the desk, I would love to mention her name but she had a training badge on, the young lady was an absolute star on the evening of my stay, considering she was training you couldn't tell, printing me out a map, telling me where the best places to eat were and when we got back making sure we enjoyed it. When she said she hoped we enjoyed our stay, it seemed she genuinely meant it. The other receptionist was lovely as well, very smiley. The room was lovely, quite spacious and the beds extremely comfortable. TV, fluffy towels and good bathroom. The housekeepers obviously work hard to keep high standards. The only problem with the room was that it was slightly cold but after asking the lady on reception it was sorted within 10 minutes. I didn't park in the car park but my friend who lives in Coventry suggests the Skydome car park as an alternative. The restaurant, food and staff in there were all amazing, my friend had the steak and said it was the best they had tasted. The staff at the bar and in the restaurant couldn't do enough for you. Took their time to explain and help you. On departure i was greeted by another receptionist and another smile. Check out was simple and smooth. I can really not say enough for the staff at this hotel, they really are an assett to it and i hope the management team realises it. They really are great and as for that lovely young woman, if that was her training i look forward to seeing her next time we return, which we will most definitely be. A good nights sleep and a big smile won us over.","hotelReviews":0,"location":5,"Location":"","Helpful":0,"date":"12 July 2012","sleepQ":0,"Cities":0,"title":"“What an amazing find!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Hollie H","text":"Beautiful room and lovely service! Staff are friendly and welcoming and nothing is too much trouble. It was a pleasure to stay here. We opted for the £22 3 course meal which we thought would be big standard hotel food (cheap), OMG were we wrong.. My partner had a 10oz rump steak which he said was the best steak he had ever had! The food and service was amazing and we have even been back just for lunch. Breakfast was well worth the money, plenty of choice. Would highly recommend this hotel and we will defiantly be back in the future! Cannot honestly think of a bad point!","hotelReviews":0,"location":0,"Location":"","Helpful":0,"date":"8 July 2012","sleepQ":0,"Cities":0,"title":"“A gem!”","Reviews":0,"value":0,"service":0,"cleanliness":0,"rating":5,"rooms":0}
{"User":"Mrandyd","text":"Visited just after the hotel opened and visited again at the end of June. The earlier gremlins I describe in my earlier post had been resolved. This trip was issue free. Good to see that the staff who were here previously, are still here, as they are a fantastic asset to Premier Inn....and I hope Premier Inn know this... Small issue about a water leak in our room, but this was dealt with well, and this was not an issue. Overall another good stay.","hotelReviews":0,"location":4,"Location":"Hinckley","Helpful":0,"date":"3 July 2012","sleepQ":5,"Cities":0,"title":"“Well justified return”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"dickitummi","text":"Had just one night (family of 4) in a very comfortable room with a FANTASTIC breakfast for all in the morning. We were attending at an Ordination ceremony at Coventry Cathedral and it was an adequate location for a 15 mins walk into the city centre. DO NOT be put off by the car parking comments in previous reviews as there is plenty over Butts Rd and the side road adjoining this place...you have 15 mins out front if required to unload. Oh and yes the staff were very welcoming and friendly.","hotelReviews":0,"location":4,"Location":"Preston, United Kingdom","Helpful":0,"date":"1 July 2012","sleepQ":5,"Cities":0,"title":"“A premier Premier Inn!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"SusannaZabulis","text":"We stayed here just a few weeks after it had opened, so it was all very new and fresh. We chose it purely because it was close to our daughter's student accomodation and seemed good value, but the high quality of the accomodation, service and food made the weekend even better than we had hoped, and the beautiful old building was a completely unexpected bonus. Don't leave without walking up or down the big central staircase, and having a good look at the art deco architecture and fitments.","hotelReviews":0,"location":5,"Location":"Nottingham, United Kingdom","Helpful":0,"date":"30 June 2012","sleepQ":5,"Cities":0,"title":"“Everything we could have hoped for and more”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Tim P","text":"High end of budget price but friendly and unobtrusive staff. Big room for this price and everything clean, new and working. Opened in January 2012 apparently. Still feels new.","hotelReviews":0,"location":5,"Location":"Leicester, United Kingdom","Helpful":0,"date":"25 June 2012","sleepQ":5,"Cities":0,"title":"“Efficient &amp; Friendly”","Reviews":0,"value":3,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Joan M","text":"The old Technical College has been beautifully preserved (for those who knew it in its original incarnation) whilst still managing to produce a quality hotel. The staff were friendly and charming, the room was clean, roomy and comfortable. The bathroom was neat and clean. Breakfast in the restaurant was excellent (particularly so as on a quiet morning, we ordered individually rather than selecting from a buffet). The one, and sadly major drawback is the lack of car parking, though there is plenty of ground space around that you would think could have been used. The next-door multi-storey carpark (not owned by Premier Inn) is vastly overpriced! The machine did not even allow the (correct) Bank Holiday rate, the day we were there. A superb hotel which I cannot recommend solely for its lack of parking! Room Tip: Even the ones facing the main road are quiet, and though close to the City Centre, there was no outs... See more room tips","hotelReviews":0,"location":3,"Location":"Coventry, United Kingdom","Helpful":0,"date":"25 June 2012","sleepQ":4,"Cities":0,"title":"“Lovely conversion - shame about the parking!”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":3,"rooms":4}
{"User":"chris w","text":"Booking a £29 hotel room might seem like the truly horrific experience of Ryanair but it really isn’t with this chain. The website was very simple and did not have endless pages of sales pitches, small print and add on charges. The room was comfortable, clean, and spacious and had a decent shower. The staff were extremely friendly and helpful and did not spend every minute trying to flog things a la Rynaair. The food and drink were reasonably priced and the exit time for the room was 12.00 rather than 11.00 or even 10.00 that I have seen elsewhere. This is not 5* luxury or a bijou boutique experience but for £29 I would say this is amazing value. The atrociously run low cost airline groups should look at this and understand the meaning of service and that low cost does not need to mean crap service.","hotelReviews":0,"location":5,"Location":"Horsham, United Kingdom","Helpful":0,"date":"25 June 2012","sleepQ":4,"Cities":0,"title":"“Great value, great staff”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":4}
{"User":"dzeomac","text":"We stayed one night and the room was clean, in good condition (opened Jan 2012) and comfortable. The staff are really friendly and the breakfast is great. The car parking however is woeful. It is not operated by Premier Inn but is over-priced, takes only cash, and on our visit at a weekend, none of the machines appeared to be giving change. We were charged £10 (instead of the £7 it should have been, which is already a joke; £4 for overnight till 7am then £3 for all sunday, worse during the week) and are still awaiting a refund. Once car parking is factored in, this is no longer a budget hotel. Unless you are on foot, stay out at one of the Premier Inns in Coventry. Shame but we won't return","hotelReviews":0,"location":5,"Location":"London, United Kingdom","Helpful":0,"date":"19 June 2012","sleepQ":4,"Cities":0,"title":"“Friendly, clean but the car parking con let's it down”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":3,"rooms":5}
{"User":"hungry_harborough","text":"A really good budget hotel, and unlike other Premier Inns it's restaurant is inside the hotel. Service, Room and breakfast were excellent. The only downside is that you need to park in an adjacent multi-storey which costs £9 overnight, so don't forget to factor that into your costs.","hotelReviews":0,"location":4,"Location":"Market Harborough, United Kingdom","Helpful":0,"date":"17 June 2012","sleepQ":0,"Cities":0,"title":"“Among the best budget hotels”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"chacha43","text":"Six of us stayed for one night. All the rooms were very clean and tidy with good air conditioning. The hotel was full.....and it was very quiet! Breakfast was good and staff very helpful and pleasant. Highly recommended.","hotelReviews":3,"location":4,"Location":"Coventry, West Midlands","Helpful":4,"date":"14 June 2012","sleepQ":0,"Cities":6,"title":"“Dutch”","Reviews":6,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"Tibby26","text":"As a HR Manager in a hotel I am always observant of the service provided in other hotels!! This one did not disappoint, the staff were all extremely friendly and pleasant, even when they were busy. Rooms were fine, you know what you are getting in premier inn and our rooms met all our needs, and were clean. Breakfast was fantastic, and was great value for money we thought! Convenient to city centre.","hotelReviews":0,"location":4,"Location":"Belfast, United Kingdom","Helpful":0,"date":"4 June 2012","sleepQ":0,"Cities":0,"title":"“Great Staff!!”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"LalicerLondon","text":"We were greeted as soon as we walked through the door and helped with navigating our way through the express check-in. Having been joined by my aunt last minute we enquired about changing our room to a twin and were changed to a family room immediately, no problem. Also had a iron & ironing board put in the room immediately after requesting it. Very helpful staff, great location for the city centre (and for the £2.75 IKEA cooked breakfast over the road!) and spotless, spacious rooms. Room Tip: We had 3 x rooms in total in various locations in the hotel and all were perfect, including one at t... See more room tips","hotelReviews":0,"location":5,"Location":"London","Helpful":0,"date":"2 June 2012","sleepQ":4,"Cities":0,"title":"“Recently renovated &amp; extremely helpful staff”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"moglodyte","text":"This hotel opened in January 2012 so everything is brand new. It's only 10 minutes walk to the City Precinct for shops and restaurants. Our room was remarkably large, the largest we have had at any Premier Inn. Everything is clean and modern but the best thing is the friendly and helpful staff. The only small weakness was that although the bathroom is new and modern, for some unfathomable reason they have put in old fashioned fixed head showers (army surplus?) which cannot be detached. Not ideal if you're a family with small children. Beware of parking at this hotel. We did not know there was a 15 minute courtesy parking area in front of the hotel so we foolishly parked in the covered car park next door. Although we only parked for 30 minutes it cost us £3 as it was Sunday. So much for the advertised £1 for an hour. After that we rebelled and parked in the street for free for the next four days. Tip: there seems to be only one lift and sometimes there was a queue, just use the stairs which are very spacious and give you an interesting glimpse of how the building looked when it was a Technical College.","hotelReviews":0,"location":3,"Location":"Switzerland","Helpful":0,"date":"21 May 2012","sleepQ":4,"Cities":0,"title":"“Visiting daughter at Uni”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Verde1959","text":"Yes very nice hotel, good rooms and very good food. The staff were very helpful. But if you use the Car park next door please note the CCTV does not operate. The reason I have this information is that someone tried to steal my motorcycle and smashed the ignition lock in the process. So I rang the local police to get a crime number and they are the ones who found out about the inoperative CCTV system.","hotelReviews":0,"location":4,"Location":"Peterborough, United Kingdom","Helpful":0,"date":"9 May 2012","sleepQ":4,"Cities":0,"title":"“Motorcyclists note.”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":4}
{"User":"helen f","text":"booked a family meal for 8 Sat 5th May had a fantastic evening the food was lovely the menu very good plenty of choice and it was no trouble to change anything The staff couldnt do enough to make sure our evening went well many thanks to our waitress and waiter excellent service will definitely be back, might even stay the night although we live in Coventry Helen Fox","hotelReviews":0,"location":5,"Location":"Coventry, United Kingdom","Helpful":0,"date":"6 May 2012","sleepQ":0,"Cities":0,"title":"“meal”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":0}
{"User":"TiggerNorfolk","text":"We usually stay in Premier Inn's competitor hotels for short stays because they're cheaper. However the saver rate in this new Premier Inn has made me change my mind. For a similar price (if not cheaper) we had a very large family room with all basic items included. We did not need a family room but would recommend them as spacious.The hotel is newly created within older technical college building but very tastefully done with modern room. It was very clean and comfortable with a choice of firm or softer pillows. The air con/ heating was compared to other hotels quiet. The check-in machine was easy to use. The hotel is conveniently situated for the city centre. We did not park there so don't know how much it costs. We did not eat in the bar/restaurant. I would not hesitate to use this hotel again.","hotelReviews":0,"location":5,"Location":"Norfolk","Helpful":0,"date":"1 May 2012","sleepQ":4,"Cities":0,"title":"“Fabulous Premier Inn”","Reviews":0,"value":5,"service":4,"cleanliness":5,"rating":4,"rooms":5}
{"User":"jo c","text":"This hotel which has only been open for 12 weeks is fantastic!! The staff we met were, Ruth on reception and Kim & Norma in the bar/restaurant. The 3 of them were totally professional and friendly and extremely helpful. The rooms were great, dinner was fantastic (the chef really knows how to cook a steak) and the breakfast was exceptional. Well done to Rebecca, Claire and her team, job well done!!! Room Tip: All rooms are well insulated so there is no outside noise interference See more room tips","hotelReviews":0,"location":5,"Location":"Keswick, United Kingdom","Helpful":0,"date":"1 May 2012","sleepQ":5,"Cities":0,"title":"“Excellent, would definitely recommend it!!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Warthog69","text":"Stayed for the EPL playoffs at the ice rink just over the road. Normal service from this company though the building has more character than others in the chain.Checked in just after 2 but my room was not ready, lady on reception phoned hose keeping and got me swopped in to a room that was ready, very impressed. Room welll furnished and very comfy and though the hotel was busy very quite. Nice touch the hotel kept the resturant open late and the bar till 4am for those comming back from the games. Will make this my first choice for next year.","hotelReviews":0,"location":5,"Location":"Milton Keynes","Helpful":0,"date":"27 April 2012","sleepQ":5,"Cities":0,"title":"“Ice Hockey and a good nights sleep”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"LamcsMr-b","text":"You know what you are getting with a Premier Inn and they are hit and miss but this is one of the better ones, mainly due to the well drilled and good service by the staff, This one has its own bar area, comfortable, with a regulation food and drinks menu at average prices, certainly nothing special but does the job. The breakfasts these days are much improved and again the service is excellent here and very acceptable food quality. As noted in other reviews you have to park in the adjoining multi storey so you need to factor that into the price, average parking price around £8-10 overnight. All in all its ok for a short stay and with all factors included reasonable value.","hotelReviews":0,"location":2,"Location":"Lancs","Helpful":0,"date":"27 April 2012","sleepQ":4,"Cities":0,"title":"“One of the better Premier Inns - ok for a short stay”","Reviews":0,"value":3,"service":5,"cleanliness":4,"rating":3,"rooms":3}
{"User":"theliverpool2","text":"Stayed here on business and was my first experience of the new style Premier Inn it was great. The hotel is in what was the old technical college a short walk under the motorway from the city centre and the railway station. Come out the station look to your left and you will see the Ramada Hotel tall building the Premier inn is about 500 yards further on. No need for a taxi during the day unless you are carrying heavy luggage. Student area so bars and restaurants are geared towards them. Room was great, large, clean and well equiped only missing a trouser press. Restaurant and bar were good. Breakfast was fabulous eat as much as you want, freshly cooked and good quality. Staff were very friendly and efficient. Would stay again and recommend.","hotelReviews":0,"location":3,"Location":"England","Helpful":0,"date":"26 April 2012","sleepQ":5,"Cities":0,"title":"“A great hotel”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":3,"rooms":5}
{"User":"611Shirley55","text":"I stayed here on Frid 20/4/12- brilliant- what more could anyone want? Clean,bright, welcoming and all for £29.00 for the night!! I also had my elderly parents with me and they were very impressed. We had our evening meal there -good choice , really good food and very reasonably priced.. Breakfast was wonderful- every member of staff we came into contact with was so pleasant and helpful- they couldn't do enough for us and nothing semed to be any trouble for them. I will certainly stay here again and if this is the Premier Inn standard why stay anywhere else?","hotelReviews":0,"location":5,"Location":"Gateshead, United Kingdom","Helpful":0,"date":"25 April 2012","sleepQ":5,"Cities":0,"title":"“ABSOLUTLY BRILLIANT”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"cindywlow","text":"It is valued , comfortable and clean . But it don't have a free car park and an outdoor garden which are very important for tourists.","hotelReviews":0,"location":4,"Location":"hong kong","Helpful":0,"date":"18 April 2012","sleepQ":4,"Cities":0,"title":"“valued and comfortable”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":3,"rooms":4}
{"User":"poppyCheshire","text":"I booked a family room for the ice hockey play offs and for £29.00 found it to be a bargain for the quality and service. The staff are polite and friendly, I received a call a couple of days prior to our stay to advise about the car parking charges at the nearby multi storey which turned out to be very reasonable at £8.00 from approx 2pm sat until after 7pm sun. Location was perfect for what we wanted only a 5 minute walk to the arena. As they knew a lot of people were staying for the hockey they kept the restuarant open until 11pm and the bar until 4am. Rooms were large, clean and modern. We used the restaurant for breakfast which was very good with lots of choice and as much to eat as you wanted. I think this hotel is perfect for whatever reason you need to stay in Coventry for and certainly good value for money","hotelReviews":18,"location":5,"Location":"Coventry, West Midlands","Helpful":43,"date":"16 April 2012","sleepQ":5,"Cities":18,"title":"“EXCELLENT FOR THE PRICE”","Reviews":21,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Abbeywoodgirl","text":"We stayed at the hotel for 3 nights over the Easter school break for £29 per room per night and really could not fault it! It looks pretty impressive from the outside and the inside is just what you expect from a Premier Inn. Our room was huge and the beds are so comfortable it is very difficult to get out of them!! We booked the breakfast on all 3 mornings which is fantastic value for money - and the kids eat free - always a bonus! We also had dinner one night in the restaurant and it was lovely - the chicken strip salad is particularly lovely. Sam who was in the bar, on reception, waiting on the tables and generally everywhere, was very helpful and recommended a few local attractions which we did visit and thoroughly enjoyed. All the staff seems to want you to enjoy your stay and nothing was too much trouble. They did not mind the children running around and were interested in how they were enjoying their time in Coventry. Overall, this is a truly lovely place to stay and serves as a great base for Warwick, Stratford on Avon and the Safari Park. Ok, so it doesn't have a car park on site but there is one right next door which is very reasonable considering you are practically in the centre of the city. We will definitely stay here again and would not hesitate to recommend it to anyone wanting a place to stay in Coventry. Room Tip: Family rooms are generally larger than other Premier Inn's See more room tips","hotelReviews":0,"location":5,"Location":"london","Helpful":0,"date":"16 April 2012","sleepQ":5,"Cities":0,"title":"“Brilliant location and friendly service!!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"welshandpoi","text":"Booked a family room for a bargain price of £29. Very conveniently situated and a short drive (or walk) into town centre. Very friendly staff who seemed to really care about their guests and the quality of service. The rooms were very comfortable, clean and spacious. We intended to get up for breakfast as the restaurant looked lovely but the beds were so comfortable we overslept and missed it! Yes, you had to pay to park, but the car park was very convenient and being so close to the city centre, what else would you expect? We will definitely return and would recommend it to anyone.","hotelReviews":0,"location":5,"Location":"wales","Helpful":0,"date":"14 April 2012","sleepQ":5,"Cities":0,"title":"“Good value, good location.”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Sharon B","text":"Brilliant Hotel, stayed two nights to visit Birmingham Gadget Show and Warwick Castle. Staff helpful and really lovely, can't fault cleanliness, breakfast, and location for us. Hotel rang us before our visit to confirm details and also mentioned parking. Parking not an issue for us as we knew we had booked a city centre hotel, only cost us £7 first night and £8 second night. A great nights sleep.","hotelReviews":0,"location":5,"Location":"Norwich","Helpful":0,"date":"14 April 2012","sleepQ":5,"Cities":0,"title":"“Excellent Family Hotel.”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"SchoolofScience","text":"We had two rooms whilst attending the coventry beer festival. The staff on check-in were very helpful indeed, helping my dad to use the self checkin machine and the other staff in the bar were equally pleasant, very refreshing. The bar and restaurant was a lovely area and i would like to try the food next time. The building has been beautifully refurbished, with the room being spacious and very comfortable and clean. A very welcome addition to coventry's hotels.","hotelReviews":0,"location":5,"Location":"Coventry","Helpful":0,"date":"14 April 2012","sleepQ":0,"Cities":0,"title":"“Brilliant”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"clrchrst","text":"Stayed here for an event at the NEC, which was an easy 10 minute drive away, with two kids (11 & 14). The hotel is new so it is clean, tidy and modern. We had a really big and bright family room which had 2 single beds for the kids. This is the first time we have had this in a family room, instead of the usual fold down double sofa bed, and it was such a boon! The staff were all pleasant and friendly and very helpful. The dinner menu was reasonably priced with good offers and the food was good. The breakfast was well stocked with hot buffet and the 'kids eat free' offer was worthwhile (4 'eat all you can' breakfasts for £16). Overall we had a very comfortable and pleasant couple of days and nights and would highly recommend the hotel if you are visiting the area (Birmingham etc).","hotelReviews":0,"location":4,"Location":"Isle of Skye","Helpful":0,"date":"14 April 2012","sleepQ":4,"Cities":0,"title":"“Great for families”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Debbie B","text":"This was my first time staying away from home, due to training for my new job and my first time in a premier inn. I stayed in this hotel for three weeks and must say I could not fault the service, food, nor staff they all were amazing. A female on her own in a strange place seemed daunting at first but the staff made me feel very welcome from the time I booked in, to the time I went home, nothing was too much trouble. Thank you all!!!! Room Tip: \"All are first class\". See more room tips","hotelReviews":0,"location":5,"Location":"Gloucester, United Kingdom","Helpful":0,"date":"1 April 2012","sleepQ":5,"Cities":0,"title":"“Excellent!!!! staff, food and service.”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"AndrewGransden","text":"I mistakenly booked this online instead of Coventry South Premier Inn. So take care is selecting the correct hotel. This is a newly opened PI just outside the city ring road near the city centre. It was previously the Technical College. The rooms are well fitted out and a good size but the bathrooms are minute. You can hardly squeeze in to get to the wash basin and you cannot sit comfortably on toilet. The staff are well trained being friendly and helpful. The big down side is the neighbouring multi-story car park a short distance from the hotel entrance. It costs £5 overnight but only between 1900 and 0700. Exceed this and it can set you back £9; I arrived at 1630 and left by 0800 and was stung for the full amount. It is a real ripoff and the only warning you get is a brief online warning that car parking 'may' incur a cost when you initially book. There are a limited number of dropoff parking slots immediately in front of the hotel but the access is not signposted and exiting in the morning is difficult because of the heavy traffic in the mornings. The other rip off is the sign outside that clearly states that there is Free WiFi. You only get 30 minutes free before you are invited to pay £3 per £24 hours. But it isn't 24 elapsed hours as the clock restarts at midnight. So if you want to access your emails in the morning you have to pay a further £3. In brief, don't be fooled by the cheaper prices designed to attract visitors to this new hotel. Add an additional £15 a night for essential services that should be FREE.","hotelReviews":0,"location":3,"Location":"Buckie, Scotland","Helpful":0,"date":"10 March 2012","sleepQ":4,"Cities":0,"title":"“New Hotel but watch the expensive parking”","Reviews":0,"value":4,"service":5,"cleanliness":5,"rating":4,"rooms":3}
{"User":"Mrandyd","text":"You know what you get with the Premier Inn brand - Clean functional hotels, and this was no different. Set in a magnificent building which my kids likened to a museum, especially with the collonades flanking the entrance. Good location 10 mins walk from the city centre. You need to cross the ring road to get to Coventry, either under a series of underpasses, or via a pedestrian crossing. We stayed in a family room with a double and two fold out kids beds - The room was big enough to accomodate our needs. TV has Freeview channels. There are tea / coffee facilites. There are functional places to hang clothes, and drawers to store smaller items. Soap / shower gel was dispensed through dispensers. Our room faced inwards to a courtyard. The bottom half of the window was frosted so we had little to view, however there was ample light into the room, especially as the windows were double height. We ate in the restaurant twice, and had breakfasts every day. The lunch / dinner menus were simple an good value. I am under no illusions that the majority of the food was prepared offsite, therefore foodies may baulk at the idea at eating at the restaurant, but my palate is not so sophisticated to deny me from enjoying the food. The restaurant / bar staff were excellent and made us all feel special. They are all a credit to Premier Inn. As the person below states - The hotel has no car park, or for that matter gym or pool, but then I knew that before booking, therefore it would be wrong to criticise the hotel for not providing that service. With Premier Inn the price you pay is variable. I paid £19 a night for the room and an extra £8 for breakfast for the kids and I. I think I got a bargain, and would pay more. However once you start paying £70+ for a room you would start questioning whether there are products out there with parking and pools which would be better value. However if the price is right this is a great hotel to enjoy and will stay again.","hotelReviews":0,"location":5,"Location":"Hinckley","Helpful":0,"date":"10 March 2012","sleepQ":5,"Cities":0,"title":"“Cheap and cheerful”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"MrsF82008","text":"This was our first stay at a Premier Inn as we normally use Travelodge. Fortunately, this happened to be the closest \"Budget\" hotel to where we were visiting and we could not have been happier with our stay. The hotel has only recently opened so everything still looks fantastic. The staff were fantastic, really helpful and friendly. We would not normally eat dinner at a hotel like this but decided to give it a go as we had arrived quite late and we were not disappointed - it was great - all freshly prepared and very tasty and well worth the money. Ditto the breakfast which was cooked to order. The whole experience on our opinion would have been cheap at twice the price and we have now decided that we will always use Premier Inn in future. We also got a great nights sleep as per their guarantee!","hotelReviews":0,"location":5,"Location":"Plymouth, United Kingdom","Helpful":0,"date":"5 March 2012","sleepQ":5,"Cities":0,"title":"“Excellent service and lovely quiet room...”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Rasher26","text":"This was my first ever stay over in Coventry, and this hotel was chosen only due to its proximity to work. It is, however, one which I will be using each time I now need to visit the same office. The room I had was spotless and roomy with a very large double bed, adequate wardrobe space for luggage & clothing and lovely bathroon with bath & shower. The staff at reception & in the dining room were very welcoming, pleasant & courteous and the breakfast was excellent - buffet style for coffees, teas, fruit juices, cereals, toast etc. and/or order as much cooked breakfast as you want. My only complaint would be that there was not enough coffee, milk and sugar in the room but I'll let them off on that one :-)","hotelReviews":0,"location":5,"Location":"Runcorn, Cheshire","Helpful":0,"date":"20 February 2012","sleepQ":4,"Cities":0,"title":"“Excellent for overnight stay”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"oceanomad","text":"I stayed in this Premier inn a few nights ago and must say that it was excellent. Of course it is very much like every other premier inn and comes with no frills, however it was fantastically clean and the staff were very helpful and friendly. Built in the old college i believe, the rooms are spacious. Too tired to venture out to eat at night we decided to eat in the restaurant. The food was good, and service just fine. Would recommend this hotel to anyone staying in Coventry or visiting nearby Warwick University. We had 30mins free internet usage too.","hotelReviews":0,"location":5,"Location":"London, United Kingdom","Helpful":0,"date":"17 February 2012","sleepQ":5,"Cities":0,"title":"“Excellent, clean, tidy and staff couldn't have done more to help”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"Jimmy'sgirl","text":"We stayed here on our way to Wales. We arrived quite late but were met by a very friendly, helpful night reception team. We did get a bit lost trying to find the hotel. Rooms were just what we needed for a one night stay. We had booked breakfast which is very good value and set us up for a long journey ahead.","hotelReviews":0,"location":4,"Location":"Bexley","Helpful":0,"date":"16 February 2012","sleepQ":4,"Cities":0,"title":"“really good for an overnight stay”","Reviews":0,"value":4,"service":4,"cleanliness":4,"rating":4,"rooms":4}
{"User":"yellowhippo","text":"The latest addition to the Premier Inn estate in the Coventry area is in one of the most iconic buildings in the City, which has been instrumental in shaping the lives of literally thousands of its citizens. The hotel has refurbished part of the old Coventry Technical College Building whose foundation stone was laid by King Edward V111 when still Prince of Wales and which was opened by George V1. The refurbishment has been done to a high specification and the room that I stayed in on only the 4th night it was open was spacious and comfy and obviously Premier Inn. The bar and restaurant were also decorated very pleasantly and I personally preferred these to the Belgrade Plaza Premier Inn. There weren't many customers due to it being opened so recently but a large number of people just popped in to see the adaptations because the hoarding had come down and these were mainly ex employees or students. Indeed the whole reason that we had gone was because my husband had been a senior manager at the college. He found it hard to remember exactly what had been where due to the work carried out. It was mainly the windows that helped him place where he was. We had the Meal Deal which is excellent value for money and plently of choice. In the morning the breakfast was excellent and due to limited number of guests was cooked to order, it would normally be a buffet. All staff both in the evening and the morning were excellent, very pleasant, very customer focussed and very positive about working in this new hotel, which they saw as an exciting new opportunity for all. As I have said it is a brand new building but it is situated in an excellent position. The other part of the College building will hopefully be turned into retail outlets and the attached theatre will hopefully reopen later in the year. The hotel is excellently situated for both Coventry Rugby Club and the Ice Hockey Team. It is a 5 minute walk to the city centre and if you want to go out of the hotel for a meal, there are several good restaurants situated locally. I was very impressed and will visit again, even though I live locally","hotelReviews":0,"location":5,"Location":"Midlands","Helpful":0,"date":"8 February 2012","sleepQ":4,"Cities":0,"title":"“What a transformation!!”","Reviews":0,"value":5,"service":5,"cleanliness":5,"rating":5,"rooms":5}
{"User":"A DaoDao Member","text":"","hotelReviews":0,"location":5,"Location":"Novara, Italy","Helpful":0,"date":"16 January 2013","sleepQ":0,"Cities":0,"title":"“经济酒店”","Reviews":0,"value":5,"service":4,"cleanliness":4,"rating":4,"rooms":4}
{"User":"cmerlo","text":"","hotelReviews":0,"location":4,"Location":"Novara, Italy","Helpful":0,"date":"30 November 2012","sleepQ":5,"Cities":0,"title":"“Tutto perfetto”","Reviews":0,"value":3,"service":4,"cleanliness":4,"rating":4,"rooms":4}
