{"text":"My family and I stayed at Number 16 in Ashton upon Mersey for 1 week at Christmas 2012. We had a great break, it was close to our extended family members so we didn't have to travel too far. It is a great town house for a family with young children as a range of toys, books and dvds, a stair gate, changing mat, cot, high chair and kid friendly crockery and cutlery was supplied - everything we needed but couldn't bring as we were travelling light. Amy was fantastic from the time of our initial enquiry, throughout the booking process and even emailing us afterwards to check if we had arrived in Australia (we were spending our last Christmas in the UK before moving down under). She even arranged Christmas decorations for the property and provided us with a welcome pack of essentials (tea, coffee, biscuits etc) for our arrival, it felt really homely. The only negative comments we had was that the property was cold on the ground floor in the early morning and evening - there is a lot of glass overhead and not many radiators and a draught from the front door. The throws and electric heater was welcomed but if it had been any colder that week we would have been a bit miffed! Otherwise we thoroughly enjoyed our stay and would recommend it to families visiting the Cheshire area. Thanks again Amy","title":"“Great Christmas break”","location":5,"service":5,"value":5,"cleanliness":5,"date":"7 April 2013","sleepQ":5,"rooms":5}{"text":"I stayed at Oakfield Court on Monday to Thursday nights for 7 weeks in November and December 2012, and would thoroughly recommend the hotel. The rooms themselves were spacious, clean and well appointed, and the hotel is quiet and relaxing. Having the facilities to cook your own meals is a Godsend while staying for a while on business, it beats relying on eating out every night! I would give the hotel 5 stars purely for the above, but the service made things even better - the proprietors went out of their way to make me feel welcome and helped in any way they could (even investigating local running routes for me when I happened to mention I fancied a run one morning). I'll certainly stay at Oakfield any time I need to visit the area again, and have already recommended the hotel to several colleagues. Room Tip: Garden studio was perfect for a single guest (though I'm sure a couple would be comfortable ther... See more room tips","title":"“Excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 March 2013","sleepQ":0,"rooms":5}{"text":"Myself and a colleague were attending a course and we stayed here for 3 nights. The hosts were caring and attentive.The place is well located, clean and well maintained. I was in the garden studio apartment it is ideal for a single person or a couple. It has a well equipped kitchenette with clean utensils and complimentary tea/coffee and milk. I parked under a tree which dropped a lot of pollen on the car and was wondering what I was going to do when we leave, but I needn't have worried because when we got back from the course which was walking distance, the car had washed.","title":"“Wonderful, brilliant what more can I say!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"7 March 2013","sleepQ":5,"rooms":5}{"text":"Nice and comfy. All what you need for 2 people. Excelent service and very clean, Plenty of space to relax, work or eat. Very homely and private in good location. Near to shopping and public transport. Room Tip: Much better value than a Hotel if you want space to relax or work.especially if you are staying for... See more room tips","title":"“Plenty of space and homely”","location":5,"service":5,"value":5,"cleanliness":5,"date":"27 February 2013","sleepQ":5,"rooms":5}{"text":"This is my second visit to Oakfield courts. This time I stayed there with my family and once again it's fantastic experience to be there. Very clean and big rooms, fully equipped kitchen and nice central heating to keep us warm. This time they also provided baby bed, toys, DVD's as I am with my 3 year old son. Overall it's a fantastic experience.","title":"“It's a Home away from Home”","location":5,"service":5,"value":5,"cleanliness":5,"date":"15 February 2013","sleepQ":5,"rooms":5}{"text":"I was back in Manchester for a really long time this time and my husband and me stayed in a 1 BHK apartment. And one more time, the experience was just fabulous. The apartment was nice and spacious - just about what two people would need! Victorian style drawing room, LCD big screen TV, nice fireplace.. Long windows overlooking the gravel path! Study table, dining table. A cute kitchen with just about all accessories you would need! Nice bedroom, additional TV in the bedroom. Modern day wardrobes. Bed and linen very clean and changed regularly! Internet access is fast and it helped.. as I could work from home at times! It has everything you need in a home! The location is excellent and the house has a very welcoming aura about it! Its family run and you get all benefits because of that! The hosts are very caring, attentive and helpful. Ever smiling and welcoming, I actually miss being away from Oakfield! Yet another time, it was home away from home - more of a second home! Thanks to the family for yet another wonderful, warm and welcoming stay! Room Tip: The tip is.. PICK any room and you will not be disappointed! See more room tips","title":"“Yet another time!! Fabulous..”","location":5,"service":5,"value":5,"cleanliness":5,"date":"18 January 2013","sleepQ":5,"rooms":5}{"text":"My wife and I recently spent just over three weeks at Oakfield Court during the Christmas and New Year's holidays: our fourth stay there. We both came down with horrible head colds and the staff went \"over and above\" in providing support during our stay. Not the first time we've experienced such outstanding help from them. We are and will continue to be repeat guests.","title":"“Another more than satisfactory stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 January 2013","sleepQ":5,"rooms":5}{"text":"We stayed in the Townhouse over the Christmas period and it was fantastic. The service from the start of booking to the end of our stay was smooth, first class with excellent communication. The Townhouse is perfect for families and all ages are accommodated for. A lot of stress was taken away from us as the Oakfield Court team researched our needs and made sure all equipment we requested for our baby and 4 year old were on hand. The accommodation was very clean, light and spacious. Highly recommended. We will definitely be staying again.","title":"“Townhouse - excellent place to stay”","location":4,"service":5,"value":5,"cleanliness":5,"date":"4 January 2013","sleepQ":5,"rooms":5}{"text":"I stayed in Oakfield for three weeks and my experience is quite good. The place is very neat and clean and has pretty helpful staff with excellent services. If I will visit Manchester again, I look forward staying in same appartment.","title":"“Excellent service and place to stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 November 2012","sleepQ":4,"rooms":4}{"text":"I stayed in two different apartments. The 'hideaway' and a standard studio. The hideaway was fantastic, clean and spacious. the studio was also good and clean. Both apartments well well maintained and i felt a real sense of comfort and privacy during my stay. The owner is very friendly and accomodating. Its close to local amineties and i would recommend it to anyone Room Tip: The 'hideaway' is good value for money See more room tips","title":"“Very clean, very spacious”","location":5,"service":5,"value":4,"cleanliness":5,"date":"14 November 2012","sleepQ":4,"rooms":5}{"text":"I was in Manchester on business for six weeks. I came for two of those weeks alone and stayed in the garden apartment. It is a studio-type fix up but has everything you need and a beautiful little garden and patio where you can sit and drink your coffee in the morning if you'd like. It was spotless and comfortable. During that time I took the tram - about a 10 minute walk away - into the city centre. For the last four weeks, my family joined me so Amy moved us over to Number 16 - a townhouse. It is BEAUTIFUL. The atrium windows over the modern kitchen make the entire space so cheerful and bright. The property is in a lovely village with a park around the corner and all amenities - restaurants and groceries - also around the corner. We enjoyed our stay so very much. Amy takes great pride in her properties and in the way she interacts with customers. She was so gracious when we had a couple of instances when someone broke a glass or plate. Number 16 is not far from a bus stop, but we had a rented car so I drove into Manchester City Centre daily. If you are from a big US city and used to traffic, the drive from Sale will seem super easy to you. It is only about 8 miles and the traffic really is not bad. Number 16 has plenty of room for a family of 5 or 6. The only head's up I would give is to remember the appliances in the UK are smaller overall. Oakfield has everything, but adjust your expectations about things like full size washers, dryers and refrigerators. Plan on doing laundry and grocery shopping more frequently. Since the village shops are open until 11pm and have everything you need, you will be in great shape. We enjoyed daily trips to the shops - it really is a nice way to live. We would definitely stay at Oakfield Court again. You will not find a better hostess, nor a friendlier village to stay in so centrally located to Manchester and the gorgeous countryside only 15 minutes away. HIGHLY recommend Amy and her properties.","title":"“You won't find a better place”","location":5,"service":5,"value":5,"cleanliness":5,"date":"9 November 2012","sleepQ":5,"rooms":5}{"text":"We stayed at the Townhouse for 8 weeks, July and August, after we sold our house and before we had exchanged on our new place. This was a traumatic time but the only stress free part was dealing with the Blake family, moving into and living in the Townhouse. Nothing was too much trouble, emails were answered promptly. One or two minor plumbing problems were quickly sorted. The workmen had been booked in but my wife was not well so the visit was postponed with no fuss or performance. Perfect if you are having any sort of extended stay in the area. No noise from neighbouring properties. May seems pricey until you factor in everything that's included.","title":"“Lifesaver, family run”","location":5,"service":5,"value":4,"cleanliness":4,"date":"31 August 2012","sleepQ":5,"rooms":5}{"text":"We stayed at Number 16. From the warm personal welcome by Amy to our departure date was a joy. Ideal property within easy reach of Manchester Centre by excellent public transport system. Local amenities first class. When visiting the area again we will definately book again.","title":"“Ideal Spot”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 August 2012","sleepQ":5,"rooms":5}{"text":"I had the pleasure of staying at Oakfield Court over a period of several months (March-July 2012) Mon-Fri for business purposes. During my stay I sampled a variety of apartments and each one offered the ideal home from home required when travelling. I found each apartment to be spotlessly clean, well equipped and always have a welcoming homely feel. There was a good wifi signal in the apartments, enough to hold Skype calls without too much lagging. All apartments are private and extremely quiet, I rarely heard a peep out of the other residents during my stay. Oakfield Court is located in a leafy, tranquil, residential area, good access to major routes and plenty of room for parking. The self-catering nature of these apartments provides the convenience of being able to prepare your own food, if you wish, along with the extra space that you would struggle to find while staying in a hotel environment. Personally I found staying at Oakfield took a huge strain out of working away from home for an extended period. Staying at the apartments provided a home from home and haven to escape to after a hard day at work! Amy the manageress was extremely attentive and accommodating during my stay. Nothing is ever too much trouble. I wouldn’t hesitate to recommend Oakfield Court, top marks.","title":"“Peaceful and cosy”","location":5,"service":5,"value":4,"cleanliness":5,"date":"16 July 2012","sleepQ":5,"rooms":5}{"text":"We stayed at the Town House whilst we were having building work done for 3 weeks. We just loved the'middle floor' living there....it was hard to move back home as we had such a comfortable stay. The owners were just fantastic, welcoming and could not have done more for us at a very stressful time! A big thankyou to Oakfield, the Town House will always be a special place in our build journey~ thank you!","title":"“Home away from home!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 July 2012","sleepQ":5,"rooms":5}{"text":"We stayed here for several weeks relocating from hong kong with 3 small children and had a fabulous stay at Oakfield Court. The apartment is finished to a really high standard with all modern conveniences. Very comfortable with lovely views and garden. The area is great too, handy for local shops and parks and not too far from the metro to get into the city. The management were great, helping with any queries and arranging for a supply of toys for the kids, travel cots, high chairs etc for the baby. We had a brilliant stay, and would definitely recommend.","title":"“Home from home”","location":0,"service":0,"value":0,"cleanliness":0,"date":"3 July 2012","sleepQ":0,"rooms":0}{"text":"My wife and I just finished a five-week stay at Oakfield Court. This is the third straight year we've stayed there when visiting relatives and friends in Manchester. That fact, and our rating, reflect our high opinion of the facility and the staff.","title":"“Third straight year”","location":5,"service":5,"value":5,"cleanliness":5,"date":"18 June 2012","sleepQ":5,"rooms":5}{"text":"It was a fabulous two months that i stayed here! well furnished apartments! you-get-everything-mentioned-on-the website and much more.. Warm, friendly very accomodating hosts! great location nice place! evrytime i come to manchester i wud love to be here only! thanks for a wonderful stay! Room Tip: all rooms are good See more room tips","title":"“loved all my time here!!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"9 May 2012","sleepQ":5,"rooms":5}{"text":"This is very comfortable, quite and clean apartment. Staffs are very kind. The transportatation is convenient. If I will come Manchetster again, I will not hesitate to stay here again.","title":"“like home”","location":5,"service":5,"value":0,"cleanliness":5,"date":"19 March 2012","sleepQ":5,"rooms":5}{"text":"Excellent service, friendly owners, apartment is spacious, and comfortable. Close to local amenities, very pleased with my stay at Oakfield!! Would love to come back..","title":"“Second Home!!”","location":5,"service":0,"value":5,"cleanliness":5,"date":"15 March 2012","sleepQ":5,"rooms":5}{"text":"This is my 3rd visit to Manchester and the 3rd time I stay in this hotel; everything about it is great. A simple description would be comfortable, well equipped, clean, high speed internet, onsite parking space, quiet area, easy access to Manchester and the M60. If you're interested in a short or an extended visit this is the place to be!","title":"“Excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"26 February 2012","sleepQ":5,"rooms":5}{"text":"this place is fantastic! clean,bright,convenient and agree with other reviews, feels like a home.would def return. service also excellent. anna","title":"“excellent!”","location":4,"service":5,"value":4,"cleanliness":5,"date":"24 February 2012","sleepQ":5,"rooms":5}{"text":"We stayed in the Townhouse for 2 weeks in December. The house is spotlessly clean and beautifully appointed. For a family with 2 small children (5 and 7) it was a perfect size, and very convenient for central Manchester, and also destinations to the south. Buses are just a short walk away, and the nearest Metrolink station about a mile. Amy was extremely helpful and hospitable, and did more than could be expected to be sure we were comfortable and had everything we needed. Than you! We would definitely come again.","title":"“Townhouse perfect for family visit”","location":5,"service":5,"value":5,"cleanliness":5,"date":"16 February 2012","sleepQ":5,"rooms":5}{"text":"Staying at Oakfield Court is like visiting friends because Amy and her brother make you feel so welcome. They maintain such a consistently high standard of service in the apartments that It would be impossible for anyone to pick faults. Everything is just perfect! Room Tip: All of the apartments are quiet and furnished to a high standard. It depends on your budget and how... See more room tips","title":"“Back again!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 December 2011","sleepQ":5,"rooms":5}{"text":"Amazing service, clean, conformable! Feels like a home! Always a pleasure to come back. Thanks a lot Amy!!!! Absolutely loving yours apartments!!!! Great location as well! Room Tip: Number 16 Church lane are amazing place to stay. My favorite place in UK!!!!!!!! See more room tips","title":"“Really happy to return and stay again!!!!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 November 2011","sleepQ":4,"rooms":5}{"text":"This, our second time of staying at Oakfield Court and we found the service, facilities etc. were still excellent. Our stay was helped by having the same appartment as we had on the previous visit which made us feel very much at home. The proximity of Oakfield to public transport and shops {we do not drive whist visiting the U.K.} is very good and the range of shops in Sale covers most needs. We would have no hesitation in recommending Oakfield Court to anyone who intended to visit the Manchester area. Tony and Leonie TERANG 3264 Australia.","title":"“Still Excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 October 2011","sleepQ":5,"rooms":5}{"text":"I was on business assignment for most of a 6 month period and stayed in various units offered by Oakfield. They were all excellent. As a business traveler, it was so nice to come back to a spacious well-appointed environment. The units have everything you might need, from high speed wireless connections to free car parking. The interiors are tasteful furnished to provide a relaxing atmosphere. The units are conveniently located so that you can easily traverse Greater Manchester and beyond by various modes of transportation. I frequently utilized the close by metrolink, shops, laundrette, and other amenities. Sales is a nice safe location where I felt comfortable walking at night. I can't say enough about the hosts, who try at every turn to make sure your stay is enjoyable. They are available to you day and night, even when you lock yourself out late at night. Amy and Gavin gave advise on local activities, where to shop, and any other of a myriad of questions. Each inquiry was met with a smile and a warm feeling of hospitality.","title":"“A Great Home Away”","location":4,"service":5,"value":5,"cleanliness":5,"date":"28 October 2011","sleepQ":5,"rooms":4}{"text":"I was stayin in \"Number 16th\" with my family for the month of July 2011, and I found this appartent (house) to be perfect or us, and very comfortable. The house is well located in Sale, metrolink is 15 min walking distance, and takes you to central Manchester very fast. Shops are close and the environment around is quite nice. Housekeeing was good and Amy (the Owner) very nice persons always providing help needed and good advices. I strongly recommend this place for families like mine, (2+3). ACM Seville, Spain","title":"“Very nice and convenient accomodation for my family”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 October 2011","sleepQ":5,"rooms":5}{"text":"We selected Oakfield from other reviews left on trip advisor like so many other travellers and we were happy we did, it was like a home away from home. The town house was clean, comfortable, and spacious and was in an excellent location. Amy welcome us and gave us a tour of the house and key instructions that we needed to know. We will definitely stay at Oakfield again whenever we are in Manchester. Our customer experience exceeded our expectations! Lynden and Delleriece Turks and Caicos","title":"“Very nice stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 October 2011","sleepQ":5,"rooms":5}{"text":"I recently rented a one bedroom apartment at Oakfield and my stay was excellent. The apartment was spacious, clean, fully furnished to a very high standard, and pretty much everything you might need is provided, including high speed wireless. It's located in a quiet suburb of Manchester, and the Sale metro stop is about 10 minutes walk away. It's also very close to several shops and supermarkets. Highly recommended.","title":"“Excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 September 2011","sleepQ":0,"rooms":4}{"text":"I stayed from monday to Friday for over 2 years as I was an it consultant working on a client site in wythenshawe. Very quiet location yet minutes walk from shops (marks and Spencer, tesco and sainsburys) and tram station into Manchester). Well equipped and comfortable accommodation (studio 4) plus ample car parking and great service from Amy and team. Only place in Manchester that offered this alternative to a hotel room and I could not recommend it enough!","title":"“Great alternative to hotel life!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 September 2011","sleepQ":5,"rooms":5}{"text":"We selected Oakfield from the other reviews left on tripadvisor, and we were not disappointed with our choice. Amy, the owner, warmly welcomed us and explained to us the necessary information which helped us to set off. The apartment is clean and has all the requirements for a week stay away from home. My 6 year old daughter was also at home with toys and books left in the apartment for her to play with. It is close to public transport and shops, in a very quiet area and not far from the centre. Would consider it again should we visit Manchester another time. Thanks","title":"“Good quality accommodation”","location":4,"service":4,"value":4,"cleanliness":0,"date":"23 September 2011","sleepQ":0,"rooms":4}{"text":"Stayed at the townhouse for a week with hubby and 2 girls (12 and 9), just prior to relocating back from Manchester to Singapore. After having lived in Manchester for a year, I was able to choose our accommodation more wisely than when we first arrived. Staying in a leafy suburb (Sale) has many advantages over the otherwise intuitive tendency to look for acco in town. You get a bigger place, with the comforts of home, at a cheaper price! Obviously, it depends on what you want to do, but most families (as opposed to singles/ young couples) would probably agree. Public transport is probably not too bad, but we rented a car (from thrifty.co.uk), which gave us much needed mobility, and the townhouse comes with free off-road parking, which most places in town don't. Regarding the house - very clean, aesthetically decorated in neutral tones, very modern, fully equipped with all appliances, cooking utensils and crockery, warm, cosy and spacious enough for the 4 of us. A nice small garden at the back, which unfortunately we didn't have time to use, and even a garage. Amy (the owner) is lovely, and made sure we were comfortable. A late check out request was granted at no extra charge, and checking out was as easy as dropping the key through the letter box! I would definitely come back if I visit Manchester again.","title":"“A second home”","location":0,"service":5,"value":5,"cleanliness":5,"date":"19 September 2011","sleepQ":5,"rooms":0}{"text":"I have stayed at Oakfield several times and I am pleased to say that the accommodation has been just as good each time. All of the properties are equally well furnished to a very high standard - clean, well maintained and comfortable. Amy, the manager goes out of her way to make you feel welcome and to ensure that your stay is first class. We have stayed in many places on our visits to the UK to visit our daughters- this might not be the cheapest but it is the best. We will definitely be back and would continue to recommend Oakfield to others.","title":"“Still a great place to stay”","location":0,"service":5,"value":5,"cleanliness":5,"date":"26 August 2011","sleepQ":5,"rooms":0}{"text":"Personal welcome from Amy made us feel welcome. Milk in the fridge and welcome pack made us feel at home. We were than left to enjoy our long weekend in our very comfortable, well equipped apartment. Free WiFi meant we could keep an eye on our emails ( If we really wanted to) Easy access to city center on regular Metro service (or car if you must). M&S just round the corner meant we didn't run out of food and wine Enjoyed a scenic walk along Bridgewater Canal on Saturday evening.","title":"“Top quality. Why have the hassle with a hotel when you can stay here?”","location":0,"service":5,"value":5,"cleanliness":5,"date":"19 July 2011","sleepQ":5,"rooms":0}{"text":"During this, our second lengthy stay at Oakfield Court, we not only enjoyed the apartment, location and convenience, but when one of us experienced medical problems proprietress Amy's help and personal support were above and beyond what would normally be expected. We'll return, and return, and ... For future trips to the north of England we'll look no further for accomodations than Oakfield Court.","title":"“Outstanding in every respect”","location":0,"service":5,"value":5,"cleanliness":5,"date":"10 July 2011","sleepQ":5,"rooms":0}{"text":"We stayed in The Town House for a second time for half term while the boys did a tunnel camp at Airkix (they are training for The World Challenge indoor skydiving championship). It was so good to be back. It's like staying at a friend's house, but a really good friend who leaves milk in the fridge and yummy biscuits and treats for you. I can't rate this place highly enough. Thanks Amy it was fantastic.","title":"“it was SO good to come back”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 June 2011","sleepQ":5,"rooms":5}{"text":"Away from it all but close to shopping, transport & amenities. Best of both worlds. Simply a delightful family run hotel that felt a warm sense of serenity with generous hospitality. There was plenty of parking in the driveway that lead to a welcoming porch. Spacious hallway with pictures and mirrors most cordial after a long trip. Each room was tastefully & individually decorated that felt warm & open with plenty of space. There was a flat screen TV with plenty of channels & enough work space with an abundance of desk space. There was even free wi-fi. Everything was immaculately clean with it’s own large en-suite bathroom. With the town centre being only 5 minutes walk away, we were simply spoilt for places to eat & shop. This place is of the highest quality I would have no doubts about staying here again for business or pleasure. Wonderful to discover. No need to go to a chain hotel.","title":"“No need to look elsewhere.”","location":4,"service":4,"value":5,"cleanliness":5,"date":"23 April 2011","sleepQ":5,"rooms":4}{"text":"Having stayed at many central locations over the years in the Greater Manchester, I am delighted to have been introduced to the \"Oakfield Court\" - The suites are clean, comfortable and offer spacious accommodation nestled in a very quiet safe part of the City. Close are public transport amenities and Restaurants. The accommodations immediately remind you of home and make an excellent \"pied de terre\" in Manchester. This was a much better option than staying at the branded hotels and offer better space, comfort and value! Room Tip: Relax here and Revitalize See more room tips","title":"“Hidden Treasure for Business or Pleasure”","location":4,"service":5,"value":5,"cleanliness":5,"date":"20 April 2011","sleepQ":5,"rooms":5}{"text":"I visit Manchester every year from Calgary, Canada and plan to continue to stay at Oakfield Court because it is so different in character and ambiance from the regular hotel rooms you can find anywhere else in the world through those large chains. Frequently when I wake up in the morning at one of those chain hotels, I don't remember where I am and that is due in part to the fact they are all built to a formula and look the same, Oakfield is not like that. Oakfield has every facility that you would expect in the way of a large flat screen TV, WiFi connection, comfy double bed etc. But what they give you is more, in the way of a very clean separate kitchen where you have everything to make a meal for yourself if you desire (a nice change from eating out each time on a long stay). The separate living room has comfortable couches, a fireplace (in some rooms it was a splendid example of Victorian elegance), a desk and chair to work at and a dining table separate from the adjacent kitchen. The bathrooms are separate and clean with a bath and shower. It is unfair to describe the rooms as a hotel, they are essentially are cozy apartments, which makes them fantastic value. Oakfield is run by very friendly and helpful people, Amy and Gavin will go to great lengths to ensure you enjoy your stay in quiet and comfort. Oakfield is close to the Metro for trips into Manchester and to some decent shopping in Sale and Altrincham. Oakfield is located in a residential area very close the the A56, but with mature trees and a quiet neighbourhood. There is always parking available at anytime of the day and you can come and go at anytime as you please. Personally I could not ask for much more from a hotel and will highly recommend Oakfield to all my friends and family. Room Tip: Ask for a room with a grand Victorian fireplace. See more room tips","title":"“A hotel with Special Character, Ambience and everything else you would expect”","location":4,"service":5,"value":4,"cleanliness":5,"date":"20 April 2011","sleepQ":5,"rooms":5}{"text":"We stayed at Oakfield while house hunting. We had space for the car outside and was within walking distance of shops and the metrolink to Manchester. The one bedroom apartment we had was nicely decorated and comfortable, with good facilities such as TV and internet. If you're staying longer there's plenty of storage room and the kitchen is well equipped. Its a nice and quiet area, apart from the school a few doors down, you can hear the kids playing in the day but otherwise its fine. We made the most of the location next to the tow path for nice runs and walks in the nice weather. All in all a really nice stay, I would definitely recommend.","title":"“fantastic self catering accomodation. no need for a hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 April 2011","sleepQ":5,"rooms":5}{"text":"I was very impressed by the standard of the one bed apartment I stayed in. Amy met me on arrival late on a Sunday evening to show me round and answer any questions. The living room was a decent size and offered a comfortable sofa, dining area and desk. The bed was comfortable and the bedroom had plenty of storage and hangers. Bathroom and kitchen were both spotlessly clean; shower over the bath but powerful and plenty of hot water. The kitchen was compact but exceptionally well equipped for one or two people and included plenty of pots and pans, properly sharp knives and unusual items like a steamer, so great for anyone who stays in an apartment because they like to cook rather than eat out. Apartments are very handily situated within easy walking distance of an M&S Food, large Sainsbury and Tesco but are in a quiet road with little noise. Plenty of on site parking too.","title":"“A comfortable, spotlessly clean and thoughtfully equipped apartment.”","location":4,"service":5,"value":4,"cleanliness":5,"date":"14 March 2011","sleepQ":5,"rooms":5}{"text":"Stayed here for six weeks whilst working in the centre of Manchester in some of the coldest weather of the winter. The studio apartment was always warm and comfortable - the kitchen, bathroom and lounge/bedroom furniture, soft furnishings and fittings all in new condition. The wi-fi system was down briefly only once during my stay. Oakfield is a quiet road - essential work and study during the day was perfectly possible - never heard noise from other residents at any time although an adjacent infant school can be heard faintly occasionally at playtimes. Fast Metro service to city centre 10 min fast walk away. Marks & Sparks, Tesco, Sainsburys all within 5 min walk. Parking plentiful and well lit.","title":"“Fulfilled my requirements - peace, comfort, cleanliness, security - perfectly.”","location":4,"service":5,"value":5,"cleanliness":5,"date":"4 March 2011","sleepQ":3,"rooms":5}{"text":"I have just stayed at the apartments and they offer excellent value for money. Very clean and spacious and everything you could need for a home from home. Amy is very friendly and helpful. If you are a light sleeper try and get an apartment that isn`t next to the main door.","title":"“Excellent apartment and service”","location":5,"service":5,"value":4,"cleanliness":5,"date":"6 February 2011","sleepQ":5,"rooms":5}{"text":"Our first impression was that the apartment was spacious, especially the living room, and the decor soothing and relaxing. Our next impression was how friendly and professional Amy is. We had some difficulties in obtaining the flexibility at other accommodations in that we would have been tied to a week at a time. But at Oakfield, we were able to stay on and off through two weeks, allowing us to visit other cities and Scotland. Amy didn't disappoint, in that keys and apartment were ready when we rode back into town. Location is great, close to the airport and close to our son who is attending Manchester U. The shower for me, not so my hubby, could have been a tad warmer at night. For some reason it was warmer in the mornings?? I'm orginally from the tropics..... Kathleen and Carl","title":"“Spacious, Comfortable, Friendly Service”","location":4,"service":4,"value":4,"cleanliness":5,"date":"25 November 2010","sleepQ":4,"rooms":4}{"text":"Amy and the team really have thought of everything in the Townhouse. The location was great, close to the M60 and the Trafford Centre, and only 15 minutes from the City Centre by taxi. We have family in Manchester, and we are so excited to have found an alternative to hotel accommodation. We will defintely return to the Townhouse. It was great to be able to entertain friends and family during our stay","title":"“So refreshing after spending so much time in hotel accommodation.”","location":5,"service":4,"value":4,"cleanliness":5,"date":"19 November 2010","sleepQ":5,"rooms":5}{"text":"I take my son up to Manchester to fly in the wind tunel at Airkix next to the Chil Factor at the Trafford Centre. We go up at half terms to have a \"tunnel camp\". We rented somewhere last time and hated it so I looked around again and found this house. My son flies with a friend of his and both boys, both teenagers, have learning difficulties. Staying in a hotel is very difficult for us, as the boys need space but they also need us to keep an eye on them. Oakfield Court were SO helpful. The place is so homely and has everything you could need including a washer dryer, small garden, lovely kitchen sitting room with a dishwasher and just space and light. Beds are comfortable, nice linen, good quality pillows, pleanty of towels, shower strong enough and there are lots of small touches that make it feel like a home away from home. It''s also cheaper than staying in a hotel. DEFINITELY glad I found and definitley want to go back - so please don't book it so its free for us!","title":"“Scared to say how good it was because I want to go back and don't want it to be booked up”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 November 2010","sleepQ":5,"rooms":5}{"text":"I have stayed in this apartment hotel for around 3 month between September 2010 and November 2010. It is a apartment hotel which I would recommend to everyone who has to go to Manchester for a short time or a long time period. It offers you nice, modern apartments, a good service around your stay and a very nice and helpfull owner. I have worked in Manchester and it is a quite relaxing atmosphere there. If you want to have some people around just have a trip to Manchester (15 minutes by metrolink) or to Liverpool (30 minutes by car) or if you want to have some time to relax just go for a walk in Sale. The Oakfield apartment hotel is a really nice place to stay and to enjoy Manchester and the english culture.","title":"“Nice apartment hotel for travellers - also for a long time period”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 November 2010","sleepQ":5,"rooms":5}{"text":"We travelled from Australia to visit family and friends for a wedding. It was no problem to organise our trip over the internet and we found an immediate caring response from Oakfield Court Appartments. Our flight was delayed by 12 hours but with the aid of text messaging all was managed without any trouble. The appartment was perfect with a good kitchen and all we needed for supplies only a two minutes walk to Sale (M&S, Tesco's etc), We thoroughly enjoyed out stay and invited about 9 friends and relatives over for pizzas. There was enough room for all. The atmosphere was peaceful and quiet so we recovered from jet lag very quickly!","title":"“Spacious, Charmimg Peaceful and Pleasant”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 October 2010","sleepQ":5,"rooms":5}{"text":"Excellent stay. Apartment spacious, omfortable and well equiped. Good local amenities for eating in or out (Sainsbury'a and M&S close by). Metro link about 10 minute walk. Handy and convenient for Manchester. Very friendly and helpful owners. Would definitely stay again. Highly recommended.","title":"“Well pleased!”","location":4,"service":5,"value":5,"cleanliness":5,"date":"5 October 2010","sleepQ":5,"rooms":5}{"text":"We spent 6 days at Oakfield Court while visiting family and were very happy with the accommodation and welcome we received. We stayed in apartment F on the 1st floor in the main house. The apartment had a big bright living room with high ceiling (and great television set), a small well equipped kitchen, a good double bedroom with comfortable bed and a bathroom. The house has on-site parking and is within a short walk of Marks & Spencers and Tesco. The road outside is quiet with lots of trees. It is reassuring to know that the owner, Amy, is always available with help and information either in the building or by phone. We would certainly stay here again.","title":"“Superior experience and independence to a hotel or B&amp;B”","location":5,"service":4,"value":4,"cleanliness":5,"date":"18 August 2010","sleepQ":4,"rooms":5}{"text":"We stayed (4 adults) in this accomodation for two weeks and had everything we needed at our disposal. The accomodation is self catering with absolutely everything you would need - dish washer, washing machine, iorn, nice TV! Bus stop and village literally 50 - 100m around the corner. Manchester City a train ride away and Sale Town a good walk or a quick bus ride!","title":"“Home away from home”","location":0,"service":0,"value":0,"cleanliness":0,"date":"17 August 2010","sleepQ":0,"rooms":0}{"text":"Following a quick phone call as we left the motorway, Amy was at the door to welcome us when we arrived. We were instantly pleased with our spacious one-bedroom apartment and found everything attractive and clean. We prepared and cooked most of our meals and found the kitchen facilities quite adequate, including the spacious fridge. Comfortable well furnished room, and convenient WiFi easy to set up. Nice view across quiet road to trees. Shopping centre, supermarkets and tram just a few minutes away - quick ride into central Manchester and to Altringham for train to Chester. Good to be able to park free here - it's so expensive in the city.","title":"“Friendly welcome, superb accommodation, pleasant and convenient location”","location":4,"service":5,"value":5,"cleanliness":5,"date":"14 August 2010","sleepQ":5,"rooms":5}{"text":"Set in a secluded suburban street in Sale I found Oakfield Apartments, in my recent four-week stay, offered a relaxing alternative to Manchester's ubiquitous noisy, overpriced and overheated city centre hotels and apartments. The apartment I stayed in was light and airy and tastefully restored. The kitchen was modern and well equipped; the lounge spacious and comfortable; and the bedroom free from the insomniacs nightmare, the blinking and beeping gadgetry and whirring air-conditioning of the ‘modern’ hotel. All freeview channels were available on the widescreen television, and the WiFi connection was free and pleasingly fast. Amy provides a lovely personable but discrete service - this is an apartment not a B&B - and is nearby should you require anything. In my four weeks there I neither heard nor saw another guest, if you discount the sparrows chirruping in the Manchester rain.","title":"“Sparrows chirruping in the Manchester rain”","location":4,"service":5,"value":5,"cleanliness":5,"date":"2 August 2010","sleepQ":4,"rooms":5}{"text":"We found our appartment at Oakfield Court was light and airy, well appointed and very comfortable and quiet and it suited our requirements fully. Amy and the other members of her family were curteous and helpful at all times. Oakfield Court is conveniently placed for those using public transport with the Metrolink trams, taxi's and buses within a short walk. Shopping was also very convenient. We would certainly recommend Oakfield Court to anyone planning to stay in the Manchester area.","title":"“Excellent”","location":4,"service":5,"value":4,"cleanliness":5,"date":"14 July 2010","sleepQ":4,"rooms":3}{"text":"We have used Oakfield Court for several months whilst on a business project, and we have found both the apartment and service top notch throughout. Customer service is obviously key to the owners as they couldn't have been more helpful. Would use again and highly recommended.","title":"“Perfect for Business”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 July 2010","sleepQ":5,"rooms":5}{"text":"My wife and intended a three-week stay at Oakfield Court followed by two weeks of touring. However, we were so pleased with all aspects of our Oakfield apartment that we extended our stay. Our apartment exceeded our expectations; it was large and well-equpped and the Oakfield staff, location and proximity to shops, restaurants, pubs and the metrolink would be difficult to beat. We will definitely be repeat visitors at Oakfield.","title":"“Oakfield Court is Top Notch”","location":4,"service":5,"value":5,"cleanliness":5,"date":"9 July 2010","sleepQ":5,"rooms":5}{"text":"I was thoroughly spoiled by Amy during my stay at Oakfield Court apartments. I was in a delightful garden room, with a comfortable pull out bed, relaxing chair to watch the LCD large screen TV and a handy kitchen to prepare my meals. The bathroom was a good size with a bath and a heated towel rail. The sunshine streamed in the doors leading to the quiet garden - a lovely place for afternoon coffee. The extras such as free wifi, bed light, clock radio and a welcome pack (with street directory) were a nice touch. The apartments are well situated, away from busy roads, but within walking distance to local restaurants and supermarkets. Amy was a most considerate host- just around at the right times. I would recommend Oakfield Court as a base for anyone exploring the Manchester area of Engalnd.","title":"“A wonderful realxing home away from home.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 June 2010","sleepQ":5,"rooms":5}{"text":"I prefer staying in apartments, and this is a great find, loved the personal touch. We stayed in a 1 bedroom which was everything we could have hoped for and more. Huge lounge with fab period fireplace, far bigger than many we have stayed in plus friendly and helpful service made this a very enjoyable stay. We got the metro into Manchester one night which meant we could both have a few drinks. Plus the M&S Foodhall is just across the road for quick food options. Will definitely be using again when visit Manchester.","title":"“Great Stay - convenient for Manchester &amp; Trafford Centre”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 May 2010","sleepQ":5,"rooms":5}{"text":"We thought that an apartment would be suit our purpose than a hotel room and we were right. The Garden Studio was immaculate and large enough for a short stay. The Town house was equally good and very spacious. Every aspect of the accommodation at Oakfield Court is first class from the cleanliness to the fittings and furnishings. There was even wi-fi available to allow you to keep in touch. The owners have thought of everything to make visitors comfortable and at home. We will definitely be booking to stay at Oakfield Court again and would whole heartedly recommend others to do the same.","title":"“FIrst class accomodation in Sale”","location":4,"service":4,"value":4,"cleanliness":5,"date":"9 March 2010","sleepQ":4,"rooms":5}{"text":"I was traveling to the Manchester area for over two weeks for business. This apartment hotel was perfect for this. The old house is well appointed, the apartments are sharp and well equipped for everyday living. They apartments come equipped with all cooking necessities, dishes, great cable television, clean and fresh bathroom, and comfortable bedroom. The units have high-speed internet access for productivity. The owner is most helpful and responsive to any queries. The location is close to all major transportation and plenty of leisure activities and restaurants, theaters, etc. I do highly recommend The Oakfield Court Apartments.","title":"“Great place for short or extended stays, very comfortable, well equipped”","location":5,"service":5,"value":5,"cleanliness":5,"date":"1 March 2010","sleepQ":5,"rooms":5}{"text":"I have stayed in many places that profess to provide 'home from home' comfort - this is the 'real deal!. The location is great, extremely clean with comfortable and spacious facilities. Add to that charming period features in the main house and lots of space in the adjoining building that houses the extra apartments. This is a family run business of the highest order.","title":"“A true &quot;home from home&quot; experience”","location":4,"service":5,"value":4,"cleanliness":5,"date":"24 February 2010","sleepQ":0,"rooms":5}{"text":"We are a family with two kids and we have been using the Townhouse and Number sixteen since 2003 (almost every year). As we live in Barcelona and have family in Manchester we tend to spent X-mas and New Year’s holidays there and some summer. We highly recommend both properties: it is like being at home, so cosy, so comfortable and tasty furnished. I love the Townhouse’s living room, take a cup of tea in the sofa whilst the evening darkened the view from the huge window. I love Number sixteen and its spacious dining room with the glass roofed kitchen. Both, the Townhouse and Number sixteen are set in a great location, not far from one from the other, which is handy for motorways, access to Manchester (by A 56) and the airport. Shops are close by for you to stock up (closer in Number 16) and within 5 minutes is Sainsbury’s, Marks and Spencer or Tesco. Another paragraph should I need to express how welcomed we were every time we arrive: it has been always a pleasure to meet Amy (owner and manager) who is willing to solve any difficulty you may have. We wouldn’t doubt to spent our holidays there: in fact, we have stayed there once and again and again. I wish I could upload more photos.","title":"“cosy, warm, comfortable...HOME”","location":4,"service":5,"value":5,"cleanliness":5,"date":"15 January 2010","sleepQ":0,"rooms":5}{"text":"We have used Oakfield Court 