{"User":"Matchu7","Cities":0,"text":"Had a short stay here in January with my wife. Rooms are beautiful and the service was fantastic...kinda felt like you were visiting friends ! After a night out we were welcomed back and shared a bottle of wine (or two!) with the owner and a couple of his friends and a couple of guests ! Just excellent. Would certainly recommend !","title":"“Fantastic !”","hotelReviews":0,"location":4,"Reviews":1,"service":5,"value":5,"Location":"Rochdale, Greater Manchester","cleanliness":5,"Helpful":1,"date":"28 April 2013 NEW","sleepQ":5,"rooms":5}{"User":"Michael G","Cities":0,"text":"We arrived for one nights stay on Easter Saturday to a very warm and friendly greeting by Anita. We were offered a choice of rooms as there was 2 available and chose the one on the top floor with a four poster bed. Wow what a fabulous room!!! In fact the whole house is beautiful, and is furnished to a very high standard with some wonderful antiques. Later my nephew who lives nearby called in to see if we had arrived ok. Anita came to our room to inform us that we had a visitor and then she promptly made a pot of tea for us all which was brought to us in longe. Later that evening I popped downstairs to see if they had a number for a local taxi and was told that if we came down when we were ready Anita would call one and we could have a glass of wine whilst we were waiting. Breakfast was fantastic and the overall service could not have been better. I would definitely recommend this guesthouse and will almost certainly visit again when I'm next in the area. Room Tip: All rooms are lovely See more room tips","title":"“Superb Guesthouse”","hotelReviews":0,"location":4,"Reviews":1,"service":5,"value":5,"Location":"Bedford, United Kingdom","cleanliness":5,"Helpful":1,"date":"31 March 2013","sleepQ":5,"rooms":5}{"User":"Capesthorn","Cities":3,"text":"We were booked in to Nutters for my 50th birthday celebration, so my wife was looking for a convenient hotel. She booked The Villas Residence for one night & it was absolutely the right decision. We were met by the owner, Paul, who greeted us & looked after us more like family than paying guests. As we were the first guests to arrive on the Saturday afternoon so Paul showed us around the rooms and let us make the choice. We chose the Victorian room, which overlooked he front gardens. It was a good size, well furnished with great light. It's not en suite but the bathroom which is right next door is beautifully & expensively equipped so it's no hardship at all. My wife had a great soak in the Jacuzzi bath as we prepared to go out for dinner. Before we left the hotel for Nutters, we had a very pleasant glass of wine with the other guests in the very comfortable sitting room. Overnight, we had a great sleep in the huge, ornate bed. The linen was possibly the crispest I've ever slept in and made for a very comfortable night. Breakfast, the next morning, was made to order and was most excellent. The staff were polite, discreet, interested & attentive & nothing was too much trouble. Overall, this was a great experience & we would not hesitate to return or recommend it to others. Congratulations to Paul & his team for creating an oasis of tranquility & refinement in an increasingly hectic world. Room Tip: The rooms at the front overlook the manicured gardens & are far enough away from the road so noi... See more room tips","title":"“09 March '13 - The Victorian Room”","hotelReviews":0,"location":4,"Reviews":5,"service":5,"value":5,"Location":"Northwich, United Kingdom","cleanliness":5,"Helpful":2,"date":"29 March 2013","sleepQ":5,"rooms":5}{"User":"NickLovesFood1","Cities":3,"text":"It's not just how ace the villa's is, Paul is a legend! We arrived on a Saturday. There was a power cut as workmen had cut cables on main road! Didn't matter though. Spent late afternoon in candle light with Paul and guests, chatting, drinking wine, relaxing, having a laugh. Rooms amazing. Host, very cool. Breakfast, probably the best I've eaten! The place rocks. I'm a Brighton lad, I'm quite cosmopolitan. Only came up North to pick up some new wheels for my motor! Me and my missus will be coming back. Thanks Paul. Thanks for the wonderful experience!","title":"“I want to live here!”","hotelReviews":0,"location":5,"Reviews":3,"service":5,"value":5,"Location":"Llanberis, United Kingdom","cleanliness":5,"Helpful":1,"date":"24 March 2013","sleepQ":0,"rooms":5}{"User":"Jan D","Cities":0,"text":"A wonderful hotel/guest house. Furnished with great skill, mixing modern amenities with charming antiques. Warm, welcoming, very country-house traditional with great hospitality from both the manager and staff. Excellent breakfast with some of the best home-made marmalade I have ever tasted. Cannot recommend highly enough. Top-spec bathroom is next door (so not quite en-suite) although fluffy bathrobes were provided so no worries on that front! I cannot think of a thing they could do to make this better - superb in every way.","title":"“What a find!”","hotelReviews":0,"location":4,"Reviews":1,"service":5,"value":5,"Location":"York","cleanliness":5,"Helpful":0,"date":"18 March 2013","sleepQ":5,"rooms":5}{"User":"Jes H","Cities":0,"text":"super beautiful English style house, super comfortable, super nice staff and reasonable rate. I will must go back the The Villas Residence if I go to Manchester or Rochdale. Highly recommended. Jes from Taiwan Room Tip: very room is fine See more room tips","title":"“super nice~!!!”","hotelReviews":0,"location":4,"Reviews":1,"service":5,"value":5,"Location":"Taipei, Taipei, Taiwan","cleanliness":5,"Helpful":0,"date":"16 March 2013","sleepQ":5,"rooms":5}{"User":"Paul T","Cities":0,"text":"This really is an amazing hotel. Very small. intimate. Rooms are like an Aladdin's cave. So unique. Great furnishings. Antiques everywhere. So warm. So welcoming. I don't think I have come across rooms of this high standard anywhere. Real attention to detail. This is a real hidden gem. I am amazed at the price. Unbelievable value for money. The host/manager cannot do enough for you.Shared a glass of wine with him and had a good chat. Every hotel should be like this. This really does set the standard for others to follow. Blown away by my experience. Town centre just a couple of minutes walk but you feel like you are in the middle of nowhere. If money was no object, this is how I would have my house. Love it. Will be back time and time again. If you need a hotel in Rochdale, honestly, don't look any further. Tried the rest. This is head and shoulders above the rest. Room Tip: All amazing and truly unique. See more room tips","title":"“Excellent, Quality Boutique Hotel”","hotelReviews":0,"location":5,"Reviews":1,"service":5,"value":5,"Location":"Rochdale, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 March 2013","sleepQ":5,"rooms":5}{"User":"Samhanks","Cities":0,"text":"Highly recommend.The cosy,friendly atmosphere of this hotel makes a memorable weekend. A couple of glasses of red wine and a chat with Paul,before setting off to Nutters restaurant for a gastronomic feast.","title":"“Sam birthday bash”","hotelReviews":0,"location":4,"Reviews":2,"service":5,"value":5,"Location":"Stockport, United Kingdom","cleanliness":5,"Helpful":1,"date":"11 March 2013","sleepQ":5,"rooms":5}{"User":"Graham H","Cities":3,"text":"We have now stayed here twice. The hotel is stunning inside and out. Paul is very attentive, friendly and can't do enough to help. I would strongly recommend a stay here at least once. It's a great place to stay if you fancy a meal at Nutters Restaurant and don't fancy a long drive home. All the rooms are finished to a very high standard and all are unique in their own right. Hope to go back real soon. Room Tip: Any room would be a joy to stay in. If you are a family and need 2 rooms I would recommend the top f... See more room tips","title":"“One of the most stunning places to stay”","hotelReviews":0,"location":5,"Reviews":6,"service":5,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":2,"date":"11 March 2013","sleepQ":5,"rooms":5}{"User":"AntoRumbo","Cities":0,"text":"We stayed here on Saturday after having a very relaxing massage at 'The Little Day spa' in Cutgate (highly recommended) for a well-deserved overnight break from our 7 month old baby. The house is a fantastically well converted period property with spacious rooms, high ceilings and endless original features. It's been very stylishly but sympathetically decorated with some lovely pieces and lots of well-placed details in each room. This gives it a classy show home, or magazine shoot feel, but without any pretension - still a very relaxing place despite having a sense of occasion. There are 6 bespoke rooms, each with its own unique style; we stayed in the front room that has a Chinese/Asian theme, and came with lots of interesting antiquities and pieces to admire. Our room was en-suite with a large and super comfy bed and lovely duvet and pillows. We also had the option to take the room in the attic which had a beautiful antique four poster bed and its own bathroom with a very nice roll-top bath. The owner Paul was very relaxed and welcoming and we were invited to pop down for a glass of wine if we fancied it. Paul supplied the wine and we had an interesting time interrogating him on the story behind the house. Thanks to work, I've stayed in all sorts of hotels in lots of countries and I'm always looking for places like this - it's a real gem. We'll definitely stay here again at some point, probably with friends as a birthday celebration at Nutters restaurant along with another pamper at the day spa - obviously.","title":"“Beautiful and relaxing place”","hotelReviews":0,"location":3,"Reviews":1,"service":5,"value":5,"Location":"Altrincham, United Kingdom","cleanliness":5,"Helpful":0,"date":"17 February 2013","sleepQ":5,"rooms":5}{"User":"Nikki_P216","Cities":0,"text":"We stayed here for a night while visiting friends and from the moment of our arrival, Paul was incredibly friendly and welcoming. We were settled in with a glass of red and conversation in the lovely living room, and that set the tone for our entire stay! The hotel is worlds away from the usual chain fare, with fabulous antiques in every room. The room was warm, comfortable and luxurious, and had some beautiful decor in it without being overwhelming. We were welcomed back from our night with more wine, more conversation and music, and went to bed feeling relaxed and refreshed. Far and away one of the best hotels I have stayed at and a real gem.","title":"“A great independent hotel”","hotelReviews":0,"location":5,"Reviews":1,"service":5,"value":5,"Location":"London","cleanliness":5,"Helpful":0,"date":"2 February 2013","sleepQ":5,"rooms":5}{"User":"helenstocks","Cities":2,"text":"We stayed at the 'Villas' on Friday 25th January, but this time with friends who had not been before. As usual we were going to 'Nutters' restaurant, this time for their 'Burn's Night' celebrations. Paul as usual greeted us warmly and we were immediately 'at home.' After a drink and catch up we went to get ready and Paul ordered a taxi to take us to the restaurant. The weather really lived up to the theme of 'Burn's Night' and we had extremely heavy snow. In fact there was a point when we thought we may be unable to get back to the 'Villas.' However we needn't have worried Paul made sure we got back and was even waiting up to let us in! The room we had was the one with a four-poster bed so were we glad to end up sleeping in it!! As always everything was excellent and of the highest standard. Breakfast was lovely with all the extra touches that make it special. Whilst we were eating and getting ready to go, our host was busy clearing snow from the driveway so that we could get our cars out! Our friends were equally impressed, and hopefully we shall all be returning in the not too distant future, but with better weather!! Helen and Peter. Room Tip: The four poster bed in the room on the top floor really makes your stay special. See more room tips","title":"“Burn's Night”","hotelReviews":4,"location":5,"Reviews":5,"service":5,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"28 January 2013","sleepQ":5,"rooms":5}{"User":"Russell T","Cities":0,"text":"Enjoyed a fantastic stay. The pictures do not do the hotel justice and the decoration and tastefulness of the premises is just fantastic. The owner, Paul, made us feel ever so welcome and found his company and hosting an additional and unexpected bonus. If you want to feel made completely at home, in a fantastic setting then this is the place you need to stay. We will definitely be returning soon. Russ and Lucie","title":"“Amazing amazing amazing”","hotelReviews":0,"location":5,"Reviews":1,"service":5,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 January 2013","sleepQ":5,"rooms":5}{"User":"Andrea K","Cities":2,"text":"We stayed at The Villas Residence on 26 Jan 2013. Great welcome, lovely accomodation, delicious breakfast - rarely do you find somewhere that you can feel this comfortable in all aspects. Thoroughly recommend.","title":"“Great stay”","hotelReviews":0,"location":5,"Reviews":2,"service":5,"value":5,"Location":"Nantwich","cleanliness":5,"Helpful":0,"date":"27 January 2013","sleepQ":5,"rooms":5}{"User":"chimpyringo","Cities":0,"text":"Second time back to this hotel, LOVE it! Mayfair standard - Nice, Good quality, Artistic. High standard antique decorating! good quality from towels, bed, shower to breakfast. Everything is amazing! 100% will go back again!!","title":"“Over 5 stars standard Hotel!”","hotelReviews":0,"location":5,"Reviews":2,"service":5,"value":5,"Location":"london","cleanliness":5,"Helpful":0,"date":"7 January 2013","sleepQ":5,"rooms":5}{"User":"lillianYorkshire","Cities":2,"text":"I booked this for the 22nd December for part of my partners Xmas gift. The owner Paul was lovely as were the other staff and he greeted us with a nice glass of red so we felt very welcome. The bedroom was immaculate as was the whole hotel and we enjoyed a lovely full English on the Sunday. We will be staying there again if in the area again and would highly reccomend this hotel to anyone.","title":"“Lovely Find”","hotelReviews":0,"location":4,"Reviews":2,"service":5,"value":5,"Location":"yorkshire","cleanliness":5,"Helpful":2,"date":"24 December 2012","sleepQ":4,"rooms":4}{"User":"Carolyn H","Cities":0,"text":"We would highly recommend The Villas Residence. A lovely boutique style guest house. Great hospitality shown from Paul and Anita, wonderful ambience, luxury bedrooms filled with antiques and immaculately clean. A real gem culminating in a delicious breakfast.","title":"“East Sussex visitors”","hotelReviews":0,"location":5,"Reviews":1,"service":5,"value":5,"Location":"Uckfield, United Kingdom","cleanliness":5,"Helpful":0,"date":"3 December 2012","sleepQ":5,"rooms":5}{"User":"Family-from-Durham","Cities":5,"text":"From the second you arrive at The Villas Residence, you know you've made a good decision. Paul welcomes you like a long-lost friend and ensures that you are pampered throughout your stay. The spectacular house and the rooms within are like another world - like a wonderful film set made real. The bedrooms and bathrooms are immaculate and would embarrass many of the city's main name offerings. Breakfast is delicious. Lesser places might offer the run of the mill full cooked, instead Paul serves up a delicious eggs benedict. No wonder so many famous TV chefs stay here! Do yourself a favour and book here whenever you're in the Manchester region. Room Tip: All of the rooms are fantastic and Paul will help you to stay in the right one. See more room tips","title":"“The perfect base from which to explore Manchester and beyond”","hotelReviews":4,"location":5,"Reviews":7,"service":5,"value":5,"Location":"Durham, United Kingdom","cleanliness":5,"Helpful":8,"date":"3 November 2012","sleepQ":5,"rooms":5}{"User":"stef11","Cities":10,"text":"From the moment we arrived until the moment we left my girlfriend and I wer