{"User":"TravellingRachel","Cities":0,"text":"Very good Premier Inn.Convenient for city centre. Good view of city from our room on 6th floor Staff friendly and efficient. Found the bed a little too firm for my liking but otherwise everything satisfactory. Continental breakfast had a good choice including muffins ! Will definitely return","title":"“Good situation for the city”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"south west England","cleanliness":5,"Helpful":0,"date":"29 April 2013 NEW","sleepQ":5,"rooms":5}
{"User":"strudwick","Cities":0,"text":"Couldn't fault it. Staff are excellent; not just friendly and helpful, but flexible as well. If I really put my mind to it, I suppose I could grumble about the lack of real ale in the bar, but how many large chain hotels have real ale? Basically, Everything you need from a low cost functional hotel, no wonder Lenny Henry likes them!","title":"“Best Premier Inn I've ever stayed in”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Nottingham, United Kingdom","cleanliness":0,"Helpful":0,"date":"27 April 2013 NEW","sleepQ":0,"rooms":0}
{"User":"ianedmunds","Cities":0,"text":"We tried to get here via satnav but ended up in Coventry one way system hell.. After realising that the hotel doesn't have it's own car park and you have to use the Belgrade Plaza one instead then things became much clearer! The parking is subsidised by premier inn to £5 If you check out before 9, otherwise it's just under £8 a night. The hotel rooms were the usual premier inn standard including the usual dim / energy saving lighting! Clheckin/out was really friendly. The reception was staffed by the same person that ran the bar during the evening so that made getting another towel a bit of a wait but otherwise ok. The breakfast was efficient and hot food was cooked to order. Recommended if you're stopping for a night near Coventry.","title":"“Hard to find but good once you have”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Plymouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 April 2013","sleepQ":0,"rooms":4}
{"User":"coyotes_uk","Cities":0,"text":"My partner and I stayed at this Premier Inn for the third year running for the EPL Ice Hockey finals weekend at the nearby SkyDome arena. The hotel is in a great location just off the Coventry ring road and the edge of the city centre. The hotel has a large multi-story car park next door, as are a Pizza Express/Bella Italia and Cafe Rouge. The hotel was full for the long weekend we were there but, this was never a problen. Check in and check out were completed quickly and without issue. Breakfasts got busy but never overwhelming. If you pay for the Premier Breakfast you have all-you-can eat hot and cold food. The hot food must be ordered from the waiting staff and is brought to your table. After feedback hash browns are back on the menu, they taste great too! As we come to Coventry for this specific event every year, this Premier Inn is the first hotel we book, and we book it as soon as we can. Room Tip: Choose a high room. See more room tips","title":"“Quality hotel in the centre of Coventry”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Manchester","cleanliness":5,"Helpful":0,"date":"15 April 2013","sleepQ":5,"rooms":5}
{"User":"maltraveller07","Cities":0,"text":"This is a one night stay from 27th till 28th March 2013 with my husband and two children. We had a room with a double bed and two single beds. A very basic room, with clean sheets and towels. Overall everything was neat and clean. The lady at the cafe was very nice and friendly. We had a good breakfast. My only complain is that our access card can't be used at the lobby for several times, thus we had to inform the receptionist several times or wait for someone to open from inside","title":"“First experience at Premier Inn”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Selangor","cleanliness":4,"Helpful":0,"date":"11 April 2013","sleepQ":0,"rooms":4}
{"User":"Sime_and_Jude","Cities":0,"text":"We stayed on a Friday night after a days shopping in Coventry and prior to a match in Coventry on the Saturday. We arrived early on the Friday and we parked on the multi storey car park next to the hotel. Parking is cheaper if you use the machine in the hotel lobby. The shops were just a short walk away and after a few hours shopping and lunch in the city we checked in. The man who checked us in was very polite and friendly. We had a double room which was large and a typical Premier Inn room. It was very comfy, spotless and we heard no noise at all. Very peaceful sleep in a very comfy bed. We did have a few drinks in the bar in the afternoon and we had an evening meal. We have never eaten in a Premier Inn before, but we will in future. The food was very nice and a good price. The Camembert starter was amazing as was the pizza. The staff were very friendly and the service was prompt. If we were stopping in Coventry again then we will use this hotel.","title":"“Lovely Premier Inn close to the city centre”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":3,"Location":"Stoke-on-Trent, United Kingdom","cleanliness":5,"Helpful":0,"date":"8 April 2013","sleepQ":5,"rooms":5}
{"User":"stayingplaces","Cities":0,"text":"Good 2 nights stay, in a nice and quiet room, so slept well. Dinner in restaurant was not great but breakfast was nice. Clean and well presented rooms with modern decor. staff very friendly. Would recommend to business travellers & couples.","title":"“Sleep well”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Dublin","cleanliness":5,"Helpful":0,"date":"8 April 2013","sleepQ":0,"rooms":4}
{"User":"LucieJ101","Cities":0,"text":"Stayed here over the previous bank holiday weekend and would like to say a big thankyou, to all the staff who were ever so helpful, the ladies on the front desk, and also the handy man who was sent to our room. It is so refreshing to find a large chain hotel such as premier inn which staff are so fresh and welcoming. They couldn't do more to help me and my partner, they even helped us find places to eat (please see my other review) however poor they were they really went the whole mile to make our stay great! Would recommend for return trips and look forward to booking with you in the near future.","title":"“Very Helpful”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Leamington Spa, United Kingdom","cleanliness":5,"Helpful":0,"date":"5 April 2013","sleepQ":5,"rooms":4}
{"User":"A TripAdvisor Member","Cities":0,"text":"Comfortable, quiet room. Freindly and helpfull staff. Hotel in a good location for visiting the main attractions, Coventry Cathedral, Museums and Coach Station are within 10 minutes walk,. Belgrade Theatre and the multi story car park are both located within the Plaza complex. We would use this hotel again.","title":"“Good Location”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Plymouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"4 April 2013","sleepQ":5,"rooms":5}
{"User":"AlexG250","Cities":0,"text":"From my personal experience, the service received here was excellent, everything was explained well, and the staff were amazing. Also the room was perfect for our stay, very well kept and clean, Perfectly suited for a couple for the night","title":"“Amazing stay, Must try !!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Plymouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"4 April 2013","sleepQ":5,"rooms":5}
{"User":"b8expert","Cities":0,"text":"this experience was made very comfortable by staff ,i visit Coventry ,often find it better when staff treat you well and the and know you all rooms are comfortable and clean ,and located centrally so very convenient for work.","title":"“efficent staff”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Uk","cleanliness":5,"Helpful":0,"date":"31 March 2013","sleepQ":5,"rooms":4}
{"User":"SnuzMon","Cities":0,"text":"The room was immaculate, the staff on reception and at breakfast were friendly and helpful, the breakfast was well presented, well cooked and above all tasty. If only all Premier Inn's were like this!","title":"“Best Premier Inn I've ever stayed.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Chester","cleanliness":5,"Helpful":0,"date":"30 March 2013","sleepQ":0,"rooms":5}
{"User":"Lee S","Cities":8,"text":"Stayed for 1 night as a stopover on a trip to Yorkshire. Excellent hotel very central location close to shops, restaurants and the transport museum. Staff extremely efficient & helpful. Parking is closeby in a secure multi storey and is reasonably priced at £7.50 for 24 hrs if you have your ticket validated at Premier Inn. You can park outside the hotel entrance for 30 mins to drop off luggage before parking at the car park. Breakfast was plentiful and good value for a family of 4. Dined at Pizza Express in the evening just a few metres from hotel. Visit the Transport Museum if you get tbe chance, it is excellent and has free admission.","title":"“Excellent City Hotel”","hotelReviews":7,"location":4,"Reviews":13,"service":4,"value":4,"Location":"Coventry, West Midlands","cleanliness":4,"Helpful":9,"date":"24 March 2013","sleepQ":4,"rooms":4}
{"User":"SEC67","Cities":0,"text":"i've stayed in this Premier Inn a few times when meeting up with friends in Coventry; the rooms are clean and comfortable and the breakfast, if you choose to pay extra to have it, is perfectly adequate. It's centrally located, with a couple of restaurants underneath - the Italian is very nice.","title":"“you know what you're getting”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Herts, UK","cleanliness":4,"Helpful":0,"date":"21 March 2013","sleepQ":4,"rooms":4}
{"User":"dizzyydora","Cities":0,"text":"Stayed here for three nights, The hotel is in a excellent central location , just a few minutes walk from the shops and cathedral. The hotel has no parking but there is a multi-storey car park next door and you can get a slight reduction in the price if you get your ticket validated at the hotel, and as with this chain of hotels you pay for the room and not per person. Had a full breakfast, ample choices,and evening menu also and if you combined both it was classed as a meal deal. Belgrade theatre and a bella pizza restaraunt just around the corner and shopping in walking distance. Had a very enjoyable stay, anything we wanted we asked the very helpful staff. Room Tip: Book well in advance to get a bargain price of £19.00 See more room tips","title":"“Girlie Weekend”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"england","cleanliness":4,"Helpful":0,"date":"19 March 2013","sleepQ":5,"rooms":4}
{"User":"paffle29","Cities":0,"text":"As a family of five, we couldn't fit in one room but got two at a reasonable rate as I'd booked several weeks in advance. Each room (across the corridor from each other) had a good quality double and two lesser quality single beds. Rooms and double beds were generously proportioned. They had the standard amenities, including hairdryer, tea/coffee, TV. No safe though. You can get 30 minutes wi-fi for free by registering with Premier Inns online, after that payment is required. The rooms were comfortable and we slept well (maybe it was the psychology of the sleep guarantee!). Breakfast was free for kids with paying adults, which was good value. There was a choice of cooked breakfast or \"continental\", with a large selection of self-service cereals, breads/pastries/muffins, fruit, yoghurt, juices, and bottomless tea and coffee of several varieties. Staff were friendly and service-orientated, from reception, to cleaners to wait-staff. Location was handy to the centre of Coventry, including the bus and train stations. Only downside is that there is no parking at the hotel, rather residents have to use the Belgrade Square multi-storey carpark across the way. It is well-signposted and we had no trouble finding it coming from Birmingham airport direction. Residents of the hotel get a 10% discount. Daily rates are around €7. Check-out was quick - essentially we just had to hand in the keycards and get the parking discount ticket. I would definitely stay here again.","title":"“Comfortable, friendly and well located”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Dublin, Ireland","cleanliness":5,"Helpful":0,"date":"18 March 2013","sleepQ":5,"rooms":5}
{"User":"Scotlandscout","Cities":0,"text":"Booked the hotel as we were going to the Cheltenham Festival and decided not to pay the hugely inflated hotel rates in Cheltenham and as we have lost our regular hotel. We needed to be near the bus station (7 mins walk from the hotel) as we were catching a coach from there to Cheltenham and the hotel is ideally placed. Glad though did not book the Britannia...by that looked grim from the outside.. Anyway the Premier Inn was quite busy when we arrived late after parking the car just over the way from the hotel which is very handy. Reception staff very friendly and chatty with a warm welcome and quick check in. Small cosy bar/food area which was busy when we arrived and did always appear to have people using it, did not have breakfast though Our first room was not suitable as it was right in front of the main door after the lifts and the door bangs when closed, not a good room to be in when people coming and going and not everyone would close it quietly. Back down to ask to change the room, changed without problem or fuss but obviously staff are aware of the problem with the door, so we had another large room away from the lifts. This room had a double bed with 2 singles. You know what you’re getting with a Premier Inn and this one was no exception, clean, tidy with all you need for a short stay. Plenty of hanging space and tea/coffee kettle, hairdryer but quite a small TV though. Bed fine although a little hard for me, but bedding good (although the maid did forget to make the bed one day, I must have done a good enough job myself!) Plenty of large thick towels towels in the bathroom which again was very clean and tidy with an one soap fits all dispensers on the wall, good shower pressure as well. The car park was charged at £7.50 a day through the hotel, but you’re better off with the £20 offer the car park has if you’re staying more than 2 nights which you can pay over the counter at the car park itself. There are places around the Inn to get something to eat and we did end up having a curry from round the corner just past the theatre which was quite good All in all good base at an excellent price for what you get and I would recommend this Premier Inn if your needing to stay in the area.","title":"“Excellent base for what we needed”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"England","cleanliness":4,"Helpful":0,"date":"16 March 2013","sleepQ":4,"rooms":4}
{"User":"rosie200","Cities":0,"text":"The hotel is in a good position, just a few minutes walk from the shops and cathedral. Pizza Express, Bella Italia and the theatre are a few yards away. The hotel has no parking but there is a multi-storey car park next door and you can get a slight reduction in the price if you get your ticket validated at the hotel reception. There is a free drop off point outside the hotel where you can park for 20 minutes to load/unload. Check-in was efficient and friendly. Our room was very clean, comfortable and quiet. The only downside was the service in the restaurant. The cooked breakfast took 50 minutes to arrive. In the evening, the waiter seemed preoccupied with entertaining his girlfriend, who was allocated one of the best tables in the restaurant for several hours despite not buying anything to eat or drink. The food was reasonable value though. All in all I would definitely stay here again.","title":"“Good location. Good value. Would stay again.”","hotelReviews":0,"location":5,"Reviews":0,"service":3,"value":5,"Location":"Leeds","cleanliness":5,"Helpful":0,"date":"13 March 2013","sleepQ":5,"rooms":5}
{"User":"DemiHeidelberg","Cities":0,"text":"Central, clean, comfortable, friendly. Fresh fruit salad for breakfast! Beds and bed linen excellent and room lovely and quiet. Cosy bar/breakfast area. Very accommodating staff throughout. Altogether great value for money.","title":"“Ideal for a college reunion”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Heidelberg","cleanliness":5,"Helpful":0,"date":"11 March 2013","sleepQ":5,"rooms":4}
{"User":"Valerie025","Cities":0,"text":"We received a warm welcome and permission to store luggage till check in time. Staff pleasant and helpful. Room clean and spacious with good facilities. Bar had no tomato juice and was down to last bottle of sparkling water! Breakfast quite good, bit short on teaspoons. But all in all not bad.","title":"“OK conference stay”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":4,"Location":"London, United Kingdom","cleanliness":4,"Helpful":0,"date":"9 March 2013","sleepQ":4,"rooms":4}
{"User":"linzil00","Cities":0,"text":"Great night had a comfy bed and room was was very clean!! Great go have a costa downstairs very handy!!! Great central location and wonderful staff!! Everyone was v friendly and helpful!!! Very close to shops, restaurants and the theatre which is what we wanted it for!!!","title":"“Great last minute find!!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"west mids","cleanliness":5,"Helpful":0,"date":"9 March 2013","sleepQ":0,"rooms":5}
{"User":"Youel","Cities":0,"text":"Just returned from our second stay at this Premier Inn, and I have to say just as good as the first. All staff from reception, bar, restaurant, cleaning staff, were very friendly and helpful . We had the Meal Deal which is very good value for money, and was very enjoyable along with the excellent service given. The location is a two minute walk to the Belgrade Theatre, which was the reason for our visit, and very close by is a multi storey car park which is manned and very good value. Will definately return!","title":"“Another good weekend”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Sheffield, United Kingdom","cleanliness":5,"Helpful":0,"date":"5 March 2013","sleepQ":5,"rooms":5}
{"User":"plinthadenoid","Cities":0,"text":"Well, it's a Premier Inn so everyone knows exactly what you're going to get. The rooms are comfortable, big bed, fresh sheets, clean bathroom, no frills. Great staff on site, really friendly and personable, even remembered our room numbers (we had two rooms) and really couldn't do enough for us, excellent. Premier Inn hotels are a great base, not a destination, they are functional and fine and the staff seal the deal.","title":"“Comfortable hotel”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":3,"Location":"swindon,uk","cleanliness":5,"Helpful":0,"date":"4 March 2013","sleepQ":4,"rooms":4}
{"User":"1985born","Cities":0,"text":"My first time I have stayed in a premier inn hotel and can't complain staff are very helpful rooms are clean with everything you need in them iron at reception if needed I will book premier inn again because of this so I think you couldn't go wrong doing the same food was good standard also and I enjoyed my meal 3 course dinner with a drink and free breakfast for £22.99 great deal","title":"“Good hotel”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Wishaw, United Kingdom","cleanliness":4,"Helpful":0,"date":"26 February 2013","sleepQ":0,"rooms":4}
{"User":"Maria S","Cities":0,"text":"Very central location just across the road from the main shopping area.means you can keep popping back to drop off bags and rest up with a drink or coffee. Going out in the evening you can walk into the city centre, so no taxi fare, the Belgrade theatre is just round the corner and there are places to eat just around the corner from the hotel if you don't fancy the hotel restraunt. The staff are all welcoming,friendly and very helpful. We stay here 4-5 times every year.","title":"“Very central”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Brighton, United Kingdom","cleanliness":4,"Helpful":0,"date":"25 February 2013","sleepQ":4,"rooms":4}
{"User":"Malcolm F","Cities":0,"text":"First of all I booked a twin Room when we got there we were told that the policy of Premier Inn is to give you a family room so they should have stated this at time of booking also postcode and address on my confirmation was wrong firstly there is no such place as butt road in Coventry its butts then the postcode is for a Carpark on the other side of Coventry if it wasn't for a nice policeman we would have had to sleep in the carpark also if you have to contact hotel by phone payphones are extortionate as also mobile charges to 0871 are last time I book with these back to travelodge at lease you get what it says on the tin!!!!!!!!!!!!!!!!!!!!!!!!!","title":"“What a ****************** shambles”","hotelReviews":0,"location":3,"Reviews":0,"service":3,"value":4,"Location":"Norwich, United Kingdom","cleanliness":3,"Helpful":0,"date":"25 February 2013","sleepQ":3,"rooms":1}
{"User":"KentSteve33","Cities":0,"text":"Another Premier in stay this time Coventry city centre. Actually got one of those £19.00 rooms which is a first, so have very little to complain about. However if paying full price you will need to take into account the extra £8 or so for parking the car overnight in the multi-story car park next door overnight. Not a huge cost but an extra all the same","title":"“Great deal but parking is extra”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Kent","cleanliness":4,"Helpful":0,"date":"25 February 2013","sleepQ":4,"rooms":4}
{"User":"Adriang68","Cities":0,"text":"Spent two nights here, and it was average to say the best. Check in, there were three of us, and somehow two of us they managed to get the names and the credit cards crossed, and despite saying it would be corrected, it wasn't. Big deal? Well it was when the swipe card to my room wasn't working, and I was trying to get reception to correct it. The whole thing is very safe and secure, to get anywhere within the hotel, you have to swipe. Parking is paid for at this one (it's close to the city). Room was typical Premier Inn (from my limited experience). It was winter, and the room was cold, when I bumped up the heating, it was warmer, but the fan was dead noisy. Not something that usually bothers me, but this time it did. 30 mins free wifi each day, but a who day is only 3 pounds, and it works fine and easily. There is a bar/restaurant attached, we had breakfast there both times. First day was a lot better than the second, I'm assuming it was because they were short staffed, it took some time, one person on my table's was forgotten. Had to nag for a coffee mug, etc. Besides the breakfast, and the check-in issue, the staff were friendly and helpful. Just outside there is a pizza restaurant, didn't eat there. We walked to a pretty decent Indian which was just under a mile away. (see my other review). And in the neighborhood, there were a few pubs, no idea how good (or bad) it was. We stayed there for a work thing, some of our group stayer at the Britannia, and they were scathing of the place. So we made the right choice.","title":"“mmm, average at best.”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Amsterdam, The Netherlands","cleanliness":4,"Helpful":0,"date":"25 February 2013","sleepQ":3,"rooms":3}
{"User":"Arch_Stanton_73","Cities":0,"text":"This was the 2nd time I've stopped here. The rooms are clean and modern and comfortable. No iron or safe in the room. Would expect one with the prices they charge. The staff are very friendly. Nice bar. Didn't try the food. Good location but the down side is if you have a car, the parking. I was told that the car park next door would cost me around £6 for the night. I arrived on a Saturday at 5.30pm and left at 9am on Sunday and the parking cost me £11.20 Should've gone by train.","title":"“Clean”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":2,"Location":"Wolverhampton, United Kingdom","cleanliness":4,"Helpful":0,"date":"24 February 2013","sleepQ":5,"rooms":3}
{"User":"andrew1211","Cities":0,"text":"One night stay, £40 for a double without breakfast seemed a decent price, some may get it cheaper still. Rooms fairly basic but functional and with all you need for a short stay. Tea and coffee facilities. Good lighting. Nicely decorated. Aircon facilities. TV with Freeview. Good shower in bathroom. Clean and generally well maintained. Beds and pillows very good meaning a great night's sleep. Minimal noise from corridors and adjacent rooms. Check in was very friendly and efficient. Ate in the restaurant and was quite nice food at a reasonable price with a good selection to choose from. Needless to say burgers and lasagne were off the menu lol! Didn't have brekafast but the menu looked good and at £8.95 seemed half reasonable compared to the rip off prices you often see. Overall a good budget style hotel that I would recommend.","title":"“No complaints”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Leeds","cleanliness":4,"Helpful":0,"date":"18 February 2013","sleepQ":5,"rooms":4}
{"User":"Sheree315","Cities":0,"text":"The disabled hotels rooms are brilliant. They really are comfortable and easy to get around, I'm a wheelchair user so I found the bedroom and bathroom really spacious. At times my temperature control goes a little haywire so I found the temperature control panel really useful. I found my stay really enjoyable, comfortable and the staff are really friendly. Room Tip: I've stayed here 3 times and each time I thoroughly enjoy the experience See more room tips","title":"“Loved the whole experience.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry, England, United Kingdom","cleanliness":5,"Helpful":0,"date":"18 February 2013","sleepQ":5,"rooms":5}
{"User":"MisterMJL","Cities":0,"text":"Stayed here two nights. The hotel is relatively new, decent sized bedrooms, good security and air co in bedrooms. The staff were very pleasant and helpful. The only downsides were the amount of items on the menu which were not available. garlic mushrooms were not available both nights due to lack of garlic butter !!! On my second night I thought I would go for bangers and mash only for the waitress to come back and apologise that they had no mashed potatoes! Not as if I wanted some exotic fair. Breakfast was fine by the way. Car parking is in a muti storey a few yards away. Beware the overnight parking rate does not start until 11:30PM so if you arrive at the end of a normal day you will get hit for two rates and even with the hotel discount I still got hit for £10 parking fee. All in all a good hotel with nice staff let down by not ordering supplies in a timely manner and excessive parking charges","title":"“Decent Hotel shame about the lack of food and parking costs”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"North East England","cleanliness":5,"Helpful":0,"date":"17 February 2013","sleepQ":5,"rooms":5}
{"User":"Vanna H","Cities":0,"text":"We stayed for one night only. The rooms and bathrooms were spotless. Staff were very friendly and helpful. Only one minor gripe, the lights were 'cold', being, I think, LED lighting. It is known for giving people a headache after a while. The garaging facilities were very good, just a step across the 'yard' from the hotel. Take your parking card to the hotel for them to validate it and assure you of the discount. Food in the restaurant is good and not overpriced, especially the breakfast deal, when you can eat as much as you can manage. Altogether a good experience (once you have cracked the card door opening system!0 Room Tip: We had 4th floor rooms. The road noise was not intrusive from there. See more room tips","title":"“good overnight stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Bridlington","cleanliness":5,"Helpful":0,"date":"17 February 2013","sleepQ":4,"rooms":5}
{"User":"NJI1970","Cities":0,"text":"I've stayed here on a number of occasions now and I genuinely cannot fault the place. Well, except the once when someone in the kitchen burnt some toast and the fire alarms went of! At least you know the alarms work! For me, this is the best hotel in Coventry and wonderfully located for sightseeing. Don't hesitate to book.","title":"“Perfect!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"11 February 2013","sleepQ":0,"rooms":5}
{"User":"Sandra A","Cities":0,"text":"We had a lovely time at this hotel the staff were wonderful so helpful and pleasant. The rooms were a very good size and very clean. The breakfast and dinner are great plenty of choice and very good quality. We would definatley stay here again. The welcome here is much better than expensive hotels I have stayed in staff really seem to care","title":"“Lovely warm welcome”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 February 2013","sleepQ":5,"rooms":5}
{"User":"aileen90","Cities":0,"text":"I stayed here with a friend when we were attending the spring fair at Birmingham Nec. Cant fault it in any way and would recommend to others. Nice breakfast, and some good restuarants very close by if you want to \"eat out\" in the evening. Great value for money, and only 10mins on the train from the nec.","title":"“Does exactly what it promises - has great staff who are friendly and genuinely happy to help you.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Motherwell, United Kingdom","cleanliness":5,"Helpful":0,"date":"7 February 2013","sleepQ":0,"rooms":4}
{"User":"iamtripper","Cities":0,"text":"I was attending a birthday party in Coventry and needed somewhere cheap to stay overnight, I managed to get a sale deal......£19 for a double room for one night, bargain ! For a \"budget\" hotel chain it was really good, I'd say better than Travelodge which I've stayed in before. The room was spacious, clean and modern, usual tea / coffee and there were soap / shower gel dispensers in the bathroom so you don't necessarily have to take your own. Premier Inn have a good nights sleep guarantee as well, any problems there's someone available to help 24/7 such as if you want to change pillows for a different firmness ! The reception, bar and dining areas were all clean and modern looking. Janine the receptionist was great at check-in, friendly, polite, efficient and she was very informative such as the good nights guarantee, if we wanted to book a table for evening meal, if we needed a taxi etc. We decided to eat at the hotel for ease before going to the party, there are some meal deals, we went for the 3 course meal deal....decent choices for each course, also a drink and breakfast next day were included, all for £22 or £23 (can't remember which !). I had chicken goujons, steak & chips and cheesecake. It was all good. Breakfast the next day was help yourself to cereals, toast, crumpets, muffins, yogurt, juices, tea / coffee, when you were ready the waiting staff then took your order for cooked breakfast, although you ordered rather than help yourself you could order as much as you wanted. I had a 2 egg omelette, two sausage, one veggie sausage, fair bit of bacon, beans - all tasted great, good quality food. The meal deal saved something like £11 per person compared to if we had ordered each item that we had so for two of us this was a good deal. The waiting staff (Sam in particular) were also polite, friendly and interested in making your stay as good as possible. All the staff we met were young people but I've got to say that they were all friendly & polite and seemed to really care about the service they were delivering. So all in all it was a great stop over and I'll definitely look to stay at a Premier Inn again.","title":"“Great place for a stop over !”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":5,"Location":"Droitwich, United Kingdom","cleanliness":5,"Helpful":0,"date":"3 February 2013","sleepQ":5,"rooms":5}
{"User":"Mike T","Cities":0,"text":"Excellent service, cannot fault anything. Instantly greeted at the door, my room was spotless, the whole building was clean. Staff were really friendly, I felt genuinely looked after. Restaurant was impressive too. Best night sleep I have had in ages; would happily stay again. Great location, everything within walking distance. First time ever at a Premier Inn - expectations were exceeded.","title":"“Excellent - happily stay again!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":3,"Location":"Cheltenham, United Kingdom","cleanliness":5,"Helpful":0,"date":"2 February 2013","sleepQ":5,"rooms":5}
{"User":"thehorans","Cities":0,"text":"Great staff. The weather was bad so we stayed in for dinner. Choice of food could have been wider but quality was OK. Location was good but car park is a nightmare, especially if you like me couldn't remember the reg number and had to go back and...in this day and age... the machine doesn't take cards! Breakfast was good","title":"“Business Trip to Coventry”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"manchester","cleanliness":0,"Helpful":0,"date":"29 January 2013","sleepQ":0,"rooms":0}
{"User":"emmaclairebll","Cities":0,"text":"When i walked in the premier inn i was welcomed at the reception, my room was big, clean and i had a lovely night sleep. The food was nice and i spoke to a housekeeping girl name sharlene was so polite, with a smile. i would recomend staying here to a friend.","title":"“I would stay here again. The people are so welcoming.”","hotelReviews":0,"location":5,"Reviews":1,"service":5,"value":5,"Location":"Coventry, West Midlands","cleanliness":5,"Helpful":0,"date":"28 January 2013","sleepQ":5,"rooms":5}
{"User":"Shellybot","Cities":0,"text":"Brilliant hotel, well situated and very comfortable. Staff were extremely helpful, and the room was brilliant. The hotel is everything I come to expect from a Premier Inn and the fact that all the hotels I have stayed in within this group have all had the same high level of cleanliness, friendly staff, good food and comfortable rooms, says a lot about the Premier Inn chain and is one of the reasons I always chose to stay in a Premier Inn even if a cheaper alternative is available. Would highly recommend this hotel.","title":"“Fantastic hotel.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Oxford, United Kingdom","cleanliness":5,"Helpful":0,"date":"25 January 2013","sleepQ":5,"rooms":5}
{"User":"Esme L","Cities":0,"text":"This is my second time staying in the Premier Inn while in Coventry - great clean rooms, comfortable beds and very friendly and accommodating staff. Upon check-in I was upgraded to probably the biggest suite in the hotel, one with a double bed and 2 singles! Breakfast is very good with healthy options. Location is even better and withing easy walking distance to Coventry 'downtown', University, shops and restaurants. I might add that this is probably one of the most secure hotels I have ever stayed in - but well worth the discomfort of using your key card to open door after door after door. Highly recommended. Room Tip: As usual, i always ask for a high room for quiet. See more room tips","title":"“Perfect everything”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Amman, Jordan","cleanliness":5,"Helpful":0,"date":"21 January 2013","sleepQ":5,"rooms":5}
{"User":"mitchell251106","Cities":0,"text":"Perfect stay - excellent staff as last time. Reception super friendly and efficient, breakfast staff couldn't do enough and bar staff cheerful and efficient until closing time! Come on Premier Inn if you have an internal rewards programme the Belgrade Team deserve it!","title":"“Return to Belgrade Premier Inn Didn't Disappoint”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Wakefield, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 January 2013","sleepQ":5,"rooms":5}
{"User":"Steve D","Cities":0,"text":"Modern Premier Inn with good ample parking literally a couple of minutes across the road. Usual high standard of accommodation with plenty of good restaurants nearby. Priced competitively with helpful staff. I've used this many times and will continue to do so. Highly recommended.","title":"“Central location, good parking and excellent accommodation.”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Stowmarket, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 January 2013","sleepQ":4,"rooms":4}
{"User":"nietzsche91","Cities":0,"text":"I found the hotel to be fantastic, all the staff were very friendly and helpful, it also helped that it was round the corner from the clubs, and shops. I would definitely recommend this to anyone going to Coventry for a great time.","title":"“Convenient, in the centre of town”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"7 January 2013","sleepQ":0,"rooms":4}
{"User":"Daniel B","Cities":0,"text":"Nice room and very spacious, had fantastic time. Staff were also very helpful. Got a good deal on the price, and was very impressed. Well located in centre of Coventry, with all shops nearby. Offered good deal on parking as well!","title":"“Clean and new”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Leicester, United Kingdom","cleanliness":5,"Helpful":0,"date":"6 January 2013","sleepQ":5,"rooms":5}
{"User":"GeorgieGee","Cities":0,"text":"like any premier inn the room was very clean and checking took about 30 secs. girl on the desk was very friendly. the rooms are very secure and cannot be accessed easily. there are three doors that required swipe keys before reaching ours. didnt hear any noises at night from the nearby ringroad. only issue was getting in, you have to get into the carpark via the ring road, as there is no through road to the carpark. there is however a discount given to premier inn guests if you get them to stamp your ticket on reception. overall great for £27 stay!","title":"“no problems”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Coventry, United Kingdom","cleanliness":0,"Helpful":0,"date":"4 January 2013","sleepQ":0,"rooms":0}
{"User":"carol h","Cities":0,"text":"We stayed in a family room which was spacious, had comfortable beds & was very clean. Was helpful of hotel to ring us ahead of arrival to offer directions and explain the car parking to us- this is not something I would have expected from a budget hotel so pleasantly surprised. Fantastic value with the £29 winter rooms rate.","title":"“Great value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Reading","cleanliness":5,"Helpful":0,"date":"30 December 2012","sleepQ":0,"rooms":5}
{"User":"Swampduck32","Cities":0,"text":"From the minute we arrived till when we left staff we very helpful and looked after us. The rooms were comfortable and clean. Nice stay especially for their deal price of £19 for the night. Would go back again especially at discounted prices.","title":"“Comfortable stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"24 December 2012","sleepQ":0,"rooms":4}
{"User":"Chen0weth","Cities":0,"text":"This hotel is situated between the city centre and the ring road, close to a multi-storey car park. The Belgrade Theatre, Pizza Express and Bella Italia are all a very short walk. It is modern and clean, functional, comfortable and very good value for money. We found reception to be friendly and efficient. Our room, on the fifth of six floors, was a reasonable size and well laid out with all the essentials including a 'phone, plenty of good quality towels, extra pillows. Travelodge please note. The bed was a double, nice and firm. Here are a few niggles, none of which should put you off staying here. The lighting in the room has a peculiar \"cold\" quality due to the preponderance of halogen and EU inspired light bulbs. The bath had no grab handles making stepping into and out of the shower a hazardous business for older guests. The TV is quite small and the sound quality is not the best. Radio can be obtained but there were no TV instructions in the room. As with many hotels these days, it is necessary to sweep the area in front of the hotel regularly to clear away discarded cigarette ends. We had a trouble-free comfortable night though and would stay again without a second thought.","title":"“A few details to put right”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":5,"Location":"Leamington Spa, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 December 2012","sleepQ":4,"rooms":3}
{"User":"silavent","Cities":0,"text":"The only thing that lets this Hotel down is the cost of parking in the adjacent car park. The Hotel itself is clean,well managed and I wish I had one of their beds in my house.Our room on the sixth floor was huge with all we needed. I just think £8.25 for a breakfast is too dear when Weatherspoons close by offer such good value and better coffee.","title":"“Belgrade Plaza”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Budleigh Salterton, United Kingdom","cleanliness":5,"Helpful":0,"date":"10 December 2012","sleepQ":5,"rooms":5}
{"User":"Alst68","Cities":0,"text":"We had to stay at the Premier Inn due to our kitchen been refitted. The hotel was with in walking distance and close to work for both of us. The reception staff made checking in very easy and quick. The room was on the top floor and a good size. The bath was full size with a shower connected to the taps I used the bath and it was nice to relax in. The bed was a god size and comfy. We booked the meal package which gave use a good choice of meals and all you can eat breakfast. The food was very nice and plentiful . We had a good night the only improvement would be a bigger TV with the ability to listen to the radio.","title":"“Great night stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry, United Kingdom","cleanliness":5,"Helpful":0,"date":"6 December 2012","sleepQ":5,"rooms":5}
{"User":"Bonniebeard","Cities":0,"text":"The hotel is located just a few minutes walk from the city centre. Parking is available for £5 at a multistorey car park right next to the hotel. The room we had was a family room. It had everything you'd need for a good, comfortable nights stay. It was clean, well equipped and spacious. The beds were comfortable. The staff were exceptionally helpful and friendly including Mathew on reception who was just as bright and friendly late at night as he was early the following morning. We had cooked breakfast which were freshly prepared and there was a great choice of fruit, bread, pastries etc. highly recommenced for a convenient place to stay overnight if visiting Coventry. We were going to the NEC and this hotel was a 20 min drive away","title":"“Friendly staff excellent location”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"24 November 2012","sleepQ":0,"rooms":5}
{"User":"Fran R","Cities":0,"text":"I Stayed her for two nights during my son's graduation. The room's were cheap(ish), clean, basic but nice. Hotel staff were helpful and friendly, food was average but reasonable value. The waiting staff were exceptional (Mat) went above and beyond and really made dining here worthwhile, it would have been better if the chefs had concentrated and delivered complete meals but as they did mess up our meals, the hotel gave us two free breakfasts. Good location for university and City Centre.","title":"“Good for the price”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":4,"Location":"King's Lynn","cleanliness":4,"Helpful":0,"date":"22 November 2012","sleepQ":4,"rooms":3}
{"User":"ambientcreative","Cities":0,"text":"Paid £19 for a double room in the PI promotion (it was a sunday night). Bargain. We have stayed at this Premier Inn before and found it to be clean, the staff personable and welcoming. This hotel is new-ish so as yet not frayed around the edges. It is mega handy for the city centre, university (we were here for Cov Uni Graduation Week). First time I have used the adjacent Belgrade Plaza Car Park (left car for over 24hrs - cost £7.50 with the PI validation - otherwise I think its a tenner).","title":"“Good location, clean. Good Value.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Darlington, UK","cleanliness":4,"Helpful":0,"date":"20 November 2012","sleepQ":4,"rooms":5}
{"User":"r_dawe453","Cities":0,"text":"The room was cold and adjusting the heating controls made no difference.There was a lot of noise from the adjoining room, and the car park charges were extortionate. I would never recommend this hotel to anyone. Room Tip: ask for a room that doesn't have an internal connecting door to the next room See more room tips","title":"“Disappointing!”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Welshpool, United Kingdom","cleanliness":0,"Helpful":0,"date":"19 November 2012","sleepQ":0,"rooms":0}
{"User":"Horton-Clarke","Cities":0,"text":"We stayed here for 2 nights in May for a Wedding - we paid a very reasonable rate so were happy with our stay overall, location-wise its perfect, 3 min walk into town/ the main High Street & very close to the main Train Station & the National Express Coach Depot, there's also a Pizza Express directly next door if you want to stay very close to the Hotel. Coventry City Centre didn't feel very safe at all so I wouldn't recommend walking around late at night but the Hotel was secure with security doors & swipe-cards etc, the desk is manned 24hrs & the staff were very helpful. Rooms are very standard, clean enough, bed is average but has clean linen/ towels & bathroom was fine with bath - there's also a TV & coffee making station in the room. Would certainly recommend if your traveling on a budget.","title":"“You pay for what you get - overall a typical Premier Inn.”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"London, United Kingdom","cleanliness":3,"Helpful":0,"date":"15 November 2012","sleepQ":3,"rooms":3}
{"User":"David B","Cities":0,"text":"Previous Premier Inns have been annexed to a public house so to stay somewhere where there are on site facilities was excellent. The Hotel is very conveniently located with numerous restaurants nearby so a good choice if you wanted to eat out. Breakfast was superb - not a cold stodggy brreakfast buffet that more expensive quality hotels offer but fresh cooked brought to your table - a massive bonus. Rooms were clean and spacious as was the bathroom so no complaints there. Unfortunately we did book just a couple of weeks beforehand so the rate we got was no cheaper than one of the 'quality' hotels but we stayed hear as the rest of our party were already booked in so make sure you book early to get the best deals. Room Tip: Book early to get a good price See more room tips","title":"“A pleasant surprise”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Chester, United Kingdom","cleanliness":4,"Helpful":0,"date":"12 November 2012","sleepQ":4,"rooms":4}
{"User":"doreen s","Cities":3,"text":"Went to the thearter which is a stone throw away from the premier Inn and the rooms were excellent food great and reasonable, staff was very helfull they could not do enough for you, Bar was great and all drinks available at reasonable prices a week-end by my self, Husband, Daughter and grandson was thourghly enjoyed will visit again. Highly recommend this Preier Inn. Room Tip: We you go in the mulit storey Car park and ground floor takes you stright into the hotel reception... See more room tips","title":"“Excellent Rooms and resturant”","hotelReviews":3,"location":5,"Reviews":4,"service":5,"value":5,"Location":"Coventry, West Midlands","cleanliness":5,"Helpful":2,"date":"12 November 2012","sleepQ":5,"rooms":5}
{"User":"myrtlemaySheringham","Cities":0,"text":"We stayed here as it was such a bargain price and included the meal deal when booking! What a wonderful suprise! It was superb for the money. The staff were the most polite and helpful I have ever encountered and I run a B & B! So close to all the City sights and station etc. Food superb value for money! We all enjoyed it and will be going back! Well done! I hope that they keep such good staff......","title":"“Superb - 5 star!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Sheringham","cleanliness":5,"Helpful":0,"date":"11 November 2012","sleepQ":5,"rooms":5}
{"User":"HandbagGrrl","Cities":0,"text":"I probably stay in this hotel a couple of times a month as my company has an office here. I wouldn't stay anywhere else; this is much the best budget hotel in Coventry and I've stayed in a few! The rooms are clean, big and the staff helpful and charming. The bar is nice and I have heard very good reports of the steaks from colleagues although I haven't tried one myself. The breakfasts are excellent as they are freshly cooked and not left sitting about, as in other Premier Inns. You are very close to the Belgrade Theatre and the centre of Coventry; if you don't fancy eating in the hotel there is a Pizza Express (OK) and a Bella Pasta (barely OK, I wouldn't bother) very close to the hotel. Parking is in a multistorey next to the hotel; I don't use it but haven't heard any complaints about price. In summary, great business hotel if you have to stay in Coventry, you get a good nights sleep and a great breakfast. What's not to like? Room Tip: Try for the fifth or sixth floors as it takes you above the traffic noise. See more room tips","title":"“very good Premier Inn”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Newcastle","cleanliness":5,"Helpful":0,"date":"10 November 2012","sleepQ":5,"rooms":5}
{"User":"Lee A","Cities":0,"text":"My son and I recently visited Coventry to see the T Rex musical \"20th century Boy\" at the Begrade Theatre, virtually next door to the hotel. Initially, it seemed difficult getting to the hotel by car for I could see the hotel in the distance, but because the city centre is pedestrianised could not drive directly to it. However, driving back onto the ring which circles the city, it proved easy to get to and was well signposted. I have to say, the hotel stands in an excellent location, convenient and central to the brilliant Belgrade Theatre and amongst a bustling hive of shops, restaurants and bars that are flourishing throughout the city centre. Next door to the hotel is also a multi storey car park where, on production of a ticket from the hotel, a discount can be obtained for overnight parking. The hotel itself should pride itself on its cleanliness and attention to detail, for it sparkled throughout. Our room was spacious, well equipped and spotless! The two beds, a double and single, were of the best quality. Firm but not hard mattresses which guaranteed us a good night's sleep. Bedding was of excellent quality, clean and crisp - a sheer delight to get into. There were even two extra pillows provided, offering a softer \"feel\" for those who favour a less rigid support under their head. I thought that this was a great personal touch! I loved the bathroom which was spotlessly clean. The taps, basin, bath and shower sparkled impeccably. The shower was super efficient - I couldn't find fault with anything. Although the room was spacious, within seconds of switching on the controlled heating it was warm and cosy, even though it was cold, miserable and wet outside! I also found the hotel to be very quiet inside despite its central location. We'd booked breakfast for the following morning - and this is the only element of the hotel's service which sadly let them down - prompting me to rate it 4 rather than the 5 it really should be credited with. We got to the restaurant at 8am and had to wait by the door, behind others, for 15 minutes until a table became available. Once shown to our table we were asked to help ourselves to coffee, coissants, toast, fruits, cereals etc and that a waiter would soon take our orders for cooked breakfasts. However we waited for over 40 minutes to have our orders taken. I had ordered a full English breakfast which was eventually served without bacon. The waiter appologised and quickly brought out some bacon which was freshly cooked. Our breakfasts were cooked to perfection and maybe well worth the wait - or perhaps it was because we were so hungry! Anyhow, I felt that the amount of time we'd waited to be served was far too long. Yes, as the restaurant staff pointed out, they had been rushed off their feet, which I can fully understand. However, I just formed the opinion that the restaurant was too small to cater for the amount diners wanting breakfast that morning. Certainly, if this is the norm - others will complain. But overall a great hotel to stay in providing exceptionally good value for money. It certainly brightened up a miserable, cold, wet weekend. I would definitely stay here again and recommend this hotel to all my friends. Definitely one of the better hotels I have stayed in. Well done Premier Inn - keep up the good work!","title":"“Excellent value and rest assured”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Ipswich, United Kingdom","cleanliness":5,"Helpful":0,"date":"6 November 2012","sleepQ":5,"rooms":5}
{"User":"ACKBrussels","Cities":0,"text":"Lovely personnel, children friendly, easy parking and walking distance to town. Breakfast is plenty - but better when the hot buffet is out (first day we had to place orders for the hot part). Rooms are huge, clean and quiet. In other words all that is needed!","title":"“Very good choice”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"brussels","cleanliness":0,"Helpful":0,"date":"6 November 2012","sleepQ":0,"rooms":0}
{"User":"TJMOZZA","Cities":0,"text":"Stayed at Premier inn Belgrave Plaza as was close to a friends wedding venue. Great experience. Will recommend and stay again. Parking rate for overnight stay was £7.50. Breakfast was really good. Rooms clean and comfortable. Bed very comfy. A bit of noise from the motorway but that's to be expected. We booked in advance so the room cost £29! Great value.","title":"“Great value. Great location, lovely breakfast. Convenient and good value parking.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Birmingham, United Kingdom","cleanliness":5,"Helpful":0,"date":"6 November 2012","sleepQ":0,"rooms":5}
{"User":"everton175","Cities":0,"text":"what a great place to stay,from the excellent car parking to the great staff,the well set out rooms,the cleanliness was brilliant,the actual location in the city centre was great with plenty of bars and food outlets.A very enjoyable and relaxing stay.","title":"“great place”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Nottingham, United Kingdom","cleanliness":5,"Helpful":0,"date":"5 November 2012","sleepQ":5,"rooms":5}
{"User":"Fiona F","Cities":0,"text":"We stayed here prior to a Uni open day. It proved to be a good location for the uni - the hotel was excellent, could tell it was quite new. Parking next door was easy enough. We booked on a special offer so the price we paid was very good value. Would use this hotel again if need be.","title":"“Excellent choice”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Kent","cleanliness":5,"Helpful":0,"date":"5 November 2012","sleepQ":5,"rooms":5}
{"User":"Gedcarlin","Cities":0,"text":"Stayed here 2nd and 3rd November 2012. The hotel is in the centre of Coventry and is ideally located for the town and the motor museum. The hotel was clean and the staff were helpful. Our room was clean and tidy and excellent value for the money. The breakfast was nice and enough to keep you going until dinner. No complaints at all about our stay and would certainly recommend it to anyone going into Coventry. The hotel doesn't have it's own car park, however you can use a multi story car park across the road and you get reduced rates when doing this, we stayed for 2 nights and the parking cost us £7.50 in total which isn't bad at all. You would be mad to pay more for anything else.","title":"“Good value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Durham, United Kingdom","cleanliness":5,"Helpful":0,"date":"4 November 2012","sleepQ":5,"rooms":5}
{"User":"emm78","Cities":0,"text":"This was a great city centre base for us when taking our children to the transport museum and cathedral. Staff were friendly and welcoming and our family room was modern and spacious. One of the children's beds was a very low futon type affair which was fine for my five year old but I wonder whether an older child might complain about 'sleeping on the floor.' Our room was on the 'road' side of the hotel but the windows were very well glazed and there was no traffic noise at all. We didn't eat in the hotel as we wanted to see what the city had to offer. There are lots of places to eat nearby and the hotel is very well located for the museums and shops. Excellent value for £29 - I can't imagine why we'd pay considerably more to stay anywhere else for a stop over in Coventry in the future as this Premier Inn gave us exactly what we needed.","title":"“Great city centre hotel.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Lichfield, United Kingdom","cleanliness":5,"Helpful":0,"date":"2 November 2012","sleepQ":5,"rooms":5}
{"User":"NowlookatmeBanburys","Cities":0,"text":"Location is excellent for the city centre, National Transport Museum, Belgrade Theatre and markets are nearby. The cathedrals, Herbert Museum and University are just a short walk away. Check in was quick and friendly, room clean and comfy, bathroom fine. Good budget hotel, and I would stay again.","title":"“Nice location and good value...”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"London","cleanliness":4,"Helpful":0,"date":"31 October 2012","sleepQ":4,"rooms":4}
{"User":"paul c","Cities":0,"text":"used the hotel for the 1st time because it was close to the theatre belgrade parking house was ideal as hotel has no parking check in went well and staff were polite and helpful used the disabled room as i use a w/chair very large room very clean we had a evening meal and b/fast which was hot and tasty leaving in the morning received a voucher for car park discount will be stopping there again Room Tip: disabled room roomy and bed are lower See more room tips","title":"“good hotel in centre”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Oswestry, United Kingdom","cleanliness":5,"Helpful":0,"date":"30 October 2012","sleepQ":5,"rooms":5}
{"User":"JSmith852","Cities":0,"text":"Thankfully there were only 2 of us staying in the room, as the sofa which doubled as the third bed was dirty and stained and I would not have liked to have to sleep on it. We had the meal deal which is good value for money - including rump steak","title":"“what a stay”","hotelReviews":0,"location":3,"Reviews":0,"service":3,"value":3,"Location":"Manchester, United Kingdom","cleanliness":3,"Helpful":0,"date":"29 October 2012","sleepQ":3,"rooms":3}
{"User":"Always_0n_trip","Cities":0,"text":"The Premier Inn in Coventry is located in the town centre, parking is provided in the closeby Belgrade Parking house as the hotel has no own parking space. The check-in went well, and the room was good size. The room was also furnished as most other Premier Inns. There are couple of restaurants around, which I would recommend over the restaurant in the hotel. I had only breakfast in the hotel, the service was ok, but not more. The food was ok, but not more.","title":"“Good hotel in town centre”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":4,"Location":"Nauheim, Germany","cleanliness":3,"Helpful":0,"date":"28 October 2012","sleepQ":4,"rooms":4}
{"User":"Briatin","Cities":0,"text":"Thankfully there were only 2 of us staying in the room, as the sofa which doubled as the third bed was dirty and stained and I would not have liked to have to sleep on it. We had the meal deal which is good value for money - including rump steak - which would be excellent if the chef knew the difference between medium-rare and well done!! Breakfast - What a disaster!! - There was a massive queue for the toaster as it took a minimum of 3 passes through to even change the colour of the bread. There was no fresh orange juice on arrival - the dispenser was empty. We asked the waitress for more and she refilled it. Once we had asked for more cups (as none were available) the coffee machine was then out of coffee beans. Once these were filled it ran out of milk!! Then there was no sugar, It was hit & miss what you were offered for breakfast - one waiter only offered one of each item , however the other waiter was asking guests how many of each item they wanted. Having witnessed the excellent service at the Warwick Premier Inn, perhaps the Coventry staff should be sent there for training to see how it's done.","title":"“Worst Premier Inn”","hotelReviews":0,"location":3,"Reviews":0,"service":2,"value":4,"Location":"Louth","cleanliness":2,"Helpful":0,"date":"27 October 2012","sleepQ":3,"rooms":3}
{"User":"Vicki1185","Cities":0,"text":"I've stayed here twice, both times to attend the EPL Ice Hockey Finals Weekend that's held at the Skydome. Both times the rooms have been clean, comfortable and generally nice places to be. It's ideally placed for getting around town, and the staff are very friendly. Food is OK but nothing to write home about, we tend to eat out a lot though. The bar is very nice and has on occasion stayed open late for the hockey fans to drink and socialize, a very nice touch. Overall a very nice hotel.","title":"“Central and Convenient”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":3,"Location":"Stoke-on-Trent, United Kingdom","cleanliness":5,"Helpful":0,"date":"24 October 2012","sleepQ":5,"rooms":5}
{"User":"royferg","Cities":0,"text":"spent the night here a short while back, i was over to see 20th Century Boy the Musical, Room was very clean, and the service was very good, after 3 days in Golders Green the food was fantastic. Would stay here again, staff very friendly and help full.","title":"“very good hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"BELFAST","cleanliness":5,"Helpful":0,"date":"14 October 2012","sleepQ":4,"rooms":5}
{"User":"DenniBg","Cities":0,"text":"Excellent location only 2 minets to the city center and shops. Clean and big rooms, very friendly and helpfull staff. Good for exploring Coventry and the region - close to the bus station and bus stops.","title":"“Very nice”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Bulgaria","cleanliness":4,"Helpful":0,"date":"11 October 2012","sleepQ":4,"rooms":5}
{"User":"Spenhog","Cities":0,"text":"The hotel is lovely the rooms are nice and clean and well maintained, the service is good. They only thing I would say is there is no on-site parking and you have to use a multi-storey nearby which is very expensive. Beware it only takes coins so if your staying longer than a few hours you need to set up an account and pay by phone or text.","title":"“Great Hotel”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Manchester, United Kingdom","cleanliness":4,"Helpful":0,"date":"10 October 2012","sleepQ":5,"rooms":5}
{"User":"345jones","Cities":0,"text":"You do have to pay for car park but very upmarket multi story. just £5per night.Small bar and restaurant but was ample for number of guests staying.So close to city centre. We were visiting NEC only 15 mins drive very easy .Easy access from M40 or cross country good roads via Stratford from M5 Room Tip: Rooms facing city centre seemed quieter See more room tips","title":"“Very good”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Launceston, United Kingdom","cleanliness":5,"Helpful":0,"date":"8 October 2012","sleepQ":5,"rooms":5}
{"User":"SoniaHaddad","Cities":0,"text":"I have stayed here twice while visiting University of warwick and both times were excellent. nice clean rooms, convenient location, friendly staff. I would definitely recommend this hotel if staying in this area.","title":"“Sonia Haddad”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Newry, United Kingdom","cleanliness":5,"Helpful":0,"date":"5 October 2012","sleepQ":5,"rooms":5}
{"User":"bikehippy","Cities":0,"text":"Well, I read the reviews so I kind of did expect it, but haven't particularly enjoyed Premier Inn in the past. I stayed here three nights for a conference and can hardly fault it. The staff were all lovely and the food was pretty decent and good value (I wouldn't say amazing though). My room was a really good size - I couldn't believe the price I got it for, it was clean and comfortable, the bathroom was like new and the bath even had a plug. (tip: bring bubble bath!) I'd have liked better lighting in the bathroom so it was more relaxing (also wish they'd plumbed it the other way round so I could lie back in the bath and see the TV!) but that's a minor point. I slept really well at night, no noise problems - you'll occasionally hear people walking by the door, or a loud motorbike passing by outside, but I found the room to be very well sound insulated, and I'm quite fussy about that kind of thing. Wifi was decently priced, £3 per 24 hours with first half hour free each day. Unfortunately the only time I wanted to buy a voucher, the wifi was down. It's a shame you have to go down to the desk to buy wifi vouchers, would be nice to do that through the portal. If I return to the conference next year, I'll definitely book here again.","title":"“Did not expect that.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"UK","cleanliness":5,"Helpful":0,"date":"2 October 2012","sleepQ":5,"rooms":5}
{"User":"DavidTeesValley","Cities":0,"text":"Everything that can be expected of a Premier Inn with a reliably clean room of good size and working space. However, only 30 minutes free wifi, parking was an additional £8.10 overnight in the adjacent multi-storey and then there is that frustrating £2 charge for paying by credit card. Automatic check in machines are now being introduced too removing the need for a personal touch. Room Tip: This Premier Inn is in an impressive building - was the old Coventry Technical College See more room tips","title":"“Coventry Premier Central”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Tees Valley","cleanliness":5,"Helpful":0,"date":"1 October 2012","sleepQ":4,"rooms":5}
{"User":"Pepperam1","Cities":0,"text":"Fab hotel by any standard. Spacious rooms, courteous staff, clean, modern and in the centre of Coventry but still quiet. 5/5. I will just add that parking is at the Belgrade car park 30 second walk away. £7.50 with a validated ticket overnight. The car park is secure and modern.","title":"“Superb in every way”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"30 September 2012","sleepQ":0,"rooms":5}
{"User":"capesy","Cities":0,"text":"we stayed for one night as we went to see a musical play at the Belgrade Theatre, disappointing breakfast, room smelt like public toilets, having said that the staff were all lovely, we found some kind of black stuff we can only think was mould that had come out of the dispenser in our orange juice, the breakfast was nowhere near the quality we had in London, dont like having to do this review because we have always liked Premier Inns and have never had a bad experience, but i have to be honest, sorry.","title":"“BIT DISAPPOINTING”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":3,"Location":"uk","cleanliness":3,"Helpful":0,"date":"23 September 2012","sleepQ":3,"rooms":3}
{"User":"mitchell251106","Cities":0,"text":"Coventry is my home town and we usually stay with family but this time we stayed at the Belgrade Plaza Premier Inn. I was a bit worried about leaving our car in the local car park but I was soon reassured. The best car park with 24 hour staffing. The check in at The Premier Inn was efficient and friendly and soon we back in the recognisable premier inn room. What an excellent format these hotels have - perfectly set up with lights, mirrors and sockets just where you need them. After an evening out we arrived back at midnight to the very friendly evening staff before falling into the comfy bed with comfy pillows for an excellent nights sleep. Faultless and all for £33.00","title":"“Everything premier but the price - its true!”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Wakefield, United Kingdom","cleanliness":0,"Helpful":0,"date":"22 September 2012","sleepQ":0,"rooms":0}
{"User":"benjaminspratling","Cities":0,"text":"Me and my family have stayed at Belgrade Plaza Premier Inn on numerous occasions, but this one was a special visit. During the year, us and a lot more families from around the UK meet up for either parties or just a general \"reunion\". The staff at Premier Inn are so welcoming, extremly polite and well mannered! From the check-in staff to Costa Bar staff, all lovely! We stayed for a two night period, the special part being that we was staying over New Years Eve! We arrived at the hotel, grabbed a bite to eat and went to our amazingly clean and comfy rooms! We relaxed for a bit, unpacked in the large clothing area and watched TV! I also enjoyed a mug of complimentary green tea! We love the fact that the hotel is situated right in the centre, near the precint, restaraunts such as our favourite, Cosmos and the maze of IKEA! We love staff never fail to dissapoint! Another stay booked in October! Bring It On!","title":"“Such A Plaza”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Hull","cleanliness":5,"Helpful":0,"date":"22 September 2012","sleepQ":0,"rooms":5}
{"User":"ZIS49","Cities":0,"text":"Great place for staying in Coventry. Close to the centre, friendly and helpful staff, comfortable bed, good breakfast, worth every penny you pay for it. The only drawback was very slow internet connection. Still - highly recommended.","title":"“Just what you need”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Kielce, Poland","cleanliness":5,"Helpful":0,"date":"19 September 2012","sleepQ":5,"rooms":5}
{"User":"janet_edgington","Cities":0,"text":"Very comfortable hotel room, very clean and such a comfy cosy bed. All the staff were welcoming and friendly. I thought the breakfast was a little overpriced, but there was plenty to choose from.Parked in the multi-storey car park next door and reception told me to get my ticket validated at the car park reception for a special rate.","title":"“Great Experience”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"West Drayton, United Kingdom","cleanliness":4,"Helpful":0,"date":"19 September 2012","sleepQ":5,"rooms":5}
{"User":"Romanknight","Cities":0,"text":"When I was told that I been booked in the Premier Inn for our business conference I have to admit I wasn't looking forward to my 2 night stay. What a snob! I couldn't have been more wrong. From the outset the first impressions were good. The staff at reception were extremely helpful and polite as were all the staff. My room was my next surprise, clean modern, and very spacious and all for £65pn. We ate out for dinner but returned to use the bar which was open until 1 am. Again service was excellent. Tip - you can't charge drinks to your room so its pay as you go. My biggest surprise of all was the breakfast, it was excellent. Cooked to order with lots of choice and fresh, unbelievable and unexpected!!! Normally breakfast in this standard of hotel is buffet style and very average. Wifi was free for first half hour then £3 and if you've stayed at the hotel you get a discount on your parking at the adjacent multi-storey car park. Tip park on the 2nd flloor which will take you straight to the hotel. Location was also excellent, walking distance to the town centre. Would I stay there again? A definite YES!","title":"“Very good value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":4,"Helpful":0,"date":"13 September 2012","sleepQ":4,"rooms":4}
{"User":"Gavin_R1986","Cities":0,"text":"I love returning to this hotel, it's handy for Coventry train station and Birmingham Airport when I decide to have a weekend here. This was my fifth stay. Really enjoy a fabulous hearty breakfast and always have an enjoyable night's sleep in a superb comfortable bed, so it never disappoints me. As always, I look forward to the next time I stay there, thank you very much!","title":"“Love coming back”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Cumbernauld, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 September 2012","sleepQ":5,"rooms":5}
{"User":"lappins","Cities":0,"text":"I stay here regularly during the week and am always impressed with the attitude of the staff. They are obviously well trained, and are most welcoming and friendly. The rooms are clean, modern and comfortable. They can get warm. But there air conditioning available free in every room. The food in the restaurant is good too. Not sure if there s a full-time chef present, but the food is well cooked and presented. They say that you get what you pay for, but I have pad more for food of a much lower standard. It is my hotel of choice in Coventry","title":"“Clean, modern, and excellent service from staff”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Glasgow, United Kingdom","cleanliness":0,"Helpful":0,"date":"7 September 2012","sleepQ":0,"rooms":0}
{"User":"david j","Cities":0,"text":"the staff were outstanding,the room was clean and had excellent facilities, the food was very good and the meal deal is good value for money. i will defintly stay here next time i am in the area.very friendly staff helpfull and polite.had a good nights sleep and it was easy to find.","title":"“my first stay at the premier inn coventry city centre”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Cardiff, United Kingdom","cleanliness":5,"Helpful":0,"date":"3 September 2012","sleepQ":5,"rooms":5}
{"User":"Paul B","Cities":0,"text":"Excellent value for money very clean staff very helpful what a great idea to put a premier inn in an old college great character.car park very convenient & reasonably priced.breakfast was excellent value for money but evening meal was good value on the meal deal at £22 but was only standard of brewers fayre.","title":"“Bury fan”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Bury, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 August 2012","sleepQ":5,"rooms":5}
{"User":"Rachel H","Cities":0,"text":"Have visited several times, as usual the price was great, the room was airy and clean, the staff especially Allan on night shift were very polite and friendly. This is a low cost hotel that never cuts corners. Breakfast was delicious serve by brilliant staff","title":"“Another great visit”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Durham, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 August 2012","sleepQ":0,"rooms":5}
{"User":"fifemadman","Cities":0,"text":"this hotel is so well situated in the city it's fantastic ,the hotel it's self is great from the moment you enter with a big smile from the reception staff to the bar staff at 1am in the morning .With great places to eat and drink its a ideal place for a weekend away","title":"“Top stay in a top hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"28 August 2012","sleepQ":0,"rooms":5}
{"User":"c_hewson44","Cities":0,"text":"Found this PI to be one of the best we've stayed at. Very modern building and our family room was clean & large with a king sized bed and 2 single beds for the children. Air con. worked very well, in fact we had to turn up the temp. as it got too cold before we retired for the night (outside o/night temp. 14 deg C plus). Can only think that Griswoldsontour had a room with a faulty air con. All in all we had a really good night's sleep and an excellent breakfast. Only complaint is that the hotel doesn't have a car park, so it cost an extra £7.50 for o/night parking even after PI's agreed discount.","title":"“Top notch”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"king's Lynn, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 August 2012","sleepQ":5,"rooms":5}
{"User":"janetj589","Cities":0,"text":"We always try to choose a PI close to the railway station and all amenities and this PI fits the bill. Is appx a steady 15min walk from the station through lovely city centre gardens. But if you have lots of luggage or its raining, numerous buses stop at Belgrade Plaza and PI is just behind there. It is also within easy walking distance of the Transport Museum, Cathedral, Belgrade Theatre (this is virtually next door)and all city centre shops and eating/drinking places. Our room met the standards we expect from PI, all the basic facilities, spotless,comfortable, roomy. We were in room 503 which faced private flats and the Belgrade multi~storey car~park (not half as bad as it sounds!), and below us (5th floor) was an unloading area,and though we went through the week it was very quiet day and night. However because of this Im guessing that even numbered rooms face the ringway road? This must be fairly noisy as traffic is constant, in our room with the window open this was just a low drone, but I cant imagine opening the window at the front?This could also be a problem as this PI lacks air~conditioning and we would have been v.uncomfortable with the window closed. To be fair staff seem aware of this and there is a note in the room saying that fans are available. Staff were exceptionally friendly and helpful.They provided a city map to show where tourist sights were, and all their directions and information was accurate. we have never faced indifference from PI staff but here they just seemed happy to go that extra mile to help out. We didnt eat here as we wanted to get out and about for awhile in the evenings so I cant comment on the food and as we didnt drive there Im not 100% sure but believe that car~parking is at the adjacent Belgrade multi~storery and is a reduced fee (£5?) per 24hrs for PI customers. We made an on~line advance booking and paid £58 for the two nights which we think excellent value.There may be more up~market hotels in Coventry but they would be hard pushed to give better value at that price. Room Tip: request a room away from the ring~road side. See more room tips","title":"“didnt disappoint”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Buxton, United Kingdom","cleanliness":4,"Helpful":0,"date":"25 August 2012","sleepQ":3,"rooms":4}
{"User":"Griswoldsontour","Cities":0,"text":"At first glance this hotel is beautiful, set in an old college the outside is very grand and the foyer seems much more grand than a premier inn! Even the kids couldn't believe we were staying here! It is a very large hotel and is modern and clean. The restaurant is aesthetically nice and the breakfast was a good, standard premier breakfast, we didn't eat there for our evening meal. The room itself is of average size and is what you would expect of a premier inn room, but the heat was intense, yes, the room was at full capacity but the windows didn't open, not even a crack, the air con was wholly inadequate and we had to ring down to reception to bring us a fan, which they did about half an hour later. We weren't offered bed sheets instead of the duvet and didn't think to ask. It was so hot, I had to sleep with no duvet at all and still I was too hot, I was awake half the night and considering venturing downstairs to get some air in my PJ's! After an unsettled night the next morning I was shattered and so was everyone else as I'd been disturbing them in my quest to be cool, we were given a full refund on the good night guarantee.","title":"“Room unbearably hot”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Middlesbrough, United Kingdom","cleanliness":5,"Helpful":0,"date":"17 August 2012","sleepQ":1,"rooms":3}
{"User":"RCalitri","Cities":0,"text":"Good mid-range hotel. Well appointed bedrooms, comfortable too. Staff were very courteous and helpful. Great hotel if you're looking for affordable comfort. Premier Inn are a very good, reliable chain and this hotel conformed to that.","title":"“Reliable hotel”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Exeter, United Kingdom","cleanliness":0,"Helpful":0,"date":"17 August 2012","sleepQ":0,"rooms":0}
{"User":"Sue K","Cities":0,"text":"Stayed in Coventry Premier Inn for two nights in August.. We were very pleased of the air conditioning which kept our room lovely and cool. Staff were polite and knowledgeable about the area. Easy to book online. Excellent location for Coventry city centre yet easy to find;right next to the Ring Road.","title":"“Enjoyable stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Liverpool, United Kingdom","cleanliness":5,"Helpful":0,"date":"13 August 2012","sleepQ":5,"rooms":5}
{"User":"echoromeohotel","Cities":0,"text":"Stayed for one night with my family. Room was clean and the bed was comfortable what more could you want for the price. Booked on line - really easy. Breakfast was ok but the delightful staff more than made up for the food to make it an enjoyable experience. We all came away happy.","title":"“Great value”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Horsham, United Kingdom","cleanliness":5,"Helpful":0,"date":"8 August 2012","sleepQ":5,"rooms":5}
{"User":"hsu118","Cities":0,"text":"Stayed for one night in March and will be going back in September for a week. Hotel is clean, modern, rates are very reasonable, so overall no complaints. I didn't sample the in-hotel food as there were many options within walking distance. It was a quick and cheap taxi ride from the train station. Would recommend for Coventry city centre.","title":"“No complaints”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Vancouver","cleanliness":0,"Helpful":0,"date":"28 July 2012","sleepQ":0,"rooms":0}
{"User":"trapper22","Cities":0,"text":"Stayed in Coventry last night and another pleasant stay at the Premier Inn. One thing you can guarantee is a good nights sleep every time. A good tip is to book in advance to get cheap rooms and also book the meal deal which gives you a 3 course meal in the evening with a free drink thrown in and then a hearty breakfast in the morning which by the way is all you can eat so the choice is yours. All the staff were very polite and helpful. I will definitely stay here again next time i`m in Coventry Room Tip: As with all Premier inns all rooms are of equal quality and it doesn`t really matter which floor you... See more room tips","title":"“Another very pleasant stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 July 2012","sleepQ":5,"rooms":4}
{"User":"AstirGrob","Cities":0,"text":"Located close to shops and restaurants this is a new hotel. There is a car park next door which is easy to access and it charges £5.00 per night if you are staying at the Premier Inn. Breakfast is cooked to order which is good but the food quality let it down a bit, poor bacon and sausages. There was a quite a selection of restaurants close by and I ate at the Turmeric Gold Indian which was recomended by the hotel and was quite good.","title":"“Good location &amp; value for money”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"London, United Kingdom","cleanliness":4,"Helpful":0,"date":"20 July 2012","sleepQ":3,"rooms":4}
{"User":"Rachel H","Cities":0,"text":"I have stayed here with my young family on sereral occasions, the breakfast is delicious, the rooms are a good size and very clean. Considering this is a city centre hotel there is no noise and we have always had a good nights sleep","title":"“Great food and clean hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Durham, United Kingdom","cleanliness":5,"Helpful":0,"date":"18 July 2012","sleepQ":5,"rooms":5}
{"User":"Eazeeee","Cities":0,"text":"This was my first time of staying at Premier Inn and I was very impressed, I must say. The double room is spacious and very clean. The bed was comfy as well as the choice of pillows, the lighting, position of the TV, air conditioning....wow! The bathroom was exquisite. I am very picky about my bathrooms and I was very comfortable here. I will definitely go back if I am in the city!","title":"“Excellent hotel!”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Bradford, United Kingdom","cleanliness":5,"Helpful":0,"date":"16 July 2012","sleepQ":5,"rooms":5}
{"User":"Donny K","Cities":0,"text":"Visited this place last week, the rooms where standard, however the service can be improved on.","title":"“Value for money”","hotelReviews":0,"location":3,"Reviews":0,"service":2,"value":3,"Location":"Coventry, United Kingdom","cleanliness":3,"Helpful":0,"date":"14 July 2012","sleepQ":0,"rooms":3}
{"User":"saf51","Cities":0,"text":"Stayed one night for a family wedding. I mistakenly thought check in time was 1pm (I'd arranged an early check in at a different PI last year-but hadn't done so before turning up at Coventry) Our room wasn't ready, but very helpful receptionist changed our booking to an available room, so we had plenty of time to change before the ceremony. The room was large, comfortable and clean. Very good breakfast - staff very friendly. We parked our car in the multi storey public car park next door and I was a little concerned, but worries were unfounded as car in same place and condition we left it in. ( there are banners up around the car park stating that is an \"award winning car park\" how do you get an award for being a car park-the mind boggles-perhaps it's extra safe?) If you stay in the PI, there is a saving on the car park charge. When checking out the receptionist signs the parking docket and you take it to the customer service desk next to the car park paying machines (don't put the ticket in the machine). We paid £7.50 for just under 24 hours-the manned desk accepts cash or credit/debit card- I asked the guy what was easier for him and he said card payment so that's what I used. Definitely would stay here again as good location, reasonable parking and great staff.","title":"“Does what it says on the tin!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Cheshire, England","cleanliness":4,"Helpful":0,"date":"13 July 2012","sleepQ":4,"rooms":4}
{"User":"jnjcoogee","Cities":0,"text":"We stayed 2 nights and really liked this Premier Inn, and loved Coventry too! Our room on the 6th floor was great, good sized room, clean, modern, with everything in good working order (except the internet...which we had some problems accessing). It is a bit of a walk from the rail station, but we did it both ways with our bags, and it isn't a problem if you know where you are going. Access to all the sights in Coventry was good too, all walking distance. We were happy to be checked in early, and to get a room on a high floor. It was quiet, air conditioned, with opening windows, which we also like. So we would definitely recommend the PI at Coventry (and Coventry too...it is a lovely city with lots to see) Room Tip: Rooms are quiet due to the good insulation, but high floors are good, as are rooms away from the lif... See more room tips","title":"“Great Premier Inn and Lovely Staff”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coogee, Australia","cleanliness":5,"Helpful":0,"date":"22 June 2012","sleepQ":5,"rooms":0}
{"User":"Richard S","Cities":0,"text":"First time for me at a PI. This hotel looks brand new but I'm told its a couple of years old (you wouldn't know!) The room, staff and food were all A1 - I would definately recommend this as somewhere to stay if you need to be in Coventry centre.","title":"“Great hotel,great location, great staff!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Barnsley, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 June 2012","sleepQ":5,"rooms":5}
{"User":"Chris1612","Cities":0,"text":"This is my first choice hotel when in Coventry. Staff are friendly and helpful and rooms are clean.I prefer the top floor to keep away from noise of traffic. The NCP car park is next door...best value is 5 day £15 or 7 night pass £20","title":"“Very good hotel in great location”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Carlisle Cumbria","cleanliness":5,"Helpful":0,"date":"19 June 2012","sleepQ":5,"rooms":5}
{"User":"LizMad48","Cities":0,"text":"Quite central hotel with very helpful and efficient staff. It was my first time in a Premier Inn and I was pleasantly surprised at the quality of the rooms and excellent service. I took advantage of the meal deal with for a hotel was more than reasonable. Well done Premier Inn. Nice to find a chain that is about customer service AND value for money.","title":"“Clean friendly and convenient.”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":5,"Location":"","cleanliness":4,"Helpful":0,"date":"18 June 2012","sleepQ":0,"rooms":4}
{"User":"Jmd67","Cities":0,"text":"Excellent stay yet again. The staff on reception are always so polite.","title":"“last minute booking”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Coventry, United Kingdom","cleanliness":4,"Helpful":0,"date":"11 June 2012","sleepQ":4,"rooms":4}
{"User":"DaveTheKettle","Cities":0,"text":"Booked a family room which was spotless and a good size and worked out to be excellent value because of the breakfast deal. We also decided to have an evening meal there which was pretty good too. The staff were fab especially Chris who was on in the evening who was super helpful, pointing out places to visit on a map. The breakfast was great, all you can eat with the hot selection freshly prepared. The only downside was paying for the parking which was an extra £7.50 but we knew this was the case in advance. Would stay there again.","title":"“Really good..”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"","cleanliness":0,"Helpful":0,"date":"8 June 2012","sleepQ":0,"rooms":0}
{"User":"Stephandally2","Cities":0,"text":"We were very impressed with the hotel overall. The room was very comfortable and clean and the staff were friendly. The only downside would be conectivity problems with wifi, which was a bit hit and miss at times and in different parts of the room. Also parking did work out slightly more expensive than we had anticipated at £7.50 per day.","title":"“WEEKEND STAY IN COVENTRY”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":5,"Location":"Liverpool, United Kingdom","cleanliness":5,"Helpful":0,"date":"7 June 2012","sleepQ":5,"rooms":5}
{"User":"michael r","Cities":0,"text":"If you are going to Coventry and need some where to convenient to stay then you can not beat the Premier Inn on Belgrade Plaza. Based in the city centre it is conveniently situated close to the shops bars and restraunts. Although it does not have its own car park the Multi storey is less than a minute walk from the hotel. The rooms as you come to expect from the Premier inn are clean and well appointed with a good sized comfortable bed. The staff are very friendly and can't do enough for you a credit to their brand. Next time am in Coventry and hoping to stay here again.","title":"“city centre stay”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Liverpool, United Kingdom","cleanliness":5,"Helpful":0,"date":"2 June 2012","sleepQ":4,"rooms":4}
{"User":"andersengas","Cities":0,"text":"I had a nice stay at the Premier Inn in Coventry. Nice staff, nice and clean rooms, a perfectly average breakfast, and less than mediocre wi-fi. Can definitively recommend this to others going to Coventry.","title":"“Nice, clean, safe and close to city centre”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Oslo, Norway","cleanliness":5,"Helpful":0,"date":"28 May 2012","sleepQ":0,"rooms":5}
{"User":"Peter H","Cities":0,"text":"We thought this Premier Inn was brand new, we found out it was about 3 years old. The security measures are very good, which is quite reassuring, the staff where very good in all departments. We had a nice meal in the restaurant, back up to our room and had the best shower in any hotel I've ever had, (they don't skimp on anything at these Premier Inn's), then it was just a stroll down to the Theatre to see the show, (everything just as it should be). Parking is in the multi storey car park, not far from the entrance to the Premier Inn, hear you are charged daily at a concessionary rate if you stay at the P.I. (we where charged £7.50 for about 22 hours stay, but you must take your ticket to the 24 hour security kiosk next to the payment machines to get your discount, but it's all very simple.","title":"“As always the room was perfect.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Studley","cleanliness":5,"Helpful":0,"date":"22 May 2012","sleepQ":5,"rooms":5}
{"User":"Matt S","Cities":0,"text":"We arrived very early on a Saturday morning and had asked for an early check-in - unfortunately they were full the night before, but we managed to get into a room by 11, after having a lovely breakfast. The rooms were nice, clean and modern. The lobby/restaraunt/bar is very small, but OK - I can imagine there being a cue for breakfast at busy times though. Easy walking distance to shops etc.","title":"“Nice and functional, helpful, friendly staff”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Dublin, Ireland","cleanliness":5,"Helpful":0,"date":"22 May 2012","sleepQ":5,"rooms":5}
{"User":"RickStephen","Cities":0,"text":"My first stay at a Premier Inn on from 2nd to 4th May 2012. I was impressed. Security was good. My room was functional, clean, bright and crisp as was the rest of the Hotel. The Staff, without exception, were friendly, helpful and professional. Good breakfast, fast service. The best value for money that I have had in many years. Would recommend this Premier Inn to any of my Friends and Colleagues.","title":"“Great value for money”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Wellington, New Zealand","cleanliness":5,"Helpful":0,"date":"19 May 2012","sleepQ":5,"rooms":5}
{"User":"Konr","Cities":0,"text":"Stayed here in April family group of 7, 3 rooms all well set up for our requested needs.......clean, tidy, well maintained. Friendly staff dealt with all requests with a helpful can do attitude. Hadn't experienced Premier group hotels before but if standard similar cross the properties will have no hesitation recommending or staying again. Top value","title":"“Friendly and efficient”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"","cleanliness":0,"Helpful":0,"date":"14 May 2012","sleepQ":0,"rooms":0}
{"User":"ginapeterb","Cities":0,"text":"This is a modern facility Premier Inn in the centre of Coventry, its attractive to stay in, the rooms are the usual high standard at Premier Inn, the restaurant is just to the right as you enter, on arrival staff were friendly, and their is heavy security access into the lift area, and to the floor you stay on, all by card access, what was difficult for me was finding how to get to the Premier inn, the postcode doesn't help, I drove around for 10 minutes and couldn't see how to get to it, (after having driven 5 hours down with stopovers to get to Coventry I was tired, then when you arrive at Reception there is no parking, just a drop off areas, people with families travelling by car will have to be aware of this, you can't stay there either, you have to go around and park in the adjacent multi story car park, which is a 5 minute walk away, and watch out, what you may miss if its on the Premier Inn website is the parking charge of which Premier Inn gives you 10 per cent off !!! BIG DEAL SO WHAT ! I was told an overnight charge would be about £5.00 with the Premier Inn stamping and validating the car parking ticket, NOT SO ! BEWARE...it cost me £18.00 to get out of the car park in the morning, and my protestations to reception fell on deaf ears, I was merely told there is a 10 per cent discount, and the guy in the multi story car park was watching \"According to Jim on daytime t.v) he also said he was new to the job and couldn't help ! The Restaurant on arrival in the evening was great, I took the meal deal for £22.00 had a lovely Steak and Chips, and in the morning, breakfast was great also, its an order service, not buffet like some associated restaurants with Premier Inn, I couldn't fault the hotel, but I wouldn't stay there again, because of the Parking issues, and having to pay £18.00 to leave your car overnight, it really should be free for Premier Inn overnight stayers, and because of that, I can't recommend this Premier Inn to anyone else, so no I wouldn't stay there again...sorry Premier Inn, you have a problem with Parking, and you know about it....sort it out.","title":"“Attractive Premier Inn - but let down by poor parking.”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":4,"Location":"London UK","cleanliness":5,"Helpful":0,"date":"13 May 2012","sleepQ":5,"rooms":5}
{"User":"martin6363","Cities":0,"text":"I stayed here recently with my son for a 2 night break and could not recommend it highly enough. We arrived early (9am) and asked could we leave our bags there to save carrying them around all day but instead they checked us into our room at this time. The room was spotless with good firm beds and a clean bathroom. The breakfast was excellent i had the continental all you can eat (£5.25) and this included a free breakfast for my son, we were able to take our time and have cereal, fruit, juice, toast and croissant along with costa coffee. very close to the centre of Coventry but still very quiet.","title":"“Excellent staff very friendly and clean”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Belfast, United Kingdom","cleanliness":4,"Helpful":0,"date":"11 May 2012","sleepQ":5,"rooms":5}
{"User":"jules p","Cities":0,"text":"Nice clean, modern rooms, really comfy beds and lovely bathrooms. Breakfast was a delight, staff very professional and welcoming. Not a 5 star experience but good value for money.","title":"“If its good enough for Lenny its good enough for me :)”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":4,"Location":"arrecife","cleanliness":5,"Helpful":0,"date":"10 May 2012","sleepQ":4,"rooms":4}
{"User":"614jane","Cities":0,"text":"Staff were excellent rooms clean food good ... Ideal placed for city center","title":"“Brilliant”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"8 May 2012","sleepQ":0,"rooms":5}
{"User":"ScottPearson","Cities":0,"text":"Stayed here with my son for a swimming competition and the hotel was everything you'd expect from a PI. Real plus points are location and facilities, bars, restaurants and cinema (very useful given poor weather) locally. restaurant in hotel has better than usual menu and breakfast was very good. Not so good points are the parking (can be expensive) and the one way system in Coventry (though not much the hotel can do about that). Would definitely recommend, especially if swimming at the Coventry Sports Centre which is within reasonable walking distance.. Room Tip: High floor keeps you away from inevitable city centre noise. See more room tips","title":"“Well placed for Coventry city centre”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Derbyshire","cleanliness":5,"Helpful":0,"date":"8 May 2012","sleepQ":4,"rooms":5}
{"User":"stourjohn","Cities":0,"text":"Not much to really, I have reported on this hotel before and after another visit it does not disappoint, lovely rooms, helpful staff and good location, what more could you ask for.","title":"“great”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"stourbridge england","cleanliness":5,"Helpful":0,"date":"7 May 2012","sleepQ":5,"rooms":5}
{"User":"LadySugarfoot","Cities":0,"text":"First time in a Premier Inn and not disappointed. We were seeing 2plays at the Belgrade Theatre and it was very convenient to stay the night. Double room, continental breakfast, £49 for two. Room very clean, had comfy bed, good tv, tea making facilities, excellent bathroom with a terrific shower. Breakfast was spot on. Most impressed with the friendly, competent, smiling staff. Will be using Premier Inns again for weekends and overnight stays.","title":"“Exactly as expected”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Birmingham, England","cleanliness":5,"Helpful":0,"date":"6 May 2012","sleepQ":5,"rooms":4}
{"User":"Boglarka_S","Cities":0,"text":"We spent 2 nights in this hotel and it was great! Their breakfest is perfect and the room was enough big and comfortable. The staff is very friendly and helpful! I recommend it without hesitation!","title":"“Very good hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Budapest, Hungary","cleanliness":5,"Helpful":0,"date":"5 May 2012","sleepQ":5,"rooms":5}
{"User":"susan e","Cities":0,"text":"middle of town centre. we found the rooms very nice and comfortable. nightlife was good and entertaining. we would recommend this hotel.","title":"“nice”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Niagara Falls, New York","cleanliness":5,"Helpful":0,"date":"26 April 2012","sleepQ":5,"rooms":4}
{"User":"WishboneUK","Cities":0,"text":"Overall very good. Would stay again. Staff were friendly an helpful, room was clean and in good condition. Excellent location and a reasonably priced carpark.","title":"“One of the better Premier Inns”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"26 April 2012","sleepQ":0,"rooms":4}
{"User":"Buzzwald","Cities":0,"text":"OK so this was our first time at a Premier Inn as generally we stay at the more expensive end of the market, but we thoroughly enjoyed our first experience at a Premier Inn and can recommend them to anyone. The check in procedure was fast and efficient and we were surprised at the level of security. The room was a little spartan but spotlessly clean and well laid out. Breakfast was excellent value for money. The WiFi at Premier Inn's works very well and was incredibly cheap. Now that we have experienced Premier Inn's we will stay at them some more. One thing about this chain is consistency and you know exactly what you are getting - it's all good.","title":"“No.1 value for money.”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":5,"Location":"Melbourne, Australia","cleanliness":5,"Helpful":0,"date":"21 April 2012","sleepQ":5,"rooms":4}
{"User":"seren72_12","Cities":0,"text":"Stayed one night to attend an Open Day at Coventry University. The staff we spoke to were all very friendly and welcoming. Room was great, spotlessly clean and one of the most comfortable beds I've ever slept in. Great value for money and fantastic location for the university and city centre. Would definitely stay here again.","title":"“Would definitely stay again”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Aberystwyth, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 April 2012","sleepQ":4,"rooms":5}
{"User":"cris118","Cities":0,"text":"stayed one night on a business trip staff very helpful food good rooms very clean. got 3 more business trips in coventry this year will stay again.","title":"“perfect”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Mansfield","cleanliness":5,"Helpful":0,"date":"17 April 2012","sleepQ":5,"rooms":4}
{"User":"Oldbrookie","Cities":0,"text":"We booked this Premier Inn for an annual sporting event in Coventry, on the recommendation of others who've stayed there in previous years. No dedicated parking but the Belgrade Plaza multi storey is literally next to the hotel which is easy to find from the ring road. We arrived around 11.30am and even though check-in time wasn't until 2pm, the receptionist let all of us (we were part of a group of 10) leave our luggage in a secure holding area. We returned later in the afternoon and checked in which was smooth, friendly and efficient - no quibbles whatsoever when we asked for two key cards for our room. We had a room on the 4th floor and despite it directly overlooking the main road, we couldn't hear any traffic noise at all. We ordered a sandwich in the bar before heading out early evening, which was excellent value for the money and practically a main meal in itself! Group of us returned at around 11.30 to gather in the hotel bar - told that although they had stopped serving food, we were more than welcome to order in a pizza, we were even given the phone number to order it from! Room was very comfortable indeed, lovely comfy bed more than big enough for two - only negative would be that the pillows were all far too soft and it was difficult to get comfortable with them, but that really is a very small negative in amongst far more positives! Small, fast quiet kettle for tea and coffee, new, flatscreen TV with Freeview, plenty of space for two people to stay in relative comfort. No noise whatsoever from adjoining rooms or from the corridors Checkout the following morning was again fast, friendly and efficient and the receptionist reminded us to take our car park ticket to them when we eventually left the multi storey so they could validate it which would give us 10% off the total. Hotel is in a great location, just off the ring road, right next to the multi storey as well as Pizza Express, Bella Italia and the Belgrade Theatre (but we didn't hear any associated noise from any of those), and literally only five minutes from the centre of Coventry. Wouldn't hesitate to stay here again or to recommend it.","title":"“Excellent value for money”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Bucks","cleanliness":5,"Helpful":0,"date":"16 April 2012","sleepQ":4,"rooms":5}
{"User":"Dave j","Cities":0,"text":"This is the first inn I have stayed were car parking was not provided this meant another £9 on my bill. The restaurant is far too small for the size of the hotel and the food was poor. My son and I ordered a stake, well done, and they both came back as tough as old boots! The staff offered a replacement but to be honest I didn’t want to take the risk and so I paid and left to find another restaurant. I would use a Premier Inn again but not this one. Room Tip: Get one somewher else - But if you had to choose a room high up so as not to hear the traffic See more room tips","title":"“Dining and Car Parking”","hotelReviews":0,"location":3,"Reviews":0,"service":3,"value":3,"Location":"Liverpool, United Kingdom","cleanliness":3,"Helpful":0,"date":"16 April 2012","sleepQ":3,"rooms":3}
{"User":"DWhiteBasingstoke","Cities":0,"text":"Just stayed here for one night whilst in Coventry to attend the EPL Play Off FInals at the Skydome. There was a bit of a wait to check in, but that was due to other ice hockey fans checking in before the game started at 3pm - same as us!! The room and bathroom were very clean, there was plenty of storage space if you needed it and the bed was extremely comfortable, I like a firm bed and having a choice of pillow is a nice touch. The hotel was fully booked, but we did not hear any noise from other hotel users, from either the corridor or adjacent bedrooms. One particular thing I have to mention: this is the first hotel I have ever stayed in where the hairdryer, mirror, lights (with 'natural daylight' tubes) and a spare socket were all together in the same part of the room. The public car park was a couple of minutes walk away and the hotel offered a discount - you just had to get the ticket validated. This did mean going back to the hotel hours after we'd checked out, but that was not a problem for us.","title":"“Perfect For Our Needs”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Basingstoke","cleanliness":5,"Helpful":0,"date":"16 April 2012","sleepQ":4,"rooms":4}
{"User":"Deborah L","Cities":0,"text":"I have stayed in a lot of Premier Inns over the years but have to say this is the first time I've been disappointed with my stay. Not only was it difficult to find using the post code......well we could see it but because of the road system it was difficult to get to. We finally got there and wondered where to park so I asked the receptionist only to be told we had to use the multi storey carpark and pay for the privelidge oh but they offered a 10% discount WOW!! This trip cost me £140 to stay in the hotel but then I had an additional cost of £18 for parking for less than 48 hours. Will never stay here again unless they change their policy and offer free parking or at least a substatial discount.","title":"“Disappointing car parking facilities”","hotelReviews":0,"location":1,"Reviews":0,"service":3,"value":3,"Location":"Lincoln","cleanliness":4,"Helpful":0,"date":"16 April 2012","sleepQ":4,"rooms":4}
{"User":"Helen W","Cities":0,"text":"This Premier Inn is really close to city centre shopping, buses, tourist attractions. Room as you would expect from a Premier Inn, staff really friendly and helpful. Only one niggle, we were close to the door to the lifts and the first night there was a lot of door banging which woke me briefly. Second night no noise so happy. Would ask for a room further along the corridor should we go back.","title":"“Good location for a couple of nights”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"15 April 2012","sleepQ":4,"rooms":5}
{"User":"MrsKlein","Cities":0,"text":"The hotel is right by Belgrade Theatre and a 15 min walk from station. It is obviously no frills but what is there is good. I paid a bit over £30 for a good size double with day bed, choice of pillows, freeview, bath with shower. Bed is a bit hard for my taste but not uncomfortable so got the guaranteed good nigjt's sleep. No little pots of toiletries, but basic supply in dispensers. Breakfast was separate and Costa coffee there. All was really clean. Fantastic value.","title":"“Does all the basics really well”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"London","cleanliness":5,"Helpful":0,"date":"13 April 2012","sleepQ":0,"rooms":4}
{"User":"1999cat1999","Cities":0,"text":"I am dissapointed with this Hotel I aspecting it being apart of a chain and all, the quality would be worth five star. But obviously not. Several complaints : a) The noise from the road from either side of the hotel is extremey loud, and is difficult for you to get to sleep if your a heavy sleeper. b) The carpark is about 500yds away so if late at night you have got to walk. c) Illuminous lights flash in the car park and you can see it through your window. d) In your room you can hear next door, and that wasn't very pleasant. e) The staff leave the front desk around six so any questions after that you have to seek out staff from the kitchen. f) Kitchen staff are very rude and not very welcoming. g) Food stops serving after nine. So if you come off holiday and are starving then the local chippy is your answer. And then you are not aloud to take it to your room. h) Musty smells. Well thats all my complaints, so before you book. DONT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Room Tip: Find another HOTEL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Simples See more room tips","title":"“So much road noise!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!”","hotelReviews":0,"location":2,"Reviews":0,"service":1,"value":2,"Location":"Luton, United Kingdom","cleanliness":3,"Helpful":0,"date":"12 April 2012","sleepQ":1,"rooms":4}
{"User":"Glynne_and_Ann","Cities":0,"text":"Hotel was easy to find but had some diffculty getting parked. They recommend using the public multi-story close to the hotel but coming into town, once you have found the hotel you have passed the cark park already and although you can see it the entrrance can be difficult to find.. Parking is discounted by the hotel but there was plenty of space. Enough of any negatives. The reception gave us a lot of help on the phone to find the parking and when we arrived checked us in promptly and offered good advice on alternative places to eat that were still open on a Sunday evening. The room was amongst the best Premier Inn rooms I've stayed in, which makes it a really comfortable. Premier have \"upped their game\" considerably in recent years (I use them about once a month). We wandered into the city for a couple of hours (which was quiet being a Sunday) but there was still a choice of places to eat. It's difficult to find an independant, or one of the affordable up market, Hotels who offer better than Premier Inn.. I had to leave too early to catch breakfast but the bar/restaurent area looked really nice. All in all a very nice stop over. Again it confirms that they are no longer competig with Travel Lodge.. Premier Inn is comparitively in the Premier leage compared with my recent experiences of Trevel Lodge struggling in Diviosn 3. Price was OK for a last minute booking. Room Tip: If the city is busy probably better having a high room to me out of any traffic and people noise. See more room tips","title":"“Great place for a stop over.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Salisbury","cleanliness":5,"Helpful":0,"date":"9 April 2012","sleepQ":5,"rooms":5}
{"User":"yellowstorm88","Cities":0,"text":"Arrived there Saturday around midday. We knew we were early and expected to check in later but thought we'd drop off our bags but to our surprise our room was ready for us right there and then. The receptionist was a pleasure to us, really friendly. Also the guy who checked us out was lovely. The room was your typical premier inn room which is never a disappointment. Everything was clean too. The hotel is about a 10 minute walk from the train station and easily found. A perfect place next to the main shopping centre. There's a nice Wetherspoons (the spon gate) 5 minute walk away with a nice club right next to it if you want a decent night out too.","title":"“Loved it the minute we got there.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Portsmouth, United Kingdom","cleanliness":5,"Helpful":0,"date":"8 April 2012","sleepQ":5,"rooms":5}
{"User":"Janet_Sarah","Cities":0,"text":"Booked this hotel online several weeks ago as we wanted to visit (specifically) the cathedrals. The hotel is a typical Premier Inn - and that's what I like about them - you know what you are going to get. Our room was clean and comfortable - we had a room near the top of the hotel so noise from the outside was minimal. The staff were friendly and helpful from the moment we got there (we arrived early and asked to leave our cases, but were allocated a room straight away) to the moment we left. The hotel is ideally situated for Coventry centre - there is a car park right next door which is ultra-reasonable price-wise and you get an extra 10% off the prices if you get your ticket stamped by the hotel. We left on a Sunday and, wanting to go to church, were able to leave our luggage to be looked after once we'd checked out so we could go back and collect it afterwards rather than having to take it with us. If the woman on reception does win the lottery, I'd like her to remember who said the prayer for her!! :D","title":"“Everything's premier but the price!!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Bath, United Kingdom","cleanliness":5,"Helpful":0,"date":"1 April 2012","sleepQ":4,"rooms":4}
{"User":"12karen12","Cities":0,"text":"Came here becuase the guest house we booked was BAD. You get what you expect from the Premier Inn but added bonus of really friendly staff.","title":"“Refuge from bad experience”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Bath, England, United Kingdom","cleanliness":4,"Helpful":0,"date":"25 March 2012","sleepQ":4,"rooms":4}
{"User":"Mikben","Cities":0,"text":"The best way to find the hotel is by firstly parking in the Belgrade Paza multi-storey car park on the inner ring road. A short walk across the concourse leads to the main entrance of the hotel. Very warm welcome from the receptionist and all necessary information given clearly. Went for meal deal, which at £22.00 including glass of wine with a three course dinner as well as providing a full English breakfast is excellent value as the food was all well prepared - apart from breakfast which was plated up (not buffet) and had to be returned for heating-up. Room Tip: Room was on the top floor and was exceedingly quiet. See more room tips","title":"“Saturday night journey breaker”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Torquay, United Kingdom","cleanliness":4,"Helpful":0,"date":"23 March 2012","sleepQ":4,"rooms":4}
{"User":"Carnage300","Cities":0,"text":"Another comfortable stay at a premier Inn, clean room, excellent helpful staff, only downside after coming back late & wanting a liquer drink at the bar they had no baileys, one shot only of Ameretto !! come on get stoked up !!!","title":"“comfortable stay”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":4,"Location":"Kent","cleanliness":5,"Helpful":0,"date":"18 March 2012","sleepQ":4,"rooms":4}
{"User":"pinkellie67","Cities":0,"text":"In the City Centre - next to a secure car park where you get 10% off your ticket when validated at the hotel. Only down side was the breakfast - we have stayed an few other Premier Inn but this is the first time you have to order your breakfast instead of being a buffet style for the cooked breakfast part - would have like a bit more eg mushroom and eggs Beds very comfortable","title":"“Romantic Break”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Coventry, United Kingdom","cleanliness":4,"Helpful":0,"date":"12 March 2012","sleepQ":5,"rooms":5}
{"User":"AshBush","Cities":0,"text":"I stayed alone in the City Centre Coventry Premier in on a business trip recently. The location is a bit confusing as it sits on a large ring road and the entrance is effectively at the back of the building (you could be forgiven for thinking you were going down a dead end). The reception is a bit tired and the bar was small (large TV showing football) but you could have a table in the restaurant (semi-partitioned from the bar). The food was standard pub fare. There is a Pizza Express next door, which I would probably have used if not alone. Door security from the reception to the lifts is card key which was good, and then again from the lift lobby to the corridor where rooms are located. It makes you wonder if there is a local problem that makes this necessary. Friendly staff, rooms are standard Premier Inn which is reliable, and a reasonable rate.","title":"“Standard Premier Inn - confusing location”","hotelReviews":0,"location":2,"Reviews":0,"service":4,"value":4,"Location":"London, United Kingdom","cleanliness":4,"Helpful":0,"date":"12 March 2012","sleepQ":4,"rooms":4}
{"User":"Mimsu","Cities":0,"text":"Really good value for your money! The entrance to the hotel seemed a little low-profile. The young reception guy seemed to be a little bit lost, and I was surprised that I had to pay my stay beforehand, right when I was checking in. But my double room was really big, with a nice sofa, a reasonable sized writing desk, wardrobe and plenty of room for the baggage. The bed was really comfortable (definitely not one of these unbelievably hard beds you find in so many hotels in the UK!). The bathroom was nice and clean aswell. The shower pressure and water temperature weren't great, but that's not new in the UK. They also didn't offer any free products in the bathroom, but I had my own shampoo anyway. All in all, really nice, clean and comfortable at this price! I would even consider staying here when visiting Birmingham, London or other expensive cities - you can travel quickly by train!","title":"“Not luxury but nice stay with a reasonable price.”","hotelReviews":0,"location":4,"Reviews":0,"service":2,"value":4,"Location":"Helsinki, Finland","cleanliness":4,"Helpful":0,"date":"11 March 2012","sleepQ":4,"rooms":4}
{"User":"PYT13","Cities":0,"text":"Amazing value right in the city centre. Warm welcome, clean room, good food (hot and quick). Friendly bar. Staff couldn't do enough, including calling a late night taxi.one tip though of you are arriving by car. There is only a dropping off circle by the hotel reception. You need to park in the Belgrade Plaza carpark ( go off at Jct 9 of the ring road and follow the signs).","title":"“Felt like staying with friends”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Pompano Beach, Florida","cleanliness":4,"Helpful":0,"date":"7 March 2012","sleepQ":0,"rooms":4}
{"User":"cosmicgirl1978","Cities":0,"text":"We stayed for one night, and it proved to be a good hotel choice. The car park was very close, as was a Pizza Express that we went to for dinner. It was easy to walk around the centre of Coventry from the hotel. Service was excellent and the hotel felt modern and secure. The room was large, clean and had essentials such as a TV and a kettle with tea/coffee etc. The room was very quiet, despite being near the ring road. No noise from neighbouring rooms! I presume like other Premier Inns, it had a fairly sterile and characterless atmosphere, but it was very convenient and competitively priced, so great for one night's stay in the city.","title":"“A good choice for the city centre”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"1 March 2012","sleepQ":5,"rooms":5}
{"User":"SurreySingleMum","Cities":0,"text":"We booked well in advance and managed to get one of the £29 rooms. The hotel is very modern and in a good central location with a large multi storey car park close by. The room was up to the normal high Premier Inn standards. Too late for lunch so we ate in the Pizza Express next door which was fine On the day we arrived the snow did too! The staff still managed to find us a taxi to take us to the NEC Birmingham. Terrible journey back but the bar was open late so we were able to relax with a couple of drinks before bed. Would not hesitate to recommend.","title":"“Bagged a Bargain!”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Surrey","cleanliness":4,"Helpful":0,"date":"29 February 2012","sleepQ":4,"rooms":4}
{"User":"Youel","Cities":0,"text":"We stayed here from Friday 24th to Sunday 26th February with family. Had a really good stay Rooms were very good, warm and clean. Could not fault any of the staff. From reception to housemaids and the girls in the restaurant were so friendly they could not do enough for you. We went to the Theatre which was just a two minute walk from Hotel.","title":"“Great Weekend”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Sheffield, United Kingdom","cleanliness":5,"Helpful":0,"date":"29 February 2012","sleepQ":4,"rooms":4}
{"User":"keskese","Cities":0,"text":"I stayed there for 5 nights in Sep 2011. The staff was great, very helpful and pleasant. As for rooms, they were always clean. If I'm ever back in Coventry, I will be staying in this hotel again. My recommendation, definitely.","title":"“Worth the money”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Novi Sad, Serbia","cleanliness":5,"Helpful":0,"date":"29 February 2012","sleepQ":5,"rooms":5}
{"User":"Carol899","Cities":0,"text":"Stayed at this Premier Inn for 3 nights 20th till 23rd Feb 2012 and will definitely be back again in the future. Excellent service from all the staff but would like to express a huge thank you to Vicky and Ashley who worked nights on the Mon and Tues evening, for making our stay a memorable one. They went out there way to help and were very friendly and professional. Once again thank you Carol and Rick Coles","title":"“Excellent Quality”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Banbury, Oxfordshire, United Kingdom","cleanliness":5,"Helpful":0,"date":"24 February 2012","sleepQ":5,"rooms":0}
{"User":"TracyMitchell0812","Cities":0,"text":"I booked three rooms for myself and friends - the twin room wasn't actually a twin but a double with the settee bed made up - which is fine for a child but not an adult. When asked to move to a proper two room was told the hotel was fully booked One friend had the whirring noise of a fan continually all night long. Room Tip: If you are in a group ask for rooms close to each other and specify adjoining rooms if you need them See more room tips","title":"“Don't get what you ask for”","hotelReviews":0,"location":4,"Reviews":0,"service":2,"value":3,"Location":"Rugby, United Kingdom","cleanliness":3,"Helpful":0,"date":"24 February 2012","sleepQ":1,"rooms":3}
{"User":"AlpineTravellerKent","Cities":0,"text":"I've never been let down by a Premier Inn. They may all look the same but they're always clean, comfy beds, plenty of hot water, helpful and friendly staff. For a night or two away from home where you just need to know you'll get a good nights sleep and a good breakfast I'd always recoomend Premier Inn. Coventry Centre is typical of the brand. Parking is in a multi-storey close by and there are restaurants within walking distance although the hotel food looked OK too. Room Tip: Ask for a room away from the ring-road end of the building See more room tips","title":"“Does what it says on the tin”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Kent","cleanliness":5,"Helpful":0,"date":"21 February 2012","sleepQ":5,"rooms":4}
{"User":"vcan","Cities":0,"text":"this is just a room to sleep in nothing else rooms are small if you like lookig at 4 walls and everything in between staff are really helpful and will go out of their way to help breakfast is another thing the dining area is small just picture 60 people with one self service coffee machine that is very slow it makes 1 cup at a time continental breakfast consists of waiting forever to get a cup of coffee and a cerial thats it nothing more full breakfast consists of bacon might be cooked of might not eggs cooked as you like and the sausages well now they looked ok and that was it try cutting one thats whare the fun began because try as we did we couldnt cut them i think they were made from recycled leather wifi quality is poor and costs 3 pounds a day for a hotel thats supposed to cater for business people ?? Room Tip: choose another hotel See more room tips","title":"“you get what you pay for”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":3,"Location":"ireland","cleanliness":4,"Helpful":0,"date":"11 February 2012","sleepQ":3,"rooms":2}
{"User":"Mick B","Cities":0,"text":"Hotel was modern and clean. All the staff were friendly and professional. Good location for the town.","title":"“Good staff.”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Sheffield, England, United Kingdom","cleanliness":5,"Helpful":0,"date":"10 February 2012","sleepQ":4,"rooms":4}
{"User":"LamcsMr-b","Cities":0,"text":"Premier Inn- generally you know what you are getting really,at this one the rooms are clean and very comfortable, there is a small lounge / bar area which is adequate and stays open until 1am, a public pay car park close by and you get a small reduction as a resident. The breakfast was surprisingly quite good, not a wide choice but the food was good and cooked fresh. The big thing here is the staff were excellent, very friendly and professional and also kept everywhere clean and tidy- often rare these days- the best staff i have come across at Premier Inns.","title":"“You know what you are getting - but staff here were excellent.”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":3,"Location":"Lancs","cleanliness":5,"Helpful":0,"date":"9 February 2012","sleepQ":5,"rooms":4}
{"User":"seattle29","Cities":0,"text":"I stayed one night for business, and the hotel had everything I needed. Internet access was fast and the buffet breakfast was also nice. The hotel is in a good location for the city centre and transportation is easy. I would stay again for sure.","title":"“Nice stay here”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"London, United Kingdom","cleanliness":0,"Helpful":0,"date":"9 February 2012","sleepQ":0,"rooms":0}
{"User":"Chris1612","Cities":0,"text":"A good new hotel with friendly staff. Enjoyed my stay. Parking is next door in a public multi storey. If you are here for a few nights there are alternative good restaurants near by.","title":"“Good location and very good staff”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Carlisle Cumbria","cleanliness":4,"Helpful":0,"date":"9 February 2012","sleepQ":4,"rooms":4}
{"User":"adamy12","Cities":0,"text":"a new hotel very clean and staff were brilliant very helpful food was good with lots of choice","title":"“premier inn coventry”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":5,"Location":"london","cleanliness":5,"Helpful":0,"date":"8 February 2012","sleepQ":3,"rooms":4}
{"User":"yellowhippo","Cities":0,"text":"Have stayed here once or twice and have always had nice quiet stays. The beds are comfortable and room is value for money for the price. The bar/restaurant all seem to merge into one and it is quite small but there are other restaurants close by. I haven't had an evening meal there but breakfast has always been excellent, with the hot food cooked to order. Staff have always been very polite.","title":"“Good Value for Money”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Midlands","cleanliness":5,"Helpful":0,"date":"4 February 2012","sleepQ":4,"rooms":4}
{"User":"Peregrine88","Cities":0,"text":"The best thing about this hotel were the fire doors along the corridors which did not bang! They were cleverly held open by magnets which, my husband informs me, will release in the event of a fire so that the doors close. The rest of the time they dramatically cut down on the noise and make access easier. We enjoyed our 2 night stay and found the Staff to be friendly and helpful. We weren't too keen on the restaurant/bar which was very small and somehow uninviting. Overall though we got value for money and would recommend this hotel. Room Tip: High floor away from main road See more room tips","title":"“Would Recommend”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Newcastle-under-Lyme, United Kingdom","cleanliness":4,"Helpful":0,"date":"10 January 2012","sleepQ":4,"rooms":4}
{"User":"Skyblue12390","Cities":0,"text":"We paid £23 for the pleasure of the stay, and for that We were not expecting much! But, how wrong we were! Everything was much better than expected! Late check out time, everything you could want and more in the room, extremely clean and comfortable bed and a quiet and peaceful nights sleep! Would and will definitely recommend!","title":"“Excellent for the price”","hotelReviews":0,"location":5,"Reviews":0,"service":3,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"7 January 2012","sleepQ":0,"rooms":5}
{"User":"Linda G","Cities":0,"text":"This hotel is where I lived for two weeks after relocating to Coventry. The room was spacious and very clean. One night I did hear some loud/drunk people in the hallway who had stumbled on their way to their room & dropped some of their belongings. I called the front desk & someone came upstairs within minutes. When I struggled with getting the heat to work right, someone came up immediately & reset something to make it work right. To be honest, I was a bit sad having left my family behind for the first time in my life. They were friendly, and made me feel like I'd known them my whole life. They helped me find directions to all the places I needed to go, they advised me on cheapest ways to travel, where to shop, where to look for a rental, the list goes on and on. Every single employee I met there deserves a pat on the back for how well they treat the guests who pass through their doors.","title":"“Home away from home”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry, United Kingdom","cleanliness":5,"Helpful":0,"date":"28 December 2011","sleepQ":5,"rooms":5}
{"User":"WillowTreez","Cities":0,"text":"I stayed here for a night after breaking up with my ex partner. It is what it is a standard box room, clean,tidy and well presented. The receptionist was polite enough but you felt that once they had your money that was it. Prices dont include Breakfast (an extra £8.95) ir Wi-Fi £10 for 24hours access! or £5 for an hour how can anyone charge this for what is pretty much an everyday essential now adays Would I go back? If the need arose yes but I can think of better places to stay for the money.","title":"“You get what you pay for”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":3,"Location":"Coventry, United Kingdom","cleanliness":4,"Helpful":0,"date":"18 December 2011","sleepQ":4,"rooms":4}
{"User":"Ari D","Cities":0,"text":"Rooms... exactly as presented on their website. But they didn't mention the stench of Formaldehyde from the bathrooms. Presents a feeling of staying at some sort of a poorly subsidized national health institution. Restaurant was great for hotel guests. Excellent selection of food and great prices. Service was excellent. Very well trained staff. Excellent location, if you want to stay in the town center. Summary - I would come and stay again, if they changed the bathroom disinfectant (to what all other hotels use). Since i don't have any motivation to be in the town center, I would try and find another hotel that doesn't leave a clinical impression.","title":"“Great.... on paper!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Graz","cleanliness":4,"Helpful":0,"date":"11 December 2011","sleepQ":4,"rooms":2}
{"User":"Ellwin22","Cities":0,"text":"Very clean room, spacious, comfy bed and great shower. Stayed new years eve 2010. My partner booked it in advance when there was a deal on so it was very good value for money and included breakfast. Very nice breakfast and tastey hot chocolates! Close to town hence staying here after a night out. There might be an assumption that it isnt a nice place to stay, with it being in the city centre however i was pleasantly surprised at how lovely it was. I would stay here again.","title":"“Great”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Birmingham, United Kingdom","cleanliness":5,"Helpful":0,"date":"5 December 2011","sleepQ":5,"rooms":5}
{"User":"Duncan L","Cities":0,"text":"I've stayed here a few times now and am there again this coming week. Coventry is not blessed with the world's best hotels so this has no great competition. Even so, it's good. Nicely situated next to the theatre and, best of all, a very short walk from the Town Wall Tavern. The hotel is clean, quiet and comfortable. Staff are always pleasent and helpful. You may not select this for a romantic weekend away but for business trips it presses all the right buttons I had not stayed in a Premier Inn before this but am now quite a fan","title":"“It does what it says on the tin”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Canterbury, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 November 2011","sleepQ":4,"rooms":5}
{"User":"Gordon W","Cities":0,"text":"I don't think I'd stayed in a Premier Inn before, so I was a bit sceptical when a friend made a block booking for our choir when we were singing at the Cathedral one weekend. However, this hotel has convenient location, very clean and quiet rooms, and made for a very pleasant stay. What really brought it above the norm was the welcome from the staff, and the excellent breakfast. Compared to much more expensive hotels, the food was much better quality and far better prepared, an the staff were friendly and helpful at reception, at breakfast, and in the bar at night. I would definitely stay here again. They could do with more than two lifts in a hotel this size, however.","title":"“Very pleasant stay with brilliant staff”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Oxford","cleanliness":5,"Helpful":0,"date":"25 November 2011","sleepQ":5,"rooms":4}
{"User":"MikeDundee","Cities":9,"text":"Only stayed in 1 Premier Inn before and again another good stay. Room and shower were clean and spacious. Right in centre of town, so you have to pay to park in multi storey opposite which is not cheap, albeit they give you 10% off if you take your ticket to reception before leaving (cost £16 from Sunday afternoon till Tuesday morning). Friendly staff. Would recommend.","title":"“No complaints”","hotelReviews":8,"location":4,"Reviews":15,"service":5,"value":4,"Location":"Coventry, West Midlands","cleanliness":4,"Helpful":10,"date":"21 November 2011","sleepQ":4,"rooms":4}
{"User":"Lorse","Cities":0,"text":"Stayed here on business. Nice hotel 2 mins walk from the centre of Coventry. Nice bar area, clean rooms, safe and secure. No car park but has a multi storey next to it which cost me about £7.50 for the night. If you ask at check out, they give you a 10% discount on the parking.","title":"“Nice Hotel, Does the Job”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":4,"Location":"Cardiff","cleanliness":4,"Helpful":0,"date":"17 November 2011","sleepQ":4,"rooms":4}
{"User":"Dublingirl52","Cities":0,"text":"We stayed here for 3 nights and cannot fault this excellent hotel. Check-in was done speedily and courteously by the friendly staff on the reception desk. Our room was clean and quiet. The beds were warm and comfortable. We enjoyed our breakfasts, especially the fresh fruit salad. Cooked food is freshly-prepared for each guest. We also had an evening meal in the hotel and this too was good value. Portions were on the large side.Again, the dining-room staff were friendly and attentive. We had a problem with our heating one evening. This was swiftly dealt with and we were offered another room opposite and helped with the move. The hotel is a short walk from the shopping-centre, the university and the cathedral. We especially liked our visit to the Transport Museum which is about a 3 minute walk away from the hotel. However, the train station is quite a long walk, especially if you have heavy luggage. Having said that, there are plenty of taxis at the train station and the hotel ordered a taxi for us to take us back which arrived within a few minutes. It costs about £4 each way to/from the station. What impressed us most throughout was the friendliness and helpfulness of all the staff.","title":"“Excellent value - superb in every way”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"South-East England","cleanliness":5,"Helpful":0,"date":"24 October 2011","sleepQ":4,"rooms":5}
{"User":"stu21_11","Cities":0,"text":"everytime i stay here, i walk away amazed, i live in hotels up and down the country, from premier inn's to hilton hotels, the staff at premier inn coventry are truly the best in the business in my eyes, breakfast on sunday morning was very busy, but the staff here are not fazed by this, the manager on shift offered us a coffee whilst we waited for a table to be come free, u dont get that in expensive hotels... bedrooms spotless, great nights sleep, breakfast all you eat, staff superb, what more can you ask for....","title":"“5* service 2* price”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"Bristol, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 October 2011","sleepQ":5,"rooms":4}
{"User":"Bat_Sime","Cities":0,"text":"This is a great hotel to stay at. I have stayed here 4 times before, it is very new and located in the City Centre so I can get to the shops and resteraunts easily. There is a Pizza Express and Bella Italia opposite the hotel if you don't want to eat in-house. There is also a Costa Coffee inside the hotel. Also if you book in advance at the Premier Inn website you can get good deals to stay and for the money its great value. The rooms are of a good size and very clean, tv, freeview, a desk, chair its all there. Also very secure as you need your card to access the lifts. Staff are very helpful and give good service. Room Tip: Don't stay in the room opposite the lifts ! See more room tips","title":"“Great value for money, can't wait to return”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"17 October 2011","sleepQ":5,"rooms":5}
{"User":"nfero","Cities":0,"text":"was in a great location to get to places in town on foot. was there for one night was able to walk to great place to eat from hotel. hotel was clean and no noise although bang in the middle of town. i booked a wake up call but i did not happen....staff more than mad up for it by packing me some food to eat as i was in a hurry to go to a meeting. have great team at the desk they love their work and made me feel welcome. i intend to stay there again. my pals booked elsewhere but i know i made the best choice. well done! Room Tip: cant think of any. See more room tips","title":"“nice people”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"London, United Kingdom","cleanliness":5,"Helpful":0,"date":"11 October 2011","sleepQ":5,"rooms":5}
{"User":"sc0ttietraveller","Cities":0,"text":"Stayed here for one night on my way to a conference at Warwick University. The Hotel is reasonably conveniently placed for the railway station, less than 1/2 mile walk and is beside a multi storey car park although not sure about parking charges. (I think a 10% discount for customers) . The rooms are Premier Inn rooms, fairly basic but comfortable and air conditioned and good value for money at the low end of the charging scale (paid £29 + breakfast for a night). The bar/restaurant is again up to Premier Inn standard with a good cooked breakfast available from 07:30 at weekends which was helpful. The surrounding area is fairly dead but we found a small pub \"The Gatehouse Tavern\" close by which did a good selection of beers","title":"“A Good example of a Premier Inn”","hotelReviews":0,"location":3,"Reviews":0,"service":4,"value":5,"Location":"Edinburgh, United Kingdom","cleanliness":4,"Helpful":0,"date":"10 October 2011","sleepQ":4,"rooms":4}
{"User":"rybblevalley","Cities":0,"text":"The first thing to go wrong happened even before I got to the hotel. I phoned the reception and asked them to give me the postcode of the car park (which I knew wasn't actually part of the hotel). I duly tapped in the postcode I was given into the sat nav and parked where it led me to - New Union Street. Not knowing Coventry, I got out of the car, looked around, was a little surprised not to see any Premier Inn around. I walked for a couple of minutes and asked someone for directions. When I was told it was at the other end of the city centre, I wasn't happy. It was a 30 minute walk with heavy bags in 30 degree late September temperatures. In the morning, I needed to be off early for a meeting, so I got to breakfast for 6.30 and put in my order (I had to chase the waitress - she wasn't that interested in taking orders). I needed to be finishing for 6.50 to get my train. When it got to 6.45 and I still didn't have my breakfast, I politely asked the waitress where my food might be. She then told me, \"Oh, yeah. We're having problems with the oven this morning.\" OK. Were you planning on mentioning that there might be a delay? No word of apology, just a look of contempt on her face. The room itself - as you'd expect, boring and bland. At least the bed was comfortable but the sheets didn't smell fresh and there was a mouldy smell in the bathroom from an old shower curtain. Never again.","title":"“Everything's premier except the price. Oh, and the staff.”","hotelReviews":0,"location":2,"Reviews":0,"service":1,"value":3,"Location":"Yorkshire, England","cleanliness":3,"Helpful":0,"date":"29 September 2011","sleepQ":4,"rooms":2}
{"User":"coolgeri","Cities":0,"text":"My husband, daughter and I stayed at this hotel for one night, having taken our son up to Coventry University. The hotel is ideally situated in the City centre, within walking distance to the cathedral, shopping centres and the University. We had booked a family room. This turned out to be a very clean, nicely furnished room. The beds were extremely comfortable and we all had a good night's sleep. We noticed that the hotel has a policy, that if anyone doesn't have a comfortable night's sleep they don't have to pay. This is a very pleasant touch, although it would be difficult not to sleep well due to the fault of the hotel. In the evening we sat in the bar, and the young lady serving behind the bar made us feel very welcome indeed. I don't know her name but she said she had been a student at Manchester University, and was very helpful and knowledgeable. The bar and the restaurant are one room, a very pleasant and relaxing environment. The breakfast was to die for! We had paid for the full English breakfast, which was beautifully cooked and delicious. The buffet style Continental breakfast was outstanding too; you could eat as much as you want, and there was so much choice, from croissants, muffins and toast to various cereals, a bowl of fruit salad, fruit compote, several types of yoghurt and several conserves. There was also a choice of tea, coffee and fruit juices. The hotel was very full the night we stayed, I suspect a lot of University parents, like ourselves, were staying there. The staff coped amazingly considering the number of people they had to cater for at breakfast, and they were friendly and courteous throughout. We can't speak highly enough of the staff, and the hotel was excellent value for money. In short, our stay at the Premier Inn was perfect, and we fully intend staying there on our next visit to Coventry. Room Tip: I don't know enough about the location of any other rooms, but our room overlooked Pizza Express... See more room tips","title":"“A very warm welcome”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Redhill, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 September 2011","sleepQ":5,"rooms":5}
{"User":"RabbitRoamer","Cities":0,"text":"A bright and modern Hotel right in the centre of Coventry, with excellent parking nearby ... the car park is not operated by the Hotel but Hotel guests receive a discounted rate ... Within easy walking distance of the centre of the City and an excellent base for business or tourism ... Check out the \"Town Wall Tavern\" nearby for a good Pub with cask ale ..! Room Tip: Higher floors will be quieter. See more room tips","title":"“Well worth considering ...”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Bucks, England","cleanliness":5,"Helpful":0,"date":"20 September 2011","sleepQ":3,"rooms":4}
{"User":"Day T","Cities":0,"text":"Excellent helpful staff, clean hotel throughout, excellent all you can eat Breakfast. Convenient situation and parking just 30meters away. One night stay on a Friday was just £31.00 plus £7.00 for breakfast. Best budget hotel I've stayed in.","title":"“Clean hotel cheerful staff budget price”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Staines, United Kingdom","cleanliness":5,"Helpful":0,"date":"20 September 2011","sleepQ":5,"rooms":5}
{"User":"9gc","Cities":0,"text":"This is the second time I have stayed at this particular Premier Inn as I have been down to Coventry a couple of times on business. Great location for where I need to be and exactly the low budget hotel I need for a one night stay. Staff were welcoming and the check in process very easy. Room are typical good modern Premier Inn standard and very clean. Downside is certainly the cost of the carpark which is a multi storey carpark. You can get you ticket swipped for discount but it was still around £5.00 for an overnight park. Overall a good budget hotel, would prefer if it was more around the £50.00 mark but will definitely return as better than all the other alternatives.","title":"“Very good budget hotel”","hotelReviews":0,"location":0,"Reviews":0,"service":4,"value":4,"Location":"","cleanliness":5,"Helpful":0,"date":"7 September 2011","sleepQ":5,"rooms":0}
{"User":"915emilya","Cities":0,"text":"Was really nice and clean, staff were welcoming. Was ice to be right in the city as it was easy access everywhere! Parking is good but could be showed more clearly to go to reception. Breakfast is good! Highly reccomend Room Tip: The rooms at the back have a lovely view of the theater See more room tips","title":"“Lovely stay”","hotelReviews":0,"location":0,"Reviews":0,"service":4,"value":5,"Location":"Coventry, United Kingdom","cleanliness":5,"Helpful":0,"date":"26 August 2011","sleepQ":5,"rooms":0}
{"User":"Teamkarma","Cities":0,"text":"Very good location, close to all you need, very pleasent staff, good bar/resturant area, costa coffee, secure car park 50m walk from front door, 10% discount for hotel guests. clean airy room, and very quiet, resonably priced wi-fi {£3 for 24hrs} great room price too {online booking @ £34 per night} Room Tip: When you book a room, it is just reserved, it is only allocated when you arrive, so just ask for wha... See more room tips","title":"“easy access &amp; very quiet.”","hotelReviews":0,"location":0,"Reviews":0,"service":4,"value":4,"Location":"Edinburgh, Scotland","cleanliness":5,"Helpful":0,"date":"24 August 2011","sleepQ":5,"rooms":0}
{"User":"mobs42","Cities":0,"text":"Stayed here with my family on Saturday 20th August for one night. We were visiting to watch a Football match at the nearby Ricoh Arena. and for myself to take part in the Fun Run, the next day at the Nearby War Memorial Park, I telephoned on the friday to double check Car Parking and ask if we could arrive early, as we didn't want to have to park at the Ricoh Arena,and spoke to Leanne, who was very polite and friendly and explained we could at worse leave our bag behind Reception if our room wasnt ready, arrived just before 1.30pm and the receptionist checked us in and Even telephoned for a taxi for us so we didnt have to walk to find one. We have stayed at at about a dozen Premier inn's before and this is by far the best. ALL the staff were friendly from the first to last one we had any dealings with from telephoning on the friday, check inn, dinner in the evening, breakfast around the hotel and check out. Our room was on the second floor, looked out onto the Belgrade theatre and we could hear a pin drop, the best nights sleep i have had. parking is in a multi storey a stones throw away and is very secure so dont worry £8.10 for the 20 or so hours there. the resturant in the evening has a very good menu from something small to even if you want a starter, main and desert. brilliant well worth the money we paid, As a family were not often all in the same place at the same time, so thank you Premier Inn Coventry City Centre for making our family weekend be the best one we have had for a long while, WE WILL BE BACK............AND SOON,","title":"“BEST PREMIER INN WE'VE STAYED AT”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Tamworth, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 August 2011","sleepQ":5,"rooms":0}
{"User":"DEAN553","Cities":0,"text":"Stayed with family, (2 kids). Room and staff were excellent and the breakfast was really good value, (kids eat free). So can't fault the actual hotel or staff. Car park is a multi storey next door which they say is £5 a day but actually if you park in the afternoon or early evening and don't move your car before about 8am, the cost carries over and it is closer to £8 even with the hotel discount. TIP: It is only £15 for a weeks parking ticket, so if you are staying a couple of nights it works out cheaper to pay the £15 weekly fee. This hotel is a good base for Warwick Castle, (15 mins drive away) and we also went into London by train - the train station is only just over a mile away or less than £5 in a taxi. It is also really close to Pizza Express and Bella Pasta. The kids menu for evening meal is also very limited unless your kids are happy with the usual 'fast food' options.","title":"“Really Good value apart from Car Park”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Blackburn, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 August 2011","sleepQ":5,"rooms":0}
{"User":"Boxty","Cities":20,"text":"Great value, friendly service. Cheap and cheerful.","title":"“Does exactly what is says on the tin.”","hotelReviews":12,"location":0,"Reviews":55,"service":5,"value":4,"Location":"Coventry, West Midlands","cleanliness":5,"Helpful":24,"date":"15 August 2011","sleepQ":4,"rooms":0}
{"User":"fremantlewa","Cities":0,"text":"As a tourist from Australia I was worried when family in England booked both Travelodge and Premier Inns for a short trip up north. Well, I was pleasantly surprised by the Premier Inn and wished in hindsight that we had only used them for the trip as not only Coventry but the other Premier we stayed at was of high quality. Its in a great location within Coventry with plenty of restaurants around it if you dont want to eat at the hotel. We chose to eat in and found the food to be very nice and fresh. Quiet rooms, very clean, comfortable beds .... Had breakfast and again - cooked fresh on request. Couldnt fault this hotel for the price we paid. Would definitely stay again! In fact it is because of this hotel that we chose another Premier Inn for a last minute booking later in the week. The only downside was that we had to park in the multi-story car park adjacent to the hotel and only 10% of the costs were reimbursed. And when checking out we had to lug our luggage (and there was quite a bit) over and up to the carpark as we couldnt work out how to get the car back to the entrance easily. Not a big deal I know but worth noting if you are booking in so its not a surprise !","title":"“Well priced and a pleasant surprise”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":4,"Location":"Perth, Australia","cleanliness":5,"Helpful":0,"date":"15 August 2011","sleepQ":4,"rooms":0}
{"User":"melmoff","Cities":0,"text":"Regular Premier Inn, nice bar, easy reservations and check in. Nice touch to call me before visist to help me understand parking. Great location for centre but a lot of building going on around area. Staff were very helpful and pleasant but the whole thing fell apart on trying to use anything technological. The public inernet connection in reception didn't work and ripped me off (only £2 so no big deal, but frustrating) They still also have those very old cable television systems in the room wh9ich are a pain to operate and the usual archaic annoying charges for wi-fi in room etc. When will they enter 21 st century.","title":"“let down by technology”","hotelReviews":0,"location":0,"Reviews":0,"service":4,"value":5,"Location":"Nottingham, United Kingdom","cleanliness":3,"Helpful":0,"date":"13 August 2011","sleepQ":3,"rooms":0}
{"User":"christina_mallon","Cities":0,"text":"We arrived at the hotel on the Friday and the staff were very pleasant. Nice friendly place. Bar was also very good. Breakfast also went without a hitch. Shopped in the centre and came back to the hotel for someting to eat. We both had a meal and could not fault it. It was the best meal we have ever had at a Premier Inn. Very close to the City Centre and also very easy to find. Multi story car park directly next door to the hotel for you to park your car. Would defintely recommend this hotel to anyone.","title":"“Fantastic hotel”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Northampton, United Kingdom","cleanliness":5,"Helpful":0,"date":"31 July 2011","sleepQ":5,"rooms":0}
{"User":"Roweys","Cities":0,"text":"Stay here regularly with work, rooms always clean, check in quick, good level of security getting into the building and onto each floor. Just what you need. When you walk out of the hotel you can choose from many restaurants. Pizza Express, Bella Italia, Cosmo, Indian etc. Would recommend.","title":"“Great value, clean, tidy and good service”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Bristol, United Kingdom","cleanliness":5,"Helpful":0,"date":"27 July 2011","sleepQ":5,"rooms":0}
{"User":"DurhamUKStuart","Cities":0,"text":"Stayed here twice in the past couple of months...excellent location, just off the Ring Road, with a pay-for multi-storey car park right next door. The hotel reception staff can stamp your ticket for a 10% discount. Character? Yes, in the very courteous and friendly welcome on reception, the excellent and attentive barman/restaurant manager...I had the create-your-own pizza which was very good...and the rapid and flexible breakfast service is good too. PremierInn rooms, as we all know, share a universal high standard for the money, and this one is no exception...nice flatscreen TV, comfy armchair. Bargain price too, proving that £29 room are readily available if you can plan and book ahead. Send me to Coventry...I'll stay at the PremierInn again.","title":"“How can chain hotels be given character?”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Durham UK","cleanliness":0,"Helpful":0,"date":"19 July 2011","sleepQ":0,"rooms":0}
{"User":"PhilofEnglandLondon","Cities":0,"text":"Above average quality for this group and friendly staff. My only gripe was the slow service during breakfast- it was really slow but otherwise very good.","title":"“A clean, friendly, reliable hotel but restaurant area too small and could't cope with busy period.”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":3,"Location":"London","cleanliness":5,"Helpful":0,"date":"15 July 2011","sleepQ":0,"rooms":3}
{"User":"JWebster1952","Cities":0,"text":"What a lovely weekend we had, one of the biggest premier inns we have stayed in. beautiful City, lovely staff and good weather, will be staying again.","title":"“Perfect”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Mansfield, United Kingdom","cleanliness":5,"Helpful":0,"date":"13 July 2011","sleepQ":5,"rooms":0}
{"User":"PicklesMcGraw","Cities":0,"text":"Stayed here with my husband during weekend visiting friends. I was a bit concerned about the price (about £70 for one night) but we certainly got our money's worth. The room (and the bathroom) was really big, clean and comfortable. Fantastic comfy bed. The breakfast was great, and included in the price. The staff were very friendly and attentive. Recommended.","title":"“Really comfortable, good food, lovely staff”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":4,"Location":"London","cleanliness":5,"Helpful":0,"date":"5 July 2011","sleepQ":5,"rooms":0}
{"User":"NeilHarvey1965","Cities":0,"text":"Friendly staff, clean rooms, excellent bar/food,rooms were well decorated and very comfortable. Superb location.","title":"“Excellent”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"Colchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"4 July 2011","sleepQ":5,"rooms":0}
{"User":"inesmon","Cities":0,"text":"We spent three nights in this hotel. The room and bathroom were clean, spacious, with coffee maker, no free WiFi and no parking lot. The address of Bond St. is actually the back of the hotel and we had trouble finding where to park our car to leave our luggage. There is a huge contruction next to the hotel and the entrance is on a small alley. We finally parked our car in a multy storey parking place which was indicated by the hotel receptionist. When you enter the city from the south following the instructions of a GPS you will surely get lost as there are too many exits, roundabouts and directions given one after the other. Anyway this is not about the hotel, it is only advice to be alert.","title":"“Very good for its price but complicated location”","hotelReviews":0,"location":0,"Reviews":0,"service":4,"value":5,"Location":"Buenos Aires, Argentina","cleanliness":4,"Helpful":0,"date":"1 July 2011","sleepQ":4,"rooms":0}
{"User":"davethesuede","Cities":0,"text":"Second stay at this Premier Inn and would recommend wholeheartedly. Just on the edge of Coventry City Centre (5 mins walk from shops, 15 from Cathedral), this PI is all you could need. Clean spacious room, friendly staff, eat all you can breakfast for £7.95 (cooked to order). Doesn't have it's own Car Park but there is a public one 2 minutes away. They even phone you on your arrival day to offer directions.","title":"“Clean, friendly, good service in central location.”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":5,"Location":"Northern England","cleanliness":5,"Helpful":0,"date":"18 June 2011","sleepQ":0,"rooms":4}
{"User":"Stevegermany","Cities":0,"text":"I cannot praise this hotel enough. The standards of cleanliness and comfort surpass any others of this type that I have stayed in. What sets it apart from others is the quality of the staff. I have never met staff with such high standards of courtesy and customer service. Nothing was too much trouble for them and Premier Inns should be proud of such quality staff. Many thanks to them all","title":"“The best place to stay in Coventry”","hotelReviews":0,"location":3,"Reviews":0,"service":5,"value":4,"Location":"","cleanliness":5,"Helpful":0,"date":"18 June 2011","sleepQ":0,"rooms":5}
{"User":"kenjaCornwall","Cities":0,"text":"Stayed at Premier inn to attend a wedding in Coventry, ideal location nice and clean comfy bed and friendly and helpful staff","title":"“Nice friendly staff and comfy bed”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":5,"Location":"cornwall","cleanliness":5,"Helpful":0,"date":"17 June 2011","sleepQ":5,"rooms":0}
{"User":"BlondesKiller","Cities":0,"text":"Comfortable bed! Missed the free wi-fi - it was quite expensive through .. The breakfast is fine - just not continental one - but from a positive side you can enjoy a typical British breakfast! ps: only non-smoking rooms available","title":"“Good value for money”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":4,"Location":"Ihtiman, Bulgaria","cleanliness":3,"Helpful":0,"date":"14 June 2011","sleepQ":5,"rooms":0}
{"User":"wideboy_uk","Cities":0,"text":"Stayed one night at the prem inn coventry city centre paid £49.99. car park is directly opposite the hotel and you get discount from the prem inn we paid £6.50 for nearly 24hours. The staff are very welcoming and there was plenty of them. We added an all you can eat breakfast for £7.99 each (cheaper to book before??) this comes with continental style breakfast to start then a full english all served with a costa coffee to wash it down. very nice! I thought the rooms were very clean tidy and well presented as you expect it to look, but no wow factor. All in all as i said at the start just what you'd expect from a prem inn!","title":"“does exactly what it says in the adverts”","hotelReviews":0,"location":0,"Reviews":0,"service":5,"value":4,"Location":"England","cleanliness":5,"Helpful":0,"date":"7 June 2011","sleepQ":4,"rooms":0}
{"User":"viola789","Cities":0,"text":"very good hotel clean carpets in room greasy at wall end of bed :( clean and neat in general efficient check in and check out excellent english breakfast did not try the dinner had one of the best sleeps at a hotel ever will return ....","title":"“value for money”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":3,"Location":"sweden","cleanliness":3,"Helpful":0,"date":"22 May 2011","sleepQ":5,"rooms":4}
{"User":"Phoenixfan39","Cities":0,"text":"Great location for Centre of Coventry and Skydome arena. I stayed here with my fiancee for the EPL ice hockey playoff weekend. We enjoyed the hotel very much. Most of the hotel was filled with hockey fans from different areas of the uk and the staff embraced the event and helped make our stay great fun. We have already decided to go back in 2012. By far the best accommodation for value friendliness and location in coventry. Absolutely no complaints. Except maybe the variety on the pre paid evening menu which was limited but for the price was very good and quality was excellent.","title":"“Excellent service and efficiency.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Manchester, United Kingdom","cleanliness":5,"Helpful":0,"date":"19 April 2011","sleepQ":0,"rooms":5}
{"User":"deSaintEx","Cities":0,"text":"We stayed in this Premier Inn last month for a single night and i'd love to stay there more. The hotel was almost perfect for the money we spent (57pounds). It's situated as close to the center of Coventry as you'd probably like it to be. The rooms are spotlessly clean and spacious. The bed was excellent (although i'd like to have more types of pillows since there are many of them) as was the bathroom (and the rest of the facilities). All staff were very professional and helpful which was what i expected from a Premier Inn. Would stay there again if i ever get the chance. From now on i will consider Premier Inn hotels to be amongst the first ones i look into when i travel abroad, in order to avoid unexpected accommodation disappointments.","title":"“Definitely worth staying”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":4,"Location":"Athens","cleanliness":5,"Helpful":0,"date":"8 April 2011","sleepQ":5,"rooms":5}
{"User":"appto","Cities":0,"text":"The room was clean and modern. Great power shower and extra pillow all in all a great stay. The staff is the best asset of this hotel, very friendly and helpful. Much better than other premier inns we have stayed at before.","title":"“Great for a budget hotel!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"","cleanliness":5,"Helpful":0,"date":"5 April 2011","sleepQ":5,"rooms":5}
{"User":"EnglandJa","Cities":0,"text":"As a regular user of Premier Inns I expected the room to be functional and clean. And it was, typical PI. But the bar and restaurant are small and poorly managed. Staff talking to each other whilst customers wait and forgetting drinks that are ordered is not on. The Coco brand is nowhere near as good as the usual Beefeater etc. Give this one a miss.","title":"“Poor catering”","hotelReviews":0,"location":3,"Reviews":0,"service":2,"value":3,"Location":"England","cleanliness":4,"Helpful":0,"date":"21 March 2011","sleepQ":0,"rooms":3}
{"User":"jacobbear","Cities":0,"text":"Just spent 2 nights at this hotel - so good, felt compelled to write my first post on this website. Premier Inn brand is well known for offering good value rooms but what is most impressive about this hotel was the staff. They have a great team of friendly, helpful people who make you feel nothing is too much trouble. This was a business trip so nothing special but room, food, drink...everything spot on. If anyone from Premier Inn HQ reads this stuff, you need to get someone down to Coventry, congratulate these guys and see them as a model for others.","title":"“Good value and great service”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Salisbury, United Kingdom","cleanliness":5,"Helpful":0,"date":"16 February 2011","sleepQ":5,"rooms":5}
{"User":"angieLanzarote","Cities":0,"text":"I've stayed at the hotel several times when visiting the area for business reasons. I can only say that the person in charge of customer service training and/or recruitment at this hotel needs an award. All Premier Inns are good value, clean, generally well located, but at this one in particular the staff are super friendly and professional. This includes reception (special mention to Vicki who has often been on duty during my stays and is very good at remembering names, last visit and so on) bar team, (Chris - i hope I have this name right) is always funny and friendly and on one occasion had reception return my lost lip gloss), the housekeeping team are unobtrusive and bright/breezy. Never had any need to call for maintenance. Regarding parking, if you are staying longer than a night then go to the parking desk and buy the weekly ticket for 15 GBP as if you are staying two nights or more you'll likely spend that in parking. I think its excellent value parking - city centre - well lit - totally secure and safe. Avoid departing at the same time as a show has finished at the Belgrade Theatre if you don't want to be waiting to get out. Look forward to my next visit.","title":"“Whoever is in charge of customer service training needs an award”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Lanzarote","cleanliness":5,"Helpful":0,"date":"16 February 2011","sleepQ":5,"rooms":5}
{"User":"Empathology","Cities":0,"text":"This is a very clean and friendly hotel in the centre of the city with efficient and friendly staff, comfortable rooms and a gvery good breakfast. Other commentators have remarked that the car parking and breakfast is extra (of course it is and is advertised as such) and the hotel is next to a building site (untrue, the site is completely empty, boarded up and no construction is taking place at time of writing, didn't even know what it was till I looked down on it from the 3rd floor). My only small reservation would be that in common with a lot of other budget chain hotels, beaware of young groups who can make some noise. The inter-roon noise was non-existant, but the constant banging of the sprung doors as they flit between each others rooms can be a little irratating. Ask if there are groups when you get there and they'll be happy to try find you a quieter area.","title":"“CLean friendly central hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":4,"Location":"Rotterdam, The Netherlands","cleanliness":5,"Helpful":0,"date":"4 October 2010","sleepQ":5,"rooms":4}
{"User":"happyYorkshire","Cities":0,"text":"","title":"“Great Staff”","hotelReviews":0,"location":4,"Reviews":0,"service":5,"value":5,"Location":"yorkshire","cleanliness":5,"Helpful":0,"date":"17 September 2010","sleepQ":5,"rooms":4}
{"User":"michaelturner","Cities":0,"text":"","title":"“Five star service at two star prices”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Kettering, United Kingdom","cleanliness":5,"Helpful":0,"date":"6 September 2010","sleepQ":5,"rooms":5}
{"User":"whatcitynext","Cities":0,"text":"","title":"“Excellent hotel”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Belfast, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 July 2010","sleepQ":5,"rooms":5}
{"User":"hockeynut52","Cities":0,"text":"","title":"“Great place to stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"N England","cleanliness":5,"Helpful":0,"date":"13 July 2010","sleepQ":5,"rooms":5}
{"User":"Bilwi043","Cities":0,"text":"","title":"“Excellent for a short stay”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Mallorca","cleanliness":5,"Helpful":0,"date":"15 June 2010","sleepQ":5,"rooms":4}
{"User":"capitalstraveller","Cities":0,"text":"","title":"“Clean, Comfortable and Convenient”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":3,"Location":"Devon, UK","cleanliness":3,"Helpful":0,"date":"6 May 2010","sleepQ":4,"rooms":4}
{"User":"37Rycroft","Cities":0,"text":"","title":"“Excellent Hotel &amp; Location”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Windsor, United Kingdom","cleanliness":5,"Helpful":0,"date":"21 April 2010","sleepQ":5,"rooms":5}
{"User":"coyotes_uk","Cities":0,"text":"","title":"“Excellent Premier Inn close to the city center!”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Manchester","cleanliness":5,"Helpful":0,"date":"13 April 2010","sleepQ":4,"rooms":5}
{"User":"Predictable_Kate","Cities":0,"text":"","title":"“Excellent hotel, excellent staff.”","hotelReviews":0,"location":5,"Reviews":0,"service":5,"value":5,"Location":"Coventry","cleanliness":5,"Helpful":0,"date":"12 March 2010","sleepQ":5,"rooms":5}
{"User":"irishlinks","Cities":0,"text":"","title":"“Good Value Hotel”","hotelReviews":0,"location":0,"Reviews":0,"service":0,"value":0,"Location":"Ireland","cleanliness":0,"Helpful":0,"date":"24 January 2010","sleepQ":0,"rooms":0}
{"User":"ANACARLO","Cities":0,"text":"","title":"“Decepcionante.”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":3,"Location":"Valencia, Spain","cleanliness":4,"Helpful":0,"date":"11 December 2012","sleepQ":4,"rooms":3}
{"User":"Claudia S","Cities":0,"text":"","title":"“Zentraler geht's nicht”","hotelReviews":0,"location":5,"Reviews":0,"service":4,"value":5,"Location":"Ratingen, Germany","cleanliness":5,"Helpful":0,"date":"28 September 2012","sleepQ":5,"rooms":5}
{"User":"bubu78150","Cities":0,"text":"","title":"“Moyen”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":3,"Location":"Rocquencourt","cleanliness":2,"Helpful":0,"date":"28 July 2012","sleepQ":4,"rooms":3}
{"User":"traveller197780","Cities":0,"text":"","title":"“Gutes Preis-Leistungsverh&auml;ltnis”","hotelReviews":0,"location":4,"Reviews":0,"service":4,"value":4,"Location":"Leipzig, Germany","cleanliness":4,"Helpful":0,"date":"19 December 2011","sleepQ":4,"rooms":4}
{"User":"g r","Cities":0,"text":"","title":"“Hotel al centro”","hotelReviews":0,"location":4,"Reviews":0,"service":3,"value":3,"Location":"roma","cleanliness":3,"Helpful":0,"date":"22 November 2011","sleepQ":4,"rooms":3}
