{"text":"Great value hotel. The room was clean and spacious and overlooked the water, overnight it was nice and quiet. Great value wifi at £3 for a 24 hour period. Breakfast (help yourself continental) was plentiful at the nearby Beefeater (full English also available). Reception staff were friendly and helpful. Would definitely stay again.","title":"“Great value hotel”","location":4,"service":5,"value":4,"cleanliness":5,"date":"28 April 2013 NEW","sleepQ":4,"rooms":4},{"text":"Stayed here on the night of 24th April 2013 because we were attending a concert at The Lowry. The deal consisted of three-course evening meal (with free drink) and (all you can eat!) breakfast, both in the adjoining Beefeater, for only £22.99 per head. The large room and bathroom were spotlessly clean and there was no noise throughout. The staff in both the hotel and Beefeater were exceptionally friendly. The quality of the food both in the evening and at breakfast was first class - beyond expectations, to be honest (and just as good as an excellent hotel we've stayed in in the Lake District at exactly twice the nightly room rate). Without the slightest hesitation we would recommend this hotel and will certainly visit again. Room Tip: Don't know about other rooms, were in third floor of what we think is extension. See more room tips","title":"“Excellent hotel!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 April 2013 NEW","sleepQ":5,"rooms":5},{"text":"We came up to Manchester so my youngest daughter could go to a concert. We had a very enjoyable stay and wished we had arranged to stay for longer. We had three rooms, all of which were very comfortable and spotlessly clean. The reception and housekeeping staff we met were also a credit to the company. We ate dinner and breakfast at the Beefeater next door and both meals were delicious. Again the staff were polite and helpful and gave the impression they were enjoying their work. We have no hesitation in recommending this hotel (and restaurant). The Salford Quays are is a great place to stay, particularly if the weather is good because there are plenty of opportunities for walks. The tram system makes it easy to get into Central Manchester. If you are first time visitors (as we were), make sure you check out the different types of tickets available as day/weekend tickets are good value.","title":"“Family trip”","location":0,"service":0,"value":0,"cleanliness":0,"date":"21 April 2013","sleepQ":0,"rooms":0},{"text":"We stayed here for two nights. Friendly check in staff. Very clean rooms and very modern I love the new tvs the premier inn's are now getting, rooms were very big and had lovely comfy beds. 15min walk to old Trafford. 10min drive to the Trafford centre. Free parking. Will be staying here again if we are visiting manchester for football. Tram is a two min walk away from the hotel. 10mins on the tram to print works. We didn't eat in the restaurant but did go in there on the Saturday night for a few drinks, nice pub. Room Tip: Ask for a room high up looking out to the quays. See more room tips","title":"“Great location!”","location":5,"service":5,"value":5,"cleanliness":4,"date":"21 April 2013","sleepQ":5,"rooms":5},{"text":"Ideal location for the Lowry Centre, which is only 2 minutes walk away and the start of the Manchester Ship Canal Cruise to Liverpool on Mersey Ferries. Lovely walk around the Quays area and hotel was comfortable.","title":"“Salford Quays - Weekend”","location":4,"service":3,"value":3,"cleanliness":4,"date":"17 April 2013","sleepQ":4,"rooms":4},{"text":"Managed to get a deal and well worth it. Rooms recently refurbished, comfy bed and helpful, courteous staff. Lovely location on the quays very handy for The Lowry and Imperial War Museum. City centre a short ride on the tram. Room Tip: ask for a room facing the water See more room tips","title":"“Excellent value”","location":5,"service":5,"value":5,"cleanliness":5,"date":"17 April 2013","sleepQ":5,"rooms":5},{"text":"Upon arrival at the hotel we were astounded at the fabulous location, once we were greeted by very friendly reception staff we went up to our room and wow was the only word that came from our mouths, the room was huge for what you usually expect from a premier inn, it had a double bed relatively close to the wall, enough room to walk between the bed and wall to get to the bedside cabinet of course but this was great because it made the room look bigger and more space to get changed etc. The view from the room was amazing, a brilliant view across the quays and could even see Old Trafford in the distance :) (the reason we came to manchester). Dinner in the beefeater was lovely too, very quiet at about 7.30pm on a thursday night which was lovely, the food was hot and really cheap-unlimited chips! and the service was very tentative too. I probably had one of the best nights sleep ever in a hotel here as the bed was incredibly comfy. Breakfast the next morning was also served in the beefeater restaurant and was a buffet, hot and cold, even though breakfast finished at 10.30 and we arrived at 10 the restaurant was relatively empty and the food was still really hot, tasted and looked fresh and was plentiful. I can honestly say this is the best premier inn i have ever stayed in purely based on the size of the room for £25(easter break deal) the decor, comfort, service and fantastic views. i would definately stay here again and would recommend 500%. stay here!","title":"“Amazing hotel for great value!!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 April 2013","sleepQ":5,"rooms":5},{"text":"Ample parking & good standard were our priorities- this ticked all the boxes!. Considering it is \"budget\" brand it is top notch - clean, warm & friendly staff, great brekkie and 2 mins to tram stop.....","title":"“Fab find - We`ll be back!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 April 2013","sleepQ":4,"rooms":5},{"text":"Stayed here for two nights on the way back from a trip to Scotland. Very well placed for central Manchester - the tram ride took 10-15 mins. Also really close to Trafford Centre, we drove there so can't comment on public transport. The room was freshly decorated therefore very clean and tidy. Huge double bed (very high up!!) and single bed each for the kids. Good sized room. The only down side was there was a lot of noise from above us - every step taken in the room above seemed to reverberate around our room, and it seemed there were kids jumping off the bed as the noise was quite loud at one point! But it didn't affect our sleep quality. The breakfast was good, as it usually is in Premier Inns, the only thing I'd say is that if you want the fresh porridge or the specially cooked eggs (if you don't want the standard scrambled), you need to order this as soon as you sit down as I ended up having finished my cooked breakfast before my egg arrived! I allowed for this on day 2 by requesting my egg as soon as I sat down. Guess it depends how busy they are. Our room overlooked the quays, great view, walking distance to the outlet village and Pizza Express which we used one evening. Would stay there again, no complaints.","title":"“Well situated hotel for centre of Manchester and Trafford Centre”","location":5,"service":5,"value":4,"cleanliness":5,"date":"9 April 2013","sleepQ":4,"rooms":4},{"text":"Recently refurbished Premier Inn, everything you need, excellent bed, very clean, well proportioned accommodation, friendly efficient staff. However, I would avoid the cooked breakfast. To make life easy for the staff they appear to cook a big dish of bacon, sausage etc at 6AM, which then slowly cools over the next 3-4 hours until 10AM. So when I turned up at 8AM the bacon was stone cold and the sausages tepid.....","title":"“Hotel is Good. Avoid Breakfast... was it freshly cooked at 6AM?”","location":5,"service":4,"value":4,"cleanliness":5,"date":"8 April 2013","sleepQ":5,"rooms":5},{"text":"stayed here for just 1 night but intend to return. nice clean room , this premier inn is in a great location really quiet and the pub next door does a great breakfast. wished it had been warm as at the back of the hotel is a water skiing school , there is a shopping mall called the lowry. the hotel is mainly surrounded by offices so very little noise. very close to manchester united football ground, and you can also get a tram in to the city centre. Room Tip: ask for a room facing the water See more room tips","title":"“relaxing”","location":4,"service":5,"value":5,"cleanliness":5,"date":"8 April 2013","sleepQ":5,"rooms":4},{"text":"This was a superb base with access to shopping, entertainment, bars and restaurants within walking distance. The usual highstandard of cleanliness and hospitality. The breakfast facilities were at a Beefeater restaurant next door but not up to same standards of a Premier Inn Restaurant. Room Tip: A room overlooking the Quays added entertainment by watching the watersports See more room tips","title":"“Superb Base”","location":5,"service":5,"value":5,"cleanliness":5,"date":"8 April 2013","sleepQ":5,"rooms":5},{"text":"Had a one night stay. Lovely location. Very close to Imperial War Museum & Lowry etc. Only problem is they have opened a new extension. Room was clean & same as all of the other Premier Inns we have stayed at. But despite it being very cold outside it was far too hot in the room. The windows don't open at all which we thought was very strange. The room climate control didnt appear to be working. Anyway, we were quickly moved to a room in tbe older part of the hotel where the window opened. Staff were very helpful & cheerful. Can't see the sense in a hotel room where the window doesn't open personally. Anyhow, we enjoyed our stay and the hotel was quiet so on the whole we were happy. Great value for money.","title":"“Fabulous location &amp; great value.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"6 April 2013","sleepQ":0,"rooms":3},{"text":"We stayed here for one night as we had booked tickets to see a play at the Lowry Theatre. The room was of a very good size and standard. It was also very clean. Our room had a nice view over the canal. The staff were very welcoming and helpful. It is only a 5 to 10 minute walk along the canal to the theatre. We eat prior to going to the theatre at the Beefeeter which is attached to the Premier Inn. This hotel is close to all of Salford's attractions, The Lowry Theatre, The Lowry Outlet, Imperial War Museum North and Media City, not to mention Manchester United football stadium.","title":"“THEATRE TRIP”","location":5,"service":5,"value":5,"cleanliness":5,"date":"5 April 2013","sleepQ":5,"rooms":5},{"text":"Our stay was very enjoyable and affordable. The bed was extremely comfortable and choice of pillows excellent. We were very impressed by the cleanliness and modern decor of the hotel. The staff were extremely friendly and helpful and the location was perfect. We would thoroughly recommend this hotel and appreciated the \"Good night's sleep guarantee\". The tram stop is only yards away and are very frequent. All round great experience and we will definitely stay again.","title":"“Guaranteed great night''s sleep”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 April 2013","sleepQ":5,"rooms":5},{"text":"Booked the venue as it was close to the theatre (The Lyric, Lowry for \"The Ladkillers\"). Really helpful and friendly staff - welcoming on our arrival and professional in dealing with some noisy \"neighbours\" who disturbed our second night in the hotel. Great location for nearby attractions too - The Lowry; Imperial War Museum North; Lowry outlet village and a tramride from Manchester Piccadilly. Would definitely stay here again. Tip - visit Booths (good standard of supermarket and deli); saved us a cooking job on our arrival home. Hotel facilities are good with a good standard of cleanliness and comfortable rooms and accommodation Room Tip: ask for a quiet room at the end of the corridor and away from stairs and lifts See more room tips","title":"“Base to Stay for Theatre Trip”","location":5,"service":5,"value":3,"cleanliness":5,"date":"1 April 2013","sleepQ":3,"rooms":4},{"text":"Visited this Premier Inn at Easter and cannot fault it. The room was a decent size, and very quiet. The bed was comfy and all facilities were good. The staff we met were really helpful and friendly. We took breakfast in the Beefeater which was also excellent nothing was too much trouble. Great location, close to Lowry Outlet mall and Media City, lots of eateries and easy to catch tram to Manchester if you want to venture further. Well recommended!","title":"“Nice Easter break”","location":5,"service":5,"value":4,"cleanliness":4,"date":"31 March 2013","sleepQ":4,"rooms":5},{"text":"This was our first stay in a premier inn and I can't complain about it at all! The hotel staff were so friendly and helpful, the hotel was extremely clean. When we booked we expected that our girls would be sleeping on a sofa bed, but when we got to the room they had proper beds which was so much nicer and a great surprise. Rooms were comfortable and clean.. We had dinner in the beefeater and that was lovely as was breakfast. This hotel is in such a lovely place and within easy reach of everything, we would defiantly recommend and stay again!","title":"“Fantastic!!!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 March 2013","sleepQ":5,"rooms":5},{"text":"Stayed here last month as we had tickets for Lowry theatre. Room was very clean and comfortable. Staff at reception very friendly. Had a great nights sleep. Easy pleasant walk to The Lowry next day and told was ok to leave our car all day! Can't comment on breakfast as we didn't have it but would definitely stay here again when visiting The Lowry!","title":"“First rate!”","location":5,"service":4,"value":5,"cleanliness":5,"date":"27 March 2013","sleepQ":5,"rooms":5},{"text":"We booked a family room for two adults and two children (aged 6 and 8) for one night. The cost - £93 (inc. breakfast) - was good value. The hotel and room was clean, comfortable and in good condition. Breakfast was served in the Beefeater next door, which was of reasonable quality. The hotel is in a good location being close to the local attractions and restaurants. Old Trafford stadium (the reason for our visit) is an easy 10-15 minutes walk away. Recommended for a no-frills stopover.","title":"“Clean and comfortable hotel in excellent location”","location":5,"service":5,"value":4,"cleanliness":5,"date":"25 March 2013","sleepQ":4,"rooms":4},{"text":"All staff are soooooooooooo friendly and always are up for a chat when they are not busy. The hotel is excellent, with clean rooms and good TV. :) I would recommend this hotel to anyone!!! The breakfast is also lovely, I would recommend the vegetarian sauteed leek sausage, I'm not a veggie but they are lovely. Please go you will regret this for the rest of your life if you don't!!!!!!!!!!!!!!!!!!!!!!!","title":"“Fabulously fandabidozely amazingly friendly”","location":5,"service":5,"value":5,"cleanliness":5,"date":"22 March 2013","sleepQ":5,"rooms":5},{"text":"The rooms are nicer than at waters reach and the restaurant is definitely better, breakfast is freshly cooked rather than served en masse and kept warm. The staff are friendly, plenty of parking space and a nice view along the quay from my room :)","title":"“Better than at waters reach”","location":5,"service":5,"value":4,"cleanliness":4,"date":"18 March 2013","sleepQ":0,"rooms":5},{"text":"Stayed here 16th march 2013. Price for 1 room was..... wait for it ... 153.00!!!!! I didnt book it so was quite shocked when i got the bill!!! Room was clean and plenty of room and had a good size tv had everything you would need for a night or two. Only complaint other than the stupid price .... was not enough towels!! Only one hand and one bath towel for 2 adults!! The young girl on reception (victoria?) Was very polite and cheerful!!","title":"“lovely, but overpriced”","location":3,"service":5,"value":2,"cleanliness":5,"date":"17 March 2013","sleepQ":5,"rooms":4},{"text":"Location has a big impact on this Premier Inn. It's close to Manchester United football club so when events and events are on its expensive but at other times good value. Great for business use if you are working at Media City. Typical premier inn but recently refurbished rooms which are nice. Staff here are particularly nice and helpful.","title":"“Variable pricing”","location":5,"service":4,"value":3,"cleanliness":5,"date":"17 March 2013","sleepQ":0,"rooms":5},{"text":"What a wonderful stay we had here! We have stayed in many different Premier Inns across the country and this one tops them all. We found it to be in a perfect location, with a lovely view from our room. Easy, quick access to the trams, which were also efficient and spotlessy clean. The hotel boasts a very pleasant setting and has a clean and tidy car park with ample spaces. The reception staff were exremely friendly, welcoming and helpful. Special thanks go to Jim and Daljet for making us feel like VIP's and for all their extra assistance. Our room was immaculately clean, with a lovely fresh smell, very light and airy but warm and cosy. Super comfortable bed with choice of pillows, spotlessly clean bathroom, ample towels and I love the shampoo and soap dispensers, so much more hygenic and a lot less fiddly than the usual sachets. We both had a super night's sleep. Rather smart tv and Wi-Fi access was quick and easy. Hairdryer and lighted mirror very practica too.. We ate dinner and breakfast at the Beefeater restaurant next door. Dinner was first-rate, delicious chips! and excellent service. Breakfast was spot-on, everything perfectly cooked, plenty to eat and drink..and..the young lady who was our waitress was absolutely charming, nothing was any trouble for her, she strived to look after us and basically went out of her way to make our morning so extra special. If you are looking for a hotel in this area, then choose this one. It wasn't expensive and we can't recommend it highly enough. We are already planning our next stay. Well done to all the Salford Quays Premier Inn staff and to the lovely waitress next door! Room Tip: Ask for a room with a view! See more room tips","title":"“'Perfect'!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"15 March 2013","sleepQ":5,"rooms":5},{"text":"Once I found the hotel (about 5-10 minutes walk from Salford Quays metro station along the bank of the river) I was made to feel very welcome and my room was excellent. Spacious, modern, flat screen wall-mounted TV with text. Good value breakfast next door and fine view from room over river to Old Trafford. Staff extremely friendly- a very enjoyable stay.Very handy for Lowry which is 5-10 minutes walk further along the river bank.","title":"“Comfortable and friendly stay”","location":5,"service":5,"value":4,"cleanliness":5,"date":"13 March 2013","sleepQ":5,"rooms":5},{"text":"Having booked here for one night to visit Media City which is 10mins walk away, we arrived early asking permission to use the carpark & catch the tram into the city, to our supprise we were allowed to check-in early, 4 hours early!! the man behind reception was very kind & helpful (As we find most Premier-Inn staff to be) we checked in & by 10.30am we were out enjoying our day. The hotel itself is ideally situated & easy to find, it has a free carpark right outside the front door as well as an overspill carpark next to that, so parking is never an issue. You get the usual warm welcome, the room was very clean & tidy (As usual) with a giant state of the art wide screen TV on the wall (Very nice). Dinner & breakfast was served at the Beefeater right next door with the same level of service. I will definately be going back to this hotel because it, it's position, it's surrounding area's & staff are very good but next time i'll go in the summer when it's not so cold outside Lol. Room Tip: Try & ask for a room with a view of the Quay, it's really nice. See more room tips","title":"“Great location, great hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 March 2013","sleepQ":5,"rooms":5},{"text":"Stayed for one night after a matinee performance of the Lion King. Having stayed in many Premier Inn’s we had pre-booked a table for dinner at the Beefeater and also booked and paid for Breakfast at check in. The room itself was clean, tidy and modern although a little smaller than some Premier family rooms we have stayed in and the walls are quite thin (I could hearing snoring in a different room!). The problems we encountered with our stay were around the food and service in the Beefeater which was really very disappointing. The staff were very friendly but having had four of us all ordering steak (1 well done & 3 medium) to find 3 of them the most over cooked medium steak I have ever experienced really was shocking for a grill who base so much on their steaks! In fairness, we were given free drinks, as we did not have time to wait with the kids for 3 meals to be re-cooked but this did spoil what could have been a really pleasant meal. We received a voucher as we paid for the meal for buy one get one free on the breakfast so queried this with reception on returning to the hotel, as the last time we had stayed in a Premier Inn where this was being offered we were only charged for one breakfast as we checked in as they knew we were eating with them in the evening and then for breakfast. The receptionist said he wasn’t sure so we should check in the morning – this we did but as a cash refund was needed and there was no cash we were told to ask at the restaurant and if they could not refund go back to reception. When we arrived for breakfast on the Sunday morning though it was little more than a shambles – 2 big parties had arrived at the same time as us at 10am so the buffet ran out completely – we were then left with freshly cooked eggs and told the buffet would be restocked in 6-8 minutes. The eggs were sent back and replaced but again the buffet ran out almost as soon as it was replenished – 40 or so minutes after entering the restaurant we finally managed to get the cooked breakfast we had paid for. I didn’t complain as I could see the staff were trying hard and thinking that with the offer of a free breakfast it was not worth it. However, back at reception we were told the credit card would be refunded and someone would be in touch to do this – guess what no-one has been. As I say this stay could have been excellent stay - the hotel has a great location and the surroundings are lovely – the Beefeater really does need to up it’s game though and the reception staff should not tell me something will be done if it won’t.","title":"“Could have been so much better......”","location":5,"service":3,"value":3,"cleanliness":5,"date":"4 March 2013","sleepQ":3,"rooms":4},{"text":"Stayed here for 1 night. The hotel is very well situated right in the centre of Salford Quays, next to the Lowry Centre & a short walk from Media City. The trams run right next to the hotel & an off peak return into Manchester City Centre was only £2.90 return. We were given a room on the ground floor which had been redecorated 2 days before & it was very nice. A typical PremierInn room with a flat screen mounted TV and a spotless modern bathroom. The reception staff were very friendly as were the breakfast staff the next morning in the adjoining Beefeater - good breakfast by the way. Would recommend this as a good centrally appointed hotel with excellent access into the City - plus free parking!","title":"“Nice Waterfront Hotel”","location":4,"service":4,"value":5,"cleanliness":4,"date":"25 February 2013","sleepQ":5,"rooms":4},{"text":"As usual the Premier Inn comes up to scratch. It does what it says on the tin! The beds are comfortable, the rooms clean and food available at the restaurant next door. Having been raised in Salford for part of my childhood - many, many years ago it was wonderful to explore and find the spot where my grandparents house was (now offices) and to see the park I played in as a child (still there!!) The hotel is basic, does what it says on the tin, is good value for money, and staf courteous and helpful.","title":"“value for money”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 February 2013","sleepQ":5,"rooms":5},{"text":"This premier inn has a good location on the Salford Quays area. Building work is still on-going, but from what I could see, it was the finishing off that was being carried out and did not affect our stay, other than reducing the amount of car parking and we heard no noise from the works to disturb our stay. Rooms were up to the more recent Premier Inn standard with a large flat screen TV on the wall, though no a/c.","title":"“Good Location”","location":4,"service":4,"value":4,"cleanliness":4,"date":"25 February 2013","sleepQ":4,"rooms":4},{"text":"Really pleasant stay- hotel was very clean - although work going on during day re refurbishment - no disturbance to us- Asked for a room over looking quay and got it - Family room very clean and excellent tv - Breakfast excellent freshly cooked and plenty of it - with kids free this was a real bargain Staff were very polite and service was 2nd to none- ideally located for Manchester and also BBC studios and Man U ground - Lowry museum was good along with shopping and Imperial War Museum Highly recomend this - free parking as well Room Tip: Ask for room over looking quay- In Summer view would be excellent See more room tips","title":"“Excellent Hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 February 2013","sleepQ":5,"rooms":5},{"text":"Nicely situated for the Lowry centre shopping and theatre. A short walk to the tram, so easy to get in to Manchester etc. The hotel itself was the noisiest Premier inn we have ever stayed in, we have never been able to hear people talking in the next room before, this one conversations could be heard and also the televisions. We also had a floor above us, the room seem to be occupied by a family of elephants, banging around and making the light fixture vibrate as they walked. On the upside the staff were very nice and helpful and refunded us the cost of one of our three nights for being kept awake by the elephants above. Would I go there again, probably as it is cheaper than the Premier inns in the city centre and close to the transport links we need to get around. Restaurant next door a little hit and miss, depends on how busy they are as to how attentive the staff are and to some extent how good the food quality is. Chiquitos is a sort stroll and the food was fab as were the staff. Room Tip: If I go again I will ask for a room on the top floor. See more room tips","title":"“Very helpful staff, good for transport links.”","location":4,"service":5,"value":4,"cleanliness":4,"date":"24 February 2013","sleepQ":3,"rooms":4},{"text":"I am a very harsh critic, so this is really unusual. Really enjoyed our stay here. Friendly greeting, lovely helpful staff, exceptionally quiet room (despite being on the ground floor right by the car park and there were renovations going on in the hotel) Didnt hear a thing all night. Lovely choice of pillows and amazing customer service of \"who to ring\" if there was a problem. It was so good I hunted around for any dust/stains mess... Absolutely spotless... If there is a slight gripe (and this is personal taste) is that the tissues in stead of toilet roll made it more difficult in the toilet especially as ours were jammed slightly (easily solved) Also I like soap rather than an \"on the wall\" bottle. That is MY taste though not a problem with the hotel. Temperature in the room was perfect and easily adjustable, to the point we didn't notice our car was iced up! Breakfast was brilliant (we were early and no bacon) however on asking for bacon more came out and an apology as they didn't realize we had sneaked in. Beautiful view of the sun coming up over the quay in the morning with the ducks on the water. This hotel beat all the Premier Inns I have stayed at, plus a few other hotels that are Non-budget. Well done and if I need to be in Manchester again I will certainly go here again. Room Tip: Didnt notice a swimming pool or fitness centre See more room tips","title":"“Brilliant Stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"23 February 2013","sleepQ":5,"rooms":5},{"text":"A convenient hotel for the Imperial War Museum North and the Lowry Gallery, situated in a very photogenic area of Manchester. We were impressed with the excellent service both from reception staff and in the Beefeater Restaurant next door. Our room was exceptionally clean, spacious and comfortable. The meals were of a very good quality with a wide, varied choice. We had to make our way from the coach station to the hotel which was surprisingly straightforward using the excellent Metro tram service from Piccadilly Gardens to Salford Quays. The tram continues on to Media City UK should you wish to explore that area too. I was celebrating my 80th Birthday and all the staff went out of their way to make sure it was a memorable occasion. This is our second visit to a Premier Inn and we have not been disappointed in any way. Room Tip: Ask for Quayside room if you are concerned about traffic noise See more room tips","title":"“Super Premier Inn Salford Quays”","location":5,"service":5,"value":5,"cleanliness":5,"date":"22 February 2013","sleepQ":5,"rooms":5},{"text":"Booking excellent - easy to use. Price excellent. Arrived to warm welcome. Room immaculate, very clean. Bit of noise but only at 8.00 am - hotel in process of updating windows to double glazine. Staff friendly and provided extra tea and coffee on request. Excellent service. Did not use the restaurant. Handy location would stay again. Room Tip: We had a room on the top floor which had recently been refurbished. See more room tips","title":"“Visit to MEN arena”","location":5,"service":5,"value":5,"cleanliness":5,"date":"19 February 2013","sleepQ":4,"rooms":5},{"text":"The rooms were surprisingly nice for the price. The staff were local & very friendly. There are quite a few things to do locally, and the city centre was only a tram hop away. Getting to the Trafford centre was not quite as easy, but once we found the right bus and where to get it, it proved to be not that difficult. Room Tip: The waterside has views over the docks to Old Trafford. See more room tips","title":"“Surprisingly nice for the price.”","location":4,"service":4,"value":4,"cleanliness":4,"date":"19 February 2013","sleepQ":4,"rooms":4},{"text":"We stayed here again as it's so handy for the Lowry - 2 adults & 2 children. Check-in was poor as there was no-one on reception and despite ringing the bell, no-one came for almost 10 mins. Although FREEZING cold (15C on the thermometer), the room was lovely - each lad had their own bed so no arguments there! The big downside to this room was the noise - very noisy road and this room had no double glazing then we had a very creaky floor of the room above us where several baby elephants must have been staying - I know the constant walking across the room at 1am is not the hotel's fault, but the incredibly creaky floor is. We arrived at breakfast at 10am ish and was quite shocked at how messy the restaurant was. The waitresses were lovely but the food area was very messy - bean juice all over a stack of clean plates and muffin wrappers on the floor. Although you have to blame the ignorant guests that would make such a mess, the waitresses really should clean up as they went along rather than wait until the end of service - the place looked awful. Anyway, feeling very tired the next day, the receptionist asked if we'd had a good sleep! We all sighed a weary sigh and she refunded our stay without hesitation which was a very nice surprise. We probably would stay here again but only because it's so handy and would definitely take earplugs!","title":"“Handy hotel, friendly staff but noisy”","location":5,"service":4,"value":0,"cleanliness":4,"date":"18 February 2013","sleepQ":2,"rooms":5},{"text":"Excellent location only 15 minutes walk from old Trafford and 5 minutes from the Lowry and media city. Lovely clean rooms in keeping with the other premier inns we have stayed in. Adjoining restaurant is ok, you won't have an amazing meal in there just standard pub fare. We normally stay in the holiday inn express but found this hotel far better for value, comfort and cleanliness. Will certainly request a top floor room next time as the guests in the room in above us sounded like they were constantly jumping off the beds onto the floor. Don't know whether this is squeaky floors or just inconsiderate guests! Did not put us off though this will be our first choice hotel next time we visit old Trafford (as long as we can get a top floor room!!)","title":"“Our number one choice for visiting old trafford”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 February 2013","sleepQ":0,"rooms":5},{"text":"Great location for Lowry and other locations. Staff very helpful and friendly throughout. Hotel is being worked on and needs some modernisation. Was pricey for a premier inn. The review length required is too long for me. Room Tip: All rooms are quiet so far as others told us. See more room tips","title":"“Salford quays”","location":4,"service":5,"value":1,"cleanliness":4,"date":"11 February 2013","sleepQ":4,"rooms":3},{"text":"Stayed overnight with my son , Quite location but still easy walking distance to Old Trafford where we had booked a tour of the ground/museum , Room and Bathroom exeptionally clean and a added bonus of a large flat screen tv on the wall. Staff friendly and helpfull overall A++++++++","title":"“Great stay great location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 February 2013","sleepQ":5,"rooms":5},{"text":"Overnight stay whilst visiting the local area.Very friendly and helpful staff, comfortable bed and exceptionally clean. Hotel being upgraded/extended but the only disruption was briefly to the water supply during the middle of the day which didn't effect us at all. Quiet for such a central location and excellant value for money","title":"“Salford Quays Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"9 February 2013","sleepQ":5,"rooms":5},{"text":"Stayed here 2 nights when visiting The Lowry and spending time with family. Although they were in the middle of renervation and extention work we neither saw or heard any disruption. The room was the usual excellent quality, clean and comfortable with large flat screen TV. Bathroom had just been renovated and was spotless. The staff were very helpful. We ate evening dinner and 2 breakfasts at the beefeater next door. All meals were very good, infact the breakfast was possibly the best Premier Inn breakfast I have ever had. Very handy for everything at Salford quays and although we didn't have time to try it out the tram into Manchester is very close by. Was ecrtainly up there as one of the top Premier Inns I have stayed in and seeing as I got both nights for £58 was also the cheapest. would definetly recomend. Room Tip: Top floor, Water facing. If you get the sunshine you will think you are abroad> See more room tips","title":"“Very Good Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"5 February 2013","sleepQ":5,"rooms":5},{"text":"A fab little hotel which is about 15 minutes outside Manchester on the tram. Lovely staff, really really comfortable beds and pillows and an absolutely gorgeous breakfast. Even when our bath leaked at 11.30pm we were moved to a room directly opposite within 5 minutes. Could not fault this hotel in anyway and would recommend it absolutely. Room Tip: The rooms on the back of the hotel overlook the water so have a nicer view, all rooms are great thou... See more room tips","title":"“Highly recommended!”","location":4,"service":5,"value":5,"cleanliness":5,"date":"4 February 2013","sleepQ":5,"rooms":5},{"text":"Our stay was to enable us to attend the ballet at the Lowry. the location of the hotel is a two minute walk away.the receptionist on arrival was most helpful despite having lost her voice.I honestly could not fault our stay.","title":"“Comfort guaranteed and no Lenny Henry”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 January 2013","sleepQ":5,"rooms":5},{"text":"After reading the other reviews on here about this hotel I chose it for a trip to the Lowry theater.It was everything previously stated friendly staff very helpful,spotlessly clean,convenient location for everything Salford Quays has to offer all within 5 or 10 min walk.We could see Old Trafford from our window that looked within walking distance.We had breakfast next door at the Beefeater and it was very good value for money again very helpful friendly staff with a lovely view of the canal.I will stay here again and for a day or so longer as the area has a lot to offer and the hotel is a good price for a great experience.","title":"“Good Location.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 January 2013","sleepQ":5,"rooms":4},{"text":"I chose this hotel because I had stayed here before when I last had to come to Salford. It is right on the Quays and affords you great views if you are on that side of the hotel, which I was. This time there was scaffolding up and some building work going on but it didn't impact on the size of the car park, the noise at night or in the morning. Check in was as effortless as always, the staff are welcoming without being boisterous - a good balance to strike in my humble opinion. The location is less than a £10er by taxi to my meeting location and I can park my car here during my meeting. The bed let them down this time but it was only my side and I didn't complain badly. I just commented. It kept making a clonking noise as I moved about during my sleep. The other side of the bed was not affected in the same way, so I knew it wasn't me. Apart from that everything else was great. The breakfast was enormous. I am now on a low fat regime due to medical reasons and I had eggs on toast, museli with yoghurt and coffee. I reckon I was stuffed and had only shoved in around 500-600 calories but more importantly under 10g of fat which is my max allowance for meals. The fact I have this strange dietary need was not even a problem because I could help myself to a very wide range of produce. We had some athletes behind us that commented on the healthy nature of the breakfast and some trade union members on the other side of us loving the slap up fried foods. Everybody seemed happy and replete and it represents great value for money. All in all a good stay, again. I will return. Well done Premier Inn.","title":"“A hotel that suits me down to the ground”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 January 2013","sleepQ":5,"rooms":5},{"text":"Myself, my son and father in law stayed here last night for a Man Utd game. The hotel is perfectly located for Old Trafford which is a 10-15 minute walk. Our receptionist was charming and helpful and checking in was fast and pleasant. Our room was a quad which had a double and two pull out single beds which were comfortable enough. There was a 40\" TV on the wall and tea/coffee making facilities. Our room was very clean and smart and had a great bathroom with a powerful shower. Part of the hotel is being refurbished but this did not detract from our stay. Next door is the Quay bar/pub which has Beefeater above it. We found both very pleasant, the bar for some post match beers and the Beefeater for the breakfast which was also very nice. We had a great stay and will stay here again when we come up for our next game. Room Tip: Ring a few days before you arrive to ask for a Quay view. See more room tips","title":"“Great service and location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"27 January 2013","sleepQ":4,"rooms":5},{"text":"stayed here last night. finding it was easy, check in smooth, staff helpful and pleasant, room and bathroom spotless. had a meal in beefeater next door great service and food. went to the lowry, back to hotel then time for bed. this is where I feel their good night guarantee failed - the bed was too hard we both ended up with backache, the bathroom fan hums quietly through the night, the heater in the room clicked periodically for about an hour. there was a choice of pillows but they felt like cheap pillows. I didn't doze off till about 3.30am and woke at 6.30! I wrote my comments on the guest card and handed it in when we checked out. bloke on reception never questioned did we sleep well. now we have stayed in premier inns before and chose here because of past experiences with premier inns particularly the beds being comfy with lovely pillows and seem bigger than your standard double, which in all fairness the bed size last night wasn't the issue. Staff ad location can't be faulted big let down was the comfy factor! Room Tip: we were on high floor and lift broke but that couldn't be helped. take ear plugs as it was a bit... See more room tips","title":"“great hotel”","location":5,"service":5,"value":4,"cleanliness":5,"date":"27 January 2013","sleepQ":1,"rooms":5},{"text":"Very positive experience in this hotel everything went smoothly from the moment we entered reception. Close to The Quays theatre and Old Trafford and less then a 10 minute drive to the Trafford Centre.","title":"“Excellent overnight stay and breakfast. Jan 2013”","location":5,"service":4,"value":4,"cleanliness":5,"date":"9 January 2013","sleepQ":4,"rooms":4},{"text":"stayed here for 2 nights with freinds.check was sraight forward very helpfull and chatty man. rooms where very clean we had a family room 8 on ground floor,well suited for a family of 4 very comfy bed plenty of pillows and towels. after a good nights sleep we had breakfast in the pub next door it was very good self service full english eggs where cooked to order all the food was hot and fresh. we also had dinner here on the 2nd night which again was good value. staff in both the pub and hotel were very freindly and helpfull. a short tram ride to city center. will sure use this hotel again. Room Tip: the family room we had room8 ground floor was very good never heard a thing and this was newyears ev... See more room tips","title":"“great place to stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 January 2013","sleepQ":5,"rooms":5},{"text":"Normally we quite like premier inns and have stayed in many and always found them clean and comfortable. This one however was not. The sheets had blood stains on them which I think is unacceptable and the room smelt very damp. They knew from our booking that there was 2 of us staying but had only provided one set of towels. The bathroom was clean so one good point. The breakfast was over £8 each and was provided in the adjacent beefeater. It was APPALLING. We actually cancelled our dinner reservation for that evening because of it. The plates were so filthy, not only could you see the dried on food on the plate but feel it all over it on the top and bottom. I suggest the dishwasher gets changed!! The food was running out and what was there was obviously left out for a long time...The scrambled egg had dried onto the hot plate. Again I think this is totally unacceptable for 2 breakfasts that cost over £16! Won't be staying here again! Room Tip: Holiday inn express was a much more pleasant stay See more room tips","title":"“Glad it was only one night!”","location":3,"service":4,"value":2,"cleanliness":3,"date":"1 January 2013","sleepQ":3,"rooms":3},{"text":"Premier Inn, top on as usual at salford Quays. We went to see White Christmas at the Lowry Theatre. The Premier Inn was a ten minute walk and next to it is a Beefeater Restuarant. Great value for money, staff excellent in both.","title":"“Night out to see a show.”","location":4,"service":4,"value":4,"cleanliness":4,"date":"31 December 2012","sleepQ":4,"rooms":4},{"text":"In Brief, Great receptionist, extremely helpful, beefeater, excellently cooked steaks to perfection, room very nice , flat screen tv with freeview, quiet, superb breakfast, and every single member of staff extremely helpful and explained everything full, and oh, great beer!!. Price could be a bit better though, and should offer 'free' wi-fi in my opinion.","title":"“Great accommodating Hotel”","location":5,"service":5,"value":3,"cleanliness":5,"date":"24 December 2012","sleepQ":5,"rooms":5},{"text":"Excellent price of £19. Friendly reception staff. Short ride on the tram into Manchester for shopping and Chinatown. Vibrant atmosphere. Clean and warm rooms right by the quayside. Beefeater next door for breakfast Parking. Convenient for the Lowry centre and Imperial War Museum.","title":"“Just the job!”","location":4,"service":4,"value":5,"cleanliness":4,"date":"24 December 2012","sleepQ":0,"rooms":4},{"text":"A warm greeting on arrival. The receptionist couldn't be more friendly or helpful. Showed us the local attractions and booked us a taxi and then chased it when it was late.Room was spotless but would be better with a shaver point in the bathroom.","title":"“spudhirst”","location":4,"service":5,"value":5,"cleanliness":5,"date":"18 December 2012","sleepQ":5,"rooms":5},{"text":"Stayed for one night for a concert. Upon arrival we had a warm welcome from a friendly receptionist. The room was clean and comfortable with good facilities, everything you will need for a short stay. I booked a double room for my self, but had another last minute guest staying with me, it was not a problem and was not even mentioned. Pros: Convenient Good Price Comfortable room & bed Good location easily accessible by tram Friendly staff Cons: Only 30min free Wi-Fi Water pressure in the bathroom taps was very low... Not much more than a dribble Highly recommended for a short stay. Room Tip: A room on the back of the hotel offers a view of the Quay if that is your thing. There is currently... See more room tips","title":"“Very Good”","location":5,"service":5,"value":4,"cleanliness":5,"date":"10 December 2012","sleepQ":5,"rooms":5},{"text":"Staff very friendly , plenty chat andt they enjoy people being there,great location to Salford ,media city and Old Trafford.Old Trafford tour well worth £16.00: trams every 10/12 mins £ 2.80 return to city centre ..","title":"“More than what was expected”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 December 2012","sleepQ":0,"rooms":5},{"text":"Stayed for two nights with two grandchildren. Stall from reception on were very friendly and kind. Room was spotless as was bathroom. First time here but a bonus is it is next to Watersport centre so plenty of activity and only five minute walk from Lowry Outlet centre and within easy tram access to centre of Manchester. Breakfast at Beefeater Resturant next door was excellent but evening meal menu for grill was very limited, staff were very friendly but if required resturants in Lowry Centre. Will go back. Room Tip: We were in aeven number room facing front road but would think ones looking over quays would be nice... See more room tips","title":"“Great hotel, great situation.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 December 2012","sleepQ":5,"rooms":5},{"text":"Stayed for two nights in November 2012 as a family of four - 2 adults & 2 children. After a 5 hour drive we were warmly welcomed by the friendly and efficient Gemma, who assisted us through the check in procedure, which was a breeze. The hotel room was clean, tidy and suitable for our needs. Plenty of storage was available, as was tea / coffee and also a large flat screen TV with Freeview Channels. We dined in the Beefeater next to the hotel and again this was great, the food was the usual Beefeater fayre and was served in good time by friendly, polite staff who were happy to help with any requests. Overall I would rate this place highly, it's obviously well run by a management team that care about customer service and satisfaction. Just be aware that their prices when events are on can be a bit steeper than usual, also WiFi reception in our room was hit and miss, however, that wasn't really an issue for us. Booked another 2 nights here in December 2012 so hopefully will receive the same standard of service, also I'd prefer a view over looking the water this time and not the car park :-) Thanks....","title":"“Great Hotel, Great Location.”","location":5,"service":4,"value":3,"cleanliness":5,"date":"2 December 2012","sleepQ":5,"rooms":4},{"text":"Booked for 2 nights. We had room 31 which was overlooking the quay. This was our first time at a Premier Inn and to be honest I was a bit worried it would be basic and a bit of a let down. We were wrong! We were very impressed with the room. It was extremely clean and comfortable, especially the bed. The room had a large flat screen TV on the wall with all the freeview channels. They have WiFi available (first 30 minutes free). There is tea and coffee making facitlites in the room. The bathroom was spotlessly clean.The staff were all extremely polite and helpful, nothing was too much bother for them. The Beefeater is right next door and we had the full breakfast on both days. The breakfast was self service and a really good selection, kept us nicely filled until lunchtime! If you're looking for a budget hotel and a bit sceptical don't be. Room Tip: We had room 31 which was overlooking the quay and our son and his family had 16 which was overlookin... See more room tips","title":"“Good weekend stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"26 November 2012","sleepQ":5,"rooms":5},{"text":"Stayed in the hotel for 2 nights for a match. Room was very spacious and clean all amenities needed were provided. Bathroom spacious and shower had good power. Wi fi was not working, kettle would not switch off even when boiled. Room temperature was not working properly and told reception and asked for extra blanket but none was available. breakfast can be got in the restaurant door but can only avail of full breakfast or continental, it would be nice to be able to just order something smaller if not that hungry. Overall great hotel though and Will be back.","title":"“Great location, very clean and comfortable rooms.”","location":5,"service":4,"value":4,"cleanliness":4,"date":"26 November 2012","sleepQ":0,"rooms":4},{"text":"Missed out on the real bargain but got discount all the same. room was £52.00. shame we didnt get a view over the water that's what I was hoping for. Got the view over the car park. not much to see there and also a bit noisier. There was some building work going on. but overall experience pretty darn good. plenty to do and see round there. we were there for a recording of a TV Show at Media City UK in the evening and took in the rest of the area the next day. See Salford Quays.co .uk. I Think...... See other reviews that people have put on they all have something good to say.","title":"“Good nights stay.”","location":5,"service":5,"value":3,"cleanliness":5,"date":"23 November 2012","sleepQ":5,"rooms":5},{"text":"Stayed at this hotel Thursday 15 November , managed to get premier in deal at £19 what a great deal, spotless rooms , fantastic wall mounted tv and a superb view of sunrise over the waters from our window, really helpfully polite staff and a location next to a shopping outlet, this hotel will take some beating for price paid, also your about 5 mins from football ground and Trafford Center shopping ( via car)","title":"“&pound; 19 bargain”","location":5,"service":5,"value":5,"cleanliness":5,"date":"19 November 2012","sleepQ":0,"rooms":5},{"text":"My wife and I were in Salford for three nights opera at the Lowry Centre and the Premier Inn proved to be an ideal place to stay - a pleasant 10 minute walk along the waterfront to the theatre, a 5 minute walk from the tram stop to take us into central Manchester. The room was clean and comfortable, though it was a bit of a disappointment that, having booked a twin room, we found a double bed and a made-up couch. It was also a bit noisy, both from the extractor in the bathroom and rather poor sound insulation from neighbouring rooms. But these are relatively minor quibbles; all the staff tried very hard to please and we enjoyed our stay very much","title":"“Opera trip”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 November 2012","sleepQ":3,"rooms":4},{"text":"The rooms have been recently refurbished, and the bed was comfortable. There was a large screen TV with an excellent picture and Freeview channels. So why not 5 stars? (This is really a 3.5 despite all the good things about it.) The very noisy fan in the bathroom, together with the absence of a shaver socket (which meant I couldn't plug in my little night light), really put us off. Our room had no divan as shown in the pictures on this site; instead it had a big empty space, with no pictures on the wall, so the space actually detracted from the atmosphere rather than contributing to comfort. That said, we asked for a quiet room and were given one overlooking the water that was very quiet. It was convenient, but I might try another convenient hotel next time I was staying over.","title":"“Good night's sleep but rather Spartan rooms”","location":4,"service":5,"value":5,"cleanliness":4,"date":"9 November 2012","sleepQ":5,"rooms":3},{"text":"Does what it says on the tin great value well appointed clean rooms very friendly helpful staff, only down side is plastic food in beefeater next door. But you get what you pay for so can't complain . As a base to visit the Quays you can't go wrong.","title":"“Great value and location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"7 November 2012","sleepQ":0,"rooms":5},{"text":"Went down on Friday 2nd November as we were attending the Man Utd v Arsenal game at lunchtime on the Sat. Checked in with a minimum of fuss and had a room on the first floor which was clean and comfortable. Staff on duty were very pleasant and friendly. We had our evening meal on Friday and our breakfast on Saturday at the adjoining Beefeater. The staff on duty on the Friday night were very good as were the staff on Saturday at Breakfast. The food on offer was good and unlimited chips if required with your evening meal. Would make a point of staying there again if down in Manchester. Room Tip: We were on the first floor overlooking the Quay. Very quiet. See more room tips","title":"“Great base for a short stay.”","location":5,"service":5,"value":5,"cleanliness":4,"date":"5 November 2012","sleepQ":5,"rooms":4},{"text":"Stayed here when we went to the Muse gig at the MEN. Ideal location for the Lowry, Imperial War Museum and much more. Short walk to tram stop and had no need to use the car for a couple of days as hotel had parking. Although we did go into the city there are various restaurants within walking distance. Room was large, lovely and clean and the staff were all very helpful. The hotel is currently having an extension built but we heard no noise.","title":"“Ideal for visiting Manchester”","location":0,"service":0,"value":0,"cleanliness":0,"date":"3 November 2012","sleepQ":0,"rooms":0},{"text":"Spent one night here whilst visiting the Imperial War Museum.Ideal location by the river. Staff excellent especially young lady on reception. Nothing too much trouble , very helpful. room spotless no complaints even had a view of Quays. Breakfast excellent in nearby pub. Good choice and plenty to choose from. Big thank you to all at this hotel .","title":"“Enjoyable night in salford”","location":5,"service":5,"value":4,"cleanliness":5,"date":"2 November 2012","sleepQ":4,"rooms":5},{"text":"We stayed at the premier inn on Salford Quays for a birthday treat, and forget staying in the city centre, this hotel has the ideal location. Once parked up we didn't use the car again until we set off for home.It is in walking distance of the Lowery Centre, and the tram into the city centre, so the best of all worlds. The hotel was clean and the rooms were exactly the same as most premier inns, the staff were most helpful and the Beefeater restaurant was again what you would expect. The only downside was the breakfast is not a buffet exactly as you have to order what you want, the flip side to this is that it is fresh and not sitting around, and the restaurant is located upstairs, a short walk from the hotel- ok if the weather is fine. All in all though good value for money and well worth a visit.","title":"“Great Location”","location":5,"service":4,"value":4,"cleanliness":5,"date":"1 November 2012","sleepQ":4,"rooms":4},{"text":"Just returned home after a one night stay at Salford Quays - everything was excellent .Staff very helpful even printing a map of the area for us to enable us to get around easily. Room was spotless as was the bathroom. We found the Beefeater a bit dear after 6pm but good deals if you book before .Breakfast was good - nice to be waited on. We are now busy browing your website for a good deal for next year, or before.","title":"“fantastic stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 October 2012","sleepQ":5,"rooms":5},{"text":"We spent 8 nights in this hotel earlier this month for a business trip. This hotel has been recently renovated and our room was very nicely done. Nice flat screen TV on the wall, good bed, well-appointed bathroom - all very clean. The location is fantastic with The Lowry Entertainment Center and shopping mall, Imperial War Museum, Manchester United, pubs/restaurants and the tram into Manchester City Centre all within easy walking distance. We arrived several hours before the check-in time, tired from our overnight flight from the US and the staff were so accommodating and were able to get us into a room very quickly. Special thanks to Lauren, who cheerfully and patiently dealt with the fact that my US bank decided they didn't want to let me use my credit card in the UK! Every member of the hotel staff that we interfaced with was very professional, extremely helpful and made staying here a pleasure! This hotel clearly is a well-managed establishment. We will be back! Room Tip: Rooms on the south (facing the water) are very quiet and have lovely views. See more room tips","title":"“Great facility in great location with fantastic staff!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 October 2012","sleepQ":5,"rooms":5},{"text":"We stayed here for one night as we had a wedding in Manchester and decided to do a shopping trip and lego discovery center the next day. Initially I was worried as we had received an email a week before telling us there would be building work to the hotel and there may be noise during the day. We were given a lovely quay side room and we did not encounter any noise problems! The room was spotlessly clean, comfortable bed and checked in by Jim who was very thorough and did not rush us. Breakfast was fabulous in the lovely beefeater next door. All hot and service was fantastic. The young waitress even went and brought me my own little dish of tomato as the bain marie wasnt quite ready and I had said to her not to worry but she still did it anyway. Very clean pub and lovely views of the bungee jumping club which we sat and watched. Great stay and would definitely stay there agin. Room Tip: I would have choosen a top floor as you do get noise from above if in an underneath room. Also our q... See more room tips","title":"“Fabulous”","location":5,"service":5,"value":4,"cleanliness":5,"date":"29 October 2012","sleepQ":5,"rooms":5},{"text":"We stayed here last Thursday having booked an advance room at a great value rate. We arrived well ahead of the check in time but were pleasantly surprised that the room was ready and we were able to check in straight away. This Premier Inn is smaller than others I have stayed in and the staff were friendly and helpful and always greeted us when we left or arrived. Typical Premier Inn room - clean, comfortable and with a modern bathroom. There is so much to do around Salford Quays and the hotel is at the heart of it and a short walk away from most attractions. There was some building work going on at the time but this did not disturb us and was only done during office hours. The hotel had also emailed to advise us of this before our stay. All in all a good stay. A couple of minor observations - the water pressure from the bathroom tap was very low and the heating was less effective than in more modern hotels. Try to get a river view room if you can, ours was on the other side of the building but I suppose you have a 50% chance in a riverside hotel, and for £29 we are not complaining!","title":"“Another Good Experience at Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 October 2012","sleepQ":5,"rooms":4},{"text":"Just back from a one night stay at this hotel and for £84(booked on the internet) I thought that it was very good value for money.The rooms were quite large with up to date bathrooms,all very clean.The room also had a large flat screen tv and facilities for making tea and coffee.The staff were most helpful and polite.Salford Quays is a great place to visit,there is so much going on!We went to the Lowry exhibition(5 minutes away) which was most enjoyable and interesting.We eat at the Beefeater next door to the hotel,a very good menu and reasonably priced.I can thoroughly recommend this hotel for a short stop over. We have recently returned from a holiday in France and I can assure you that this hotel was far better than any we stayed at on our holiday and the price was a great deal less.It is a shame that they don't have Premier Inns in the rest of Europe.","title":"“Very comfortable and a great price”","location":5,"service":5,"value":5,"cleanliness":5,"date":"15 October 2012","sleepQ":5,"rooms":4},{"text":"Excellent location. Everything one would expect from a premier inn. Beefeater restaurant overlooking the quay served excellent food. Within walking distance from the Imperial War Museum North where we spent several hours. Tram into Manchester was fast and efficient. A thoroughly enjoyable stay.","title":"“mini break”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 October 2012","sleepQ":5,"rooms":5},{"text":"Had an overnight stay at this Premier Inn in September. We had booked dinner and tickets to see the musical Cabaret at the Lowry and were running very late due to sevearl motorway closures. The booking in process was quick and effortless having told the girl at reception that we had minutes to spare. Room was excellent. There was building work being done but that didn't disturb us at all. Breakfast served in the restaurant next door was excellent and we had a good view of the river. Would stay here again if in this area.","title":"“Perfect position for visiting the Lowry”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 October 2012","sleepQ":5,"rooms":5},{"text":"A little way out from Manchester City Centre, Salford Quays is a great location for this Premier Inn, and only a short walk from the nearby Lowry Centre. I stayed on business, as I was presenting at a conference in the Lowry, and the location, cleanliness and quality of sleep were all conclusive in ensuring a good night's sleep and a good result the next day. Recommended.","title":"“Great hotel in oustanding location”","location":3,"service":4,"value":4,"cleanliness":5,"date":"3 October 2012","sleepQ":5,"rooms":4},{"text":"Salford Quays is easily accessed by tram from Manchester Piccadilly so is perfect for train travellers. On the doorstep for visits to Old Trafford and the Lowry Centre (both must-see). The hotel is prettily and quietly postioned on the Quay, is immaculate (newly refurbished), the staff are professional, welcoming and friendly, and the breakfasts and dinner we had at the Beefeater adjacent were excellent. Room Tip: 3rd Floor overlooking the Quay See more room tips","title":"“Perfect hotel for a weekend break in Manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"28 September 2012","sleepQ":5,"rooms":5},{"text":"Very friendly staff, clean room, nice area would stay again. Choose hotel for the location and wasnt disappointed. Booked a twin room but was given a double and a single bed I was in room with cousin I got double bed so was happy in end up. Tried beefeater next door service was good but food was ok didnt go back had a better meal in hungry horse up the road.","title":"“Good location”","location":5,"service":5,"value":4,"cleanliness":5,"date":"25 September 2012","sleepQ":0,"rooms":5},{"text":"Normally when we visit the area, we stop at higher brand hotels, but found then a little expensive this time for some reason, so chose the Premier Inn based on trip advisor comments. The hotel is well placed, very clean and comfortable. Having a free open cvar park is for me a real benefit as comming from the Netherlands, I drive a left hand car and its a problem with ticket machines. We had a top floor room that was modern, clean and comfortable. The beds are quite high, but extremely comfortable and well placed for the large LED TV. Similarly the bathroom was spotless, however being a top floor, the shower, whilst adequate could not be described as a \"power shower\". Breakfast next door at the Beefeater was very good value, with the cooked part being prepared to order and truely \"limitless\". Staff were helpful and attentive. Much better than some local \"top\" brand hotels with buffet service at 2 x the price. The only \"fault\" I found was regarding the internet. Yes they offer free 30 mins per day, but only in the reception area which is not ideal, and if I was taking up the offer of £3 for 1 days internet, I would expect WiFi in my room . Note most people now use WiFi travelling, not cable. I am a convert to this hotel and will be returning, but at £99 for a night I would not decribe it as a budget hotel Room Tip: Top floor rooms give good views. Might get WiFi in lower or groud floor rooms See more room tips","title":"“Pleasantly surprised, would recommend and return”","location":5,"service":5,"value":3,"cleanliness":5,"date":"19 September 2012","sleepQ":5,"rooms":5},{"text":"just to say we have stopped at this hotel a couple of times now and all ways been made so welcome by all of Sharon's staff :-).. with a lovely room over looking the quay. to say we are retuning again 22 Nov to celebrate my wife's birthday and look forward to seeing them all again. mick n max bailey stoke Room Tip: oh got to be the views over the quay See more room tips","title":"“returning again”","location":5,"service":5,"value":5,"cleanliness":5,"date":"17 September 2012","sleepQ":5,"rooms":5},{"text":"Chose to stay here for a short break in Manchester - the staff were very welcoming and able to provide us with directions to all the places we wanted to visit as well as telling us about others that we hadnt discovered. The room was really clean and comfortable - Beefeater next door was Ok - service a little disappointing- but did the job! We will definitely stay here again when we return to Manchester.","title":"“great location - excellent staff”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 September 2012","sleepQ":5,"rooms":5},{"text":"Rooms & hotel ok, but we were woken by an alarm call we hadn't ordered very early on a Sunday morning which disturbed the kids so nobody got back to sleep. Then had to wait ages to be served for breakfast & when it arrived the poached eggs were like bullets and the veggie sausages which sounded so nice on the menu turned out to be like burnt, dried-up cheap stuffing. Couldn't get anyone's attention to rectify it so gave up. Really disappointing.","title":"“Breakfast appalling”","location":4,"service":2,"value":3,"cleanliness":3,"date":"12 September 2012","sleepQ":2,"rooms":3},{"text":"During an annual visit to Manchester we chose to stay at this hotel. The room was lovely and the fact that the Beefeater was next door proved very useful. The metro is also very close by providing useful links to many parts of Manchester. During our trip a member of our party became ill and the receptionist and hotel staff were very helpful in providing support and reassurance during this time, which we greatly appreciated. We would recommend this hotel to anyone.","title":"“Lovely location and helpful staff”","location":4,"service":5,"value":5,"cleanliness":5,"date":"11 September 2012","sleepQ":0,"rooms":4},{"text":"We booked here as we were going to a recording in Media City (BBC) which was most convenient. Hotel fine, staff very helpful and friendly, Beefeater restaurant located next door, and again staff friendly and helpful, especially the breakfast waitress. Breakfast was good, had both full cooked and continental, which included porridge, well worth the price. Quite quiet on the quays by the hotel during the evening, watched the children learning to canoe, sail and wind surf most mornings. Walked along the water towards the Lowry Mall and Media City where there is more happening and nicely lit up. Tried the Harvester but were not very pleased with the service or our meal, so went back to the Beefeater where we knew it would be good. Trams rang close by to the hotel and for £4.50 had an extensive ride around all day. Went to Manchester City centre by tram which was the best option, good for shopping as there is an Arndale Centre where all the units are open for business, not like our home town where a lot have closed down. Good location for a day trip to Blackpool or the Derbyshire High Peaks.","title":"“Manchester BBC”","location":4,"service":5,"value":5,"cleanliness":5,"date":"3 September 2012","sleepQ":5,"rooms":5},{"text":"Excellent value hotel with spacious well equiped room but the best feature was the warm and friendly welcome from all the staff. Breakfast next door at the Beefeater was also extensive and of good quality. Room Tip: Ask for a room overlooking the Quay for views of the water sports during weekdays. See more room tips","title":"“excellent value”","location":4,"service":5,"value":5,"cleanliness":5,"date":"3 September 2012","sleepQ":5,"rooms":5},{"text":"My family and I stayed for 2 nights and we were very happy with all aspects of our stay. From the warm welcome we received to the immaculately clean room, we were not left disappointed. The Premier Inn Salford Quays provided excellent value for money. Everthing that you would expect in a hotel room was available - tv, hairdyer, fan, free parking, 30 minutes free wi-fi and about £3 thereafter, even a choice of pillow - all for an amazing £29 per night! Who could complain? We ate at the Beefeater next day and took full advantage of their Breakfast Offer, where \"Kids eat Free\". The breakfast was extensive and good quality. The service was again friendly and welcoming. The Hotel is an easy ride on the tram into Manchester or you have the Lowry Museum, Imperial War Museum (all free entry), Media City, Old Trafford within a 10 minute walk away, as well as the Outlet Shopping Centre just along the Quay. One side of the hotel faces the Quays where the busy watersports club provides a lot of things to look at. I cannot recommend the hotel strongly enough - there are plenty of other hotels who charge considerably more for their rooms - who could learn a lot from Premier Inns. We'll be back! Room Tip: Quay facing rooms a probably the quietest. See more room tips","title":"“Excellent Value”","location":5,"service":5,"value":5,"cleanliness":5,"date":"31 August 2012","sleepQ":5,"rooms":5},{"text":"Ideal location with restaurants nearby & Louvry shopping Ctr a 5 min walking distance. Ample car parking & staff were very friendly. A 20 min drive to the old Trafford Ctr for all the shopping you can do . Would highly Recommend the stay","title":"“Brilliant Short stop over!”","location":4,"service":5,"value":5,"cleanliness":5,"date":"31 August 2012","sleepQ":0,"rooms":5},{"text":"I stayed at the premier inn Salford Quays 28th and 29th August 2012. I was made to feel welcome from the moment I walked in the door, excellent service. The room was outstanding very clean and fresh, it also had a 32\" TV absolutely first class, there is a beefeater restraint next door that serves excellent food, it also has a patio area that over looks the canal, your also only a few minutes away from a tram station (harbour city) that will have you in Manchester city centre in 15 minutes, the area of the hotel is very nice. I would also like to thank premier inn for making my stay very relaxing and making me feel at home. Thank you Gary T","title":"“Fantastic”","location":0,"service":0,"value":0,"cleanliness":0,"date":"30 August 2012","sleepQ":0,"rooms":0},{"text":"Spent 4 nights at the premier Inn at Salford Quays. Hotel very clean and the staff very friendly. They also knew the local area. Ideal setting to allow travel to and from different amenaties, 5 minute walk from trams which run regularly. Nice area just for taking a strole, This premier is not over large and is set in a quiet area. We both enjoyed the stay.","title":"“Visit to manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"27 August 2012","sleepQ":4,"rooms":4},{"text":"Everything you expect from a Premier Inn... The hotel has just been refurbished and my room was clean and fresh with a nice view over the water. All the staff i encountered were OK but didn't really seem to care about my stay a great deal. Will stay again next time i am in the area. Room Tip: Ask for a rom overlooking the water. The other rooms look over the car park which isnt quite as nic... See more room tips","title":"“Good Refurbishment”","location":5,"service":3,"value":4,"cleanliness":5,"date":"27 August 2012","sleepQ":5,"rooms":5},{"text":"We stayed at the Premier Inn, Salford Quays for three nights in June 2012. Although the location was excellent, right on the waterfront of Salford Quays with easy access to all the facilities on the Quays, the hotel itself was a disappointment. The ambience of the entry foyer was dull and not inviting. The rooms were the same, plain and dull. We had continually trouble with the electronic room keys which refused to function consistently. We had to go down to the Reception several times EACH day to have them revitalised or whatever it is one does with inoperative electronic keys.","title":"“Disappointing hotel, excellent location.”","location":5,"service":4,"value":3,"cleanliness":3,"date":"23 August 2012","sleepQ":3,"rooms":3},{"text":"This is the third time we have stayed at this hotel. Yet again great friendly and helpful staff. In a really good area where restaurants, bars and Vue Cinema are within easy walking distance at the Lowry Shopping Centre or near the tram stop just round the corner. Easy access into the centre of Manchester by tram which can be caught close by. Within walking distance of Old Trafford and the Imperial War Museum. A short ride by car to the Trafford Centre. When we stopped could also take a boat trip from the Quays to Liverpool which always seemed packed. In a really nice area which is very clean and tidy. Breakfast buffet good value for money at the Beefeater restaurant next door with lots of choice. Meal also good at night and staff very friendly and effecient. When visiting Manchester for shopping/football will definitely book this hotel yet again. Room Tip: rooms overlooking the Quays have a better view. See more room tips","title":"“Our third stay and a great one again!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"21 August 2012","sleepQ":3,"rooms":4},{"text":"Had a great one night stay whilst on a shopping trip to Manchester. On arrival staff at reception were very friendly and offered directions to anywhere we wanted to go. Room overlooked the car park and was very spacious and clean. Had a great night's sleep - very warm but there was a fan provided in the room. All staff who we spoke to were bubbly and enthusiastic and couldn't have been more helpful. Great if visiting for football or shopping - Trafford Centre just under an hours walk but great bus service, Lowry centre right on doorstep. Plenty of eating places.","title":"“Great Stay at Salford”","location":5,"service":5,"value":5,"cleanliness":5,"date":"20 August 2012","sleepQ":5,"rooms":5},{"text":"We really enjoyed staying at this hotel. Mostly because of the staff, as they were patient and very helpful. For example, when the weather was quite hot and some members of our party were struggling to sleep, we informed reception of this and we were offered extra fans and different bed sheets. The staff were also very helpful when we asked them for directions into town. There was a wide selection of foods on offer at breakfast time, which we were very impressed with. The waiter never took a long time to come and take our cooked breakfast order and the waiting time was very short for the cooked breakfast to arrive. The rooms were very clean, tidy, and there were no faults in our room at all. I recommend this hotel, and will probably be visiting again in the future. Room Tip: If you are visiting in summer, and it is hot, the rooms on the ground and first floor are cooler. See more room tips","title":"“Great stay in Salford Quays.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"19 August 2012","sleepQ":4,"rooms":5},{"text":"We stayed at this hotel for one night in August to visit Old Trafford for the quarter finals Olympic football. A great weekend was had by all. The hotel was clean and had recently been updated, so everything felt new and fresh. The room was a very good size overlooking the quay. We had a really good night's sleep, very quiet and relaxing. Staff at the hotel were extremely friendly and approachable. The car park was busy and we only just managed to get spaces but I am guessing it was so busy because of the football. We paid for the £22 meal deal, which includes a three course meal and drink in the Beefeater next door and also a cooked breakfast. The staff at the restaurant were excellent, very helpful and knowledgable, the food was good, there were eight of us in all, we all enjoyed the food. Our only negative was the coffee in the morning, it wasn't very hot and it wasn't a Costa Coffee machine like some of the Premier Inn Hotels have access to. The hotel is ideally located for Salford Quays shopping and the Lowry. The Imperial War Musuem is a short walk and across the bridge. Old Trafford is a little further but still only a ten minute very pleasant walk over the bridge You can get a tram into Manchester City Centre which we've done previously, however we took the car into the city the next day and then drove straight home. All in all a really good stay, we would definitely stay at the hotel again if we're going to Old Trafford or the Lowry again.","title":"“Very handy hotel”","location":5,"service":4,"value":4,"cleanliness":5,"date":"17 August 2012","sleepQ":5,"rooms":4},{"text":"Great location for the Quays area. We had a family room which was was very clean, spacious and excellent value (big tv too!). You can easily walk to everything in the Quays including the Lowry and restaurants like Wagamama and Pizza Express. The metrolink stop is close by for exploring Manchester City Centre and parking is free. Staff were very friendly too. Overall very pleasing.","title":"“another good stay at a premier inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 August 2012","sleepQ":4,"rooms":5},{"text":"Fantastic warm welcome from Sharon. She was able to recommend a breakfast/dinner deal and explained what was in the local area. The rooms were very nice and extremely clean. There was a 32\" TV in bedroom which was a nice surprise as we stayed during the Olympics. Nice location, lots within walking distance. I would recommend this hotel to others.","title":"“Very good!”","location":5,"service":5,"value":4,"cleanliness":5,"date":"13 August 2012","sleepQ":4,"rooms":5},{"text":"Fantastic location right in the heart of Salford Quays and only a short stroll to the Lowry gallery and Media City. A very warm welcome from all the premier inn staff, particulary Leanne. Luckily we enjoyed a sunny couple of days, just wish they had air conditioning in the rooms!","title":"“Certainly hot in Manchester!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 August 2012","sleepQ":4,"rooms":5},{"text":"We stayed here for 1 night on a £29 deal after a visit to the beautiful Lowry Theatre. The check-in was very pleasant, and helpful.The bedroom and bathroom were lovely with plenty of space for the 3 of us ,with a large flat screen t.v.,We ate at the Beefeater, and got a very good deal for our child, The breakfast was very nice with lots of choice, and children eat free, lovely views and a very nice area. We were well impressed, and will visit again.","title":"“IMPRESSED”","location":5,"service":4,"value":5,"cleanliness":5,"date":"12 August 2012","sleepQ":5,"rooms":5},{"text":"What a little gem this hotel is. Amazing location with so much in walking distance. We sayed here to visit an cbeebies event held at media city. We had a warm and friendly welcome from Sharon at reception and the check in was quick and simple. Our children's beds were out and made up and they loved the television!! The room was spotless and we all had a great nights sleep. We had our evening meal at the Beefeater next door and as parents we were really impressed with the children's menu and choice. Again a great location, as we were able to watch people saling whilst we ate our meal! The breakfast (also at the beefeater) was great value for money and we loved \"the kids eat for free\". There was plenty of choice and the the staff here were really helpful, especially with our children! Back to the hotel, Sharon helped us with all sorts of local knowledge and we were able to even squeeze in some shopping at the outlet mall! We would definitely stay here again and would recommend it to anyone. Our little ones (Gracie and Albie) have since told us they want to live there!!!!","title":"“A perfect stay!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 August 2012","sleepQ":5,"rooms":5},{"text":"A very well located hotel, close to Old Trafford, comfortable rooms and best of all very friendly and helpful staff. The restaurant was good and again staff were great! Recently refurbished rooms, which were clean and comfortable.","title":"“Olympic football”","location":5,"service":5,"value":4,"cleanliness":5,"date":"6 August 2012","sleepQ":4,"rooms":4},{"text":"we stayed here for a concert held at the Lowry. Our stay from begining to end was faultless. The staff were the friendliest we have ever come across whilst staying in a hotel (which we do quite often). Our room was clean and comfortable with a lovely view over the quay. The breakfast was of a high standard and freshly cooked. We would definitely highly recommend this hotel and if we need to visit this area of Manchester again i wouldn't even look at anywhere else to stay.","title":"“excellent stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"1 August 2012","sleepQ":5,"rooms":5},{"text":"We had a very warm welcome, and all other staff were equally friendly and helpful throughout our 2 night stay. Rooms are very modern and clean with a huge flat screen TV. Breakfast is a large selection of cooked and buffet style continental. We would thoroughly recommend this hotel as a place to stay in Manchester. Salford Quays is very close to Old Trafford (15 min walk) and a 15-20 min tram ride to the city centre. Salford Quays itself has good places to eat and an outlet shopping centre to wander around. It also has the BBC studios and the Lowry exhibition and entertainment centre. The Lowry is free admission with a £5 suggested donation for families. I would definately stay there again if I wanted to visit Manchester in the future. Room Tip: Only scored average for sleep as we were disturbed by an AA van outside our hotel window. when I men... See more room tips","title":"“A lovely place to sat - so friendly”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 July 2012","sleepQ":3,"rooms":5},{"text":"They say that what makes a hotel better than others is location, location, location. That being the case, then this one delivers in bucket fulls. I needed a hotel for a business trip in the Salford Quays area and came across this little gem. When one thinks of Premier Inns, one thinks of the lower end of the hotel market, not with this one. Superb views, superb location, superb quality rooms and good quality food served next door in a beefeater restaraunt that is in league with the hotel. All in all, a suprisingly enjoyable experience and value for money to boot. Room Tip: Ask for a room over looking the quays See more room tips","title":"“More than what you would expect from a Premier Inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"27 July 2012","sleepQ":5,"rooms":5},{"text":"I'll be the first to admit that the directions provided by the hotel were a bit confusing - if we'd followed them to the letter, we'd have ended up in the drink! Once we found the hotel, though, we were very pleasantly surprised by the quality of the room and the location of the hotel. Our room overlooked the Ontario Basin, and during a short break from the rain, we watched windsurfers attempting to stay upright. The room itself was ultra comfortable - a welcome relief after a week of Travelodges! Very comfortable bed, beautiful sofa bed, huge wall mounted flat screen telly, great shower - we could have stayed for a week! The hotel is about 200 yards from the Metrolink, so we were able to get in to Central Manchester (round trip) for 2 pounds 80. NOTE: The last Metrolink leaves Piccadilly Square at 11:35 p.m. Otherwise it's 12 pounds back in the taxi. This was absolutely the nicest Premier Inn we've stayed in in Britain, and we've been staying in them since 1994. Gemma at the front desk was a great help, and greeted us warmly every morning. As your first impression of a hotel is generally the person at reception, Premier Inns are to be congratulated on hiring someone as cheerful and outgoing as Gemma. Definitely the place to stay if you're visiting Manchester. Top marks all around!","title":"“Nicest Premier Inn yet, and Gemma was a gem”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 July 2012","sleepQ":5,"rooms":5},{"text":"As far as Premiers go, this has been one of our most pleasant experiences. The staff were extremely helpful, friendly and obliging. You couldn't fault the rooms either, with three proper beds (not like the makeshift floor beds you get in Travelodges). The size was very reasonable too, with a massive wall-suspended TV which was fantastic too. The cleanliness of the hotel was also very good, especially considering the hotel was opened 14 years ago in 1996 it has been kept in good presentable condition. The bathroom was a good size too with no chips or holes anywhere. Perhaps the best quality of the hotel is the location, situated right on the quayside, beside the watersports centre. This was perfect for us as we were staying to attend a National Biathle Competition, held no more than 30m away from the hotel. It is also within walking distance from the spectacular Salford city centre, home to the BBC studios, The Lowry Outlet Mall, The Lowry theatre and soon the home the ITV studios too! The breakfast was also as you'd expect from a good premier, thoroughly enjoyable!","title":"“Good stay, Very friendly staff!”","location":5,"service":5,"value":4,"cleanliness":5,"date":"22 July 2012","sleepQ":0,"rooms":5},{"text":"Booked a tour of old Trafford for my boyfriend and this hotel was pretty much on top of old Trafford,had a perfect view from our room with about a 15 minute walk to the stadium. Also jus a five minute walk away is an outlet shopping centre complete with a Vue cinema. Reception staff at premier inn were very friendly (even at midnight when we arrived) room was very clean and very reasonable price.The Trafford centre was only a drive away which is massive!!! All in all a very enjoyable first trip to Manchester would use this inn again","title":"“United”","location":5,"service":5,"value":5,"cleanliness":5,"date":"21 July 2012","sleepQ":5,"rooms":5},{"text":"Like most Premier Inns, it does what it says on the tin. However, I have to give special mention to the very cheery and helpful receptionist, and the spot-on, freshly cooked breakfast at the adjacent Beefeater. For an evening meal, there's a selection of chain restaurants a short walk away along the waterside, one of which is a Pizza Express (also up to par.)","title":"“All as it should be in Premier Inn land...”","location":4,"service":5,"value":4,"cleanliness":4,"date":"19 July 2012","sleepQ":4,"rooms":4},{"text":"Excellant location with value for money hotel that is better than quite a lot of more expensive hotels. Very modern and superbly decorated throughout. Pleasure to stay at the Salford Quays Premier Inn. Well worth a visit.","title":"“First class friendly hotel with welcoming staff.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"17 July 2012","sleepQ":0,"rooms":5},{"text":"This particular Premier Inn has been refurbished since I last stayed and it has really improved the experience. Fresh, clean bedrooms and bathrooms. Lovely large screen (32\" or bigger) television with good sound. As is often the case with Premier Inn, the attached Beefeater restaurant lets it down. This hasn't been refurbished. Time for a new more healthier menu.","title":"“A recently refurbished Premier Inn”","location":4,"service":4,"value":4,"cleanliness":5,"date":"15 July 2012","sleepQ":5,"rooms":5},{"text":"We were seeing a show at the Lowry Centre Lyric Theatre so this was the ideal place to stay, as it is only five minutes walk to the theatre. Our room had been refurbished and was very spacious with views over the Quays towards Old Trafford. Excellent nights sleep with very little noise to disturb the peace even though it is quite a busy area. We will certainly stay again.","title":"“Great nights sleep”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 July 2012","sleepQ":5,"rooms":5},{"text":"Stayed for 1 night whilst attending a concert at the MCR arena, the receptionist (sarah) was very friendly and helpful and gave us bus and tram timetables as well as a map of the area. We had a room on the 2nd floor which looked out over the car park but as the weather was so wet and horrible we didnt care too much for the view. There was no noise whatsoever and there was plenty of room to park outside. We didnt have the breakfast but there is a beefeater next door. The tram stop is only a few mins walk away to take you into the centre of manchester and there is a lowry shopping centre within walking distance. The room was large, clean and had LCD TV, tea and coffee facilites and extra pillows. I cannot fault this premier inn, it was spot on for our trip and great value for money.","title":"“Quiet Premier inn, in the heart of Manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"2 July 2012","sleepQ":5,"rooms":5},{"text":"Great hotel, close to Imperal War Museum, Lowry etc, and easy to find. Good staff, receptionist was very helpful and friendly. Clean, comfortable rooms good breakfast in Beefeater next door, cannot fault this hotel. For price we paid, perfect.","title":"“excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"1 July 2012","sleepQ":5,"rooms":5},{"text":"Friendly staff,huge room,great tv,comfy bed,a bath and shower all went towards a fabulous stay. 2 mins walk from the lowry,imperial war museum and outlets and 15 mins walk from old trafford. Also only a 5 min walk to a tram stop to take you into the city,journey time being roughly 10 mins. Set alongside the lovely Salford quays you may find yourself not bothering about the city centre as everything you need is right on your doorstep,restaurants,pubs,shopping,sport and culture. Take a walk along to media city at night for some great photos of the lit up buildings and bridges. Very laid back and much more peaceful than the city. I loved this hotel and can't wait to go back!","title":"“location,location,location.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 June 2012","sleepQ":4,"rooms":5},{"text":"Could not fault this hotel, lovely and clean, very comfortable, lovely helpful, staff. It smelt fresh and new!. The Rooms were large, had everything you needed too. Restaurant next door was brilliant, very good food, reasonably priced. Defiantely stop again. The Tram line into the city was a 5 min walk. Taxi was £10.","title":"“Could not fault this hotel, lovely and clean, very comfortable, lovely helpful staff”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 June 2012","sleepQ":5,"rooms":5},{"text":"What a fantastic hotel. I stayed in this hotel after a disappointing stay at the etap hotel across the river. It was like night and day. The staff on my arrival (2 hours before check in) were pleasant and got me a room right away as I was soaking wet after being caught in the rain. I was attending bruce springsteen concert that evening and reception gave me details of how to get to stadium and back. I also released on getting to room i didnt have enough towels and they could not have been more helpful. Room was spotless and had well stocked tea and coffee facilities and a flat screen wall mounted tv. The room was huge and in pristine condition.","title":"“Beautiful room”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 June 2012","sleepQ":5,"rooms":5},{"text":"This is a lovely modernized hotel with a scanning card to enter your room and to access electricity. The rooms have large wall mounted TVs. and the staff on reception seem very friendly. On my first night I had trouble with noise above my room, some people had entered the room in the early hours and were causing the metal light fitting to vibrate and rattle. I reported this to reception and was given a room on the top floor,the following day and a nights refund. The Premier Inn Breakfast is always very good value for money, but I thought the Beefeater next door doesn't cater for the person that just wants a cheap snack in the evening, with main meals starting at about £10. The staff on reception did recommend the food court in the Lowry centre, it's just five minutes walk from the hotel and gives you a fantastic choice of low priced food. Overall an excellent hotel! Room Tip: I think it's best to go for a room on the top floor. See more room tips","title":"“Modern hotel”","location":4,"service":4,"value":4,"cleanliness":5,"date":"21 June 2012","sleepQ":4,"rooms":4},{"text":"Stayed here few times over last few weeks as my boyfriend has had few job interviews.. First stay was hurrendous as we could constantly here banging, even at 5am and with a job interview early next morning NOT GOOD. However, the second night was fine.. Turns out all the banging was them refurshiment.. Which is lovely however i would say the hotel is over priced for where its situated. There is a small shopping centre near by but is rubbish full of house shops ..","title":"“Excellent”","location":3,"service":5,"value":3,"cleanliness":5,"date":"21 June 2012","sleepQ":2,"rooms":5},{"text":"Extremely good setting, overlooking Salford Quays, providing interesting spectator views of water sports. I would love to return to enjoy it without wind and rain. Near to good shops and War Museum, BBC Media Centre and providing a clear view of Manchester U. Football Club stadium. Excellent Beefeater next door. Room Tip: Book early! Next time we would ensure that our room had a view over the waterside. See more room tips","title":"“Convenient location”","location":0,"service":0,"value":0,"cleanliness":0,"date":"19 June 2012","sleepQ":0,"rooms":0},{"text":"Salford Quays is in a delightful part of Manchester near the Media Centre. We booked online to get the best deal and then rang up to ask for a top floor room. Ours overlooked the Quays and was very pleasant. Sarah in reception was very friendly and helpful. I had a bad leg and the restaurant (beefeater) next door was very handy. They also do an excellent all you can eat breakfast and dinner combo for £22. Used the Wifi facilities £3 for 24 hours, which run from the time you login, not per calendar day - nice. Room Tip: Top floor rooms are the quietest and have the best view of the Quays See more room tips","title":"“Excellent Value”","location":5,"service":5,"value":5,"cleanliness":5,"date":"19 June 2012","sleepQ":4,"rooms":4},{"text":"Very good stay in this hotel, lovely and quiet and room was very clean and tidy. All in all superb stay and will def stay there again.","title":"“Quality hotel in quality location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"19 June 2012","sleepQ":5,"rooms":5},{"text":"Hotel is in a nice setting, we stayed during the two day bank holiday of the Jubilee weekend, and so it was very quiet. It was particularly nice to see the new BBC home in the Media City park. The hotel was okay for what it is, although we had gone initially to the Trafford Park branch which seemed a lot more plush. The Salford Quays offers the chance to walk around it if you need an early evening or morning stroll. Also the tram into central Manchester is a doddle with the stop not far away from the hotel at all. There is also a Tesco within walking distance on the Quay, with a Morrisons just a 5 minute drive away. Access to the M62 motorway is close enough so exploring the northwest is easy. This hotel provides a very convenient base for Manchester without the hustle and bustle of being right in the thick of the city. Room Tip: We had a room overlooking the Quay which was pleasant. You might prefer to have a room overlooking t... See more room tips","title":"“Escaping the Jubilee celebrations weekend”","location":5,"service":4,"value":4,"cleanliness":4,"date":"17 June 2012","sleepQ":4,"rooms":4},{"text":"Stayed one night on 16th June 2012. Very friendly staff, was greeted by Sarah who was very helpful. The rooms were modern and smelt fresh and clean. Very refreshing. Flat screen tele was a bonus and 5 mins from the lowry. Had dinner and breakfast at the beefeater next dooe it was 10/10. Fresh prepared good quality food with good service. Would reccomend to anyone.","title":"“excellent stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"17 June 2012","sleepQ":5,"rooms":5},{"text":"Stopped here for a single night. 10th June 2012. Warm welcome, free parking, clean, modern room with all the right tech, good bathroom. Good sleep. Good place. Would definitely return if needed to come back to Manchester. Room Tip: Ask for one facing the quays - much prettier than facing the car park. See more room tips","title":"“Premier Inn Salford Quays Manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 June 2012","sleepQ":5,"rooms":5},{"text":"This Premier Inn in fabulous in all areas. The staff are so friendly and helpful - they can't do enough for you and are so knowledgeable about the area. The room was spotless and very roomy and also very modern. The beefeater next door where you have your breakfast is first class - you get your hot breakfast cooked to order so its mega fresh. We have already booked again for August because we were so impressed. Very very highly recommended","title":"“Absolutely Fantastic”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 June 2012","sleepQ":5,"rooms":5},{"text":"Stayed here for one night to see Coldplay at Man City's ground, the location was ideal as the venue was just a short drive down the A57. Check in was excellent and the receptionist was very helpful, she gave us a booklet with information on tram times and taxi numbers which was very thoughtful of this hotel, although we opted to drive. Really impressed with our room! I've stayed in various north west premier inn's and this was by far the best room out of them all! Extremely clean! Awesome huge LED TV! Excellent view of the dock (without having to request a particular room)! Plenty of electrical sockets, which I have found to be lacking in many other premier inns. Excellent night security! Wish we would have woken early enough to go to breakfast, but after a night of rocking to Coldplay and with how comfy the bed and pillows were, we didnt rise til 11! Will DEFINITELY stay here again! Room Tip: The view of the dock is beautiful. See more room tips","title":"“Fantastic! Will 100% stay here again!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 June 2012","sleepQ":5,"rooms":5},{"text":"Spent 2 nights here in June. I could have done with a taller clothes hanging rail for trousers, as the only hanging space is within a functional unit, so only suitable for tops. There are seperate hooks for outdoor coats. Necessity being the mother of invention, we hung our trousers in the bathroom on the shower rail and the steam, when we had our showers, got rid of the creases in the trousers!!! The staff were very friendly and helpful (hello Sharon) and the hotel is in a lovely setting. Unfortunately the weather was atrocious, but a good beefeater restaurant is just next door. The all you can eat breakfast is fantastic value for money.Hopefully the weather will be better next time","title":"“Great Location”","location":5,"service":4,"value":4,"cleanliness":4,"date":"11 June 2012","sleepQ":4,"rooms":4},{"text":"Premier has a unique simple check-in. The rooms are functional and clean. centrally located. I was a little concerned when there was no trolley for luggage, for us it meant one taking up luggage and one staying downstairs. There was a sign in the room that discussed how it was summer and here is a fan, we slept with the window open, but it got very hot. Wi-fi is inexpensive but rarely worked. Also not easy to get a phone call, the line was busy for a long time and my office never got through. After 2 days We were ready to leave. Thank goodness for the restaurant. I was able to enjoy the water view and they had good food and a great signal. Room Tip: Dont take a street front room especially during the summer, very noisey. See more room tips","title":"“Great one night stay must have limited luggage”","location":5,"service":4,"value":5,"cleanliness":5,"date":"8 June 2012","sleepQ":3,"rooms":3},{"text":"This was a lovely place to stay, a nice hotel, well maintained, in a nice area and the staff couldn't have been more helpful. Would recommend!","title":"“A good nights sleep”","location":5,"service":5,"value":4,"cleanliness":5,"date":"8 June 2012","sleepQ":4,"rooms":5},{"text":"This is a lovely place to stay, friendly and very clean. The only bad thing I have to say is that I booked a twin room and had confirmation of that. 2 days before I was due to go I had another email confirming a double room. I rang them and to their credit, it was sorted out before I got there. This aside I wouldn't hesitate to recommend the place. It was so friendly and, most importantly, it was very clean. The attached Beefeater restaurant was good value and served lovely food. The breakfast in particular was extremely good, the range of food and quality of it was superb. Stay here, it's great! Room Tip: Our room faced the quay and it was quiet. See more room tips","title":"“Fantastic”","location":5,"service":5,"value":5,"cleanliness":5,"date":"6 June 2012","sleepQ":5,"rooms":5},{"text":"Stayed here twice since sept 2011 for uni courses. Both times the staff were fantastic and very helpful, made our stay enjoyable. We used the restaurant next door for dinner and breakfast a few times & it was fab, again the staff were brilliant. The rooms were really clean & the location is excellent. I would highly recommend. Many thanks !","title":"“Great base &amp; lovely staff”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 June 2012","sleepQ":4,"rooms":4},{"text":"Stayed over for the Rugby league magic weekend in a family room. Free parking, staff where very friendly and helpful. Room was spotless, and all beds made up ready. Short walk to Metrolink which is a 15 ride into centre of Manchester. We have already booked a return visit and highly recommend a stay to anyone.","title":"“Fab Nights Stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"29 May 2012","sleepQ":5,"rooms":5},{"text":"Stayed here overnight as we were seeing Carousel at The Lowry.Excellent hotel, great location at Salford Quays. Cannot fault it at all. Staff very helpful and polite. Great breakfast and we also had dinner before show which was also very good. Would thoroughly recomend this hotel and we would definately return","title":"“Excellent Hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 May 2012","sleepQ":5,"rooms":5},{"text":"MANCHESTER (Salford Quays Media Centre) Premier Inn Stayed here on the 19th of May 2012 no complaints with the hotel nice location nice to walk round the BBC etc Staff very helpful and friendly cannot fault it The only down side was the restaurant next door not the food that was good just the fact that we had to wait nearly an hour for it to be cooked and missed part of the show at the MEN","title":"“Nice location”","location":5,"service":4,"value":4,"cleanliness":5,"date":"21 May 2012","sleepQ":5,"rooms":5},{"text":"We have just stayed for one night at Premier Inn after a theatre visit. It was excellent, pleasant service, helpful staff. I have no problem at all in recommending this hotel if you want to stay in the Salford area. Plenty of free parking at the hotel and good food at Beefeater next door.","title":"“Excellent stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"16 May 2012","sleepQ":5,"rooms":5},{"text":"Just back from spending a weekend at Salford Quays. Super location. Cannot fault at all. Staff most helpful. We also had great breakfasts. Can't recommend enough. Will be back. Thanks for great couple of days. Room Tip: Book one overlooking the water. See more room tips","title":"“wonderful”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 May 2012","sleepQ":5,"rooms":5},{"text":"Stayed here for 2 nights in a newly refurbished room. The room is what we would expect from a Premier Inn i.e clean, comfortable bed and plenty of space. Downsides are there isn't a lot of hanging space and the water pressure in the washbasin is only adequate. The bathroom fan comes on with the light and was very noisy. We reported this but in the end solved the problem ourselves by turning it off! The receptionist on duty when we arrived was particularly helpful and check in was very efficient.","title":"“Good value for money”","location":5,"service":5,"value":4,"cleanliness":4,"date":"10 May 2012","sleepQ":4,"rooms":3},{"text":"My son aged 11 and i stayed on Sunday 6th may 2012 for 1 night, The receptionist Gemma could not have been more helpful, Before i made my booking i read reviews on here that said the floorboards were very creaky and you would hear every footstep in the room overhead of yours, I rang the hotel to ask about this and was assured that a TOTAL refurbishment was being done and the issues with the floors was being fixed. We were given room 23 on the first floor which was ok , Its an old building that has old draughty windows , The room heater isnt much use and i would not like to stay there on a cold winters night as the heat control only controls a little wall mounted electric heater that cuts off when the heater reaches the desired temperature and not the room temperature which in my opinion is not good enough in this day and age. The room looked to have been recently painted and spruced up with a large flatscreen tv with a decent selection of free to air channels. There was tea and coffee facilities also. In the middle of the night my son and i were woken by the creaking floorboards of the room overhead ours and we had to listen to every step the person took around there room, The following morning i said this to gemma and she stated that all the floors were fixed in the refurbishment, I told her that obviously the ones overhead room 23 were overlooked and she insisted that they had been fixed which was not the case. You have to go to the building next door to and go up to the first floor beefeater restaraunt for breakfast which was ok but not as good as breakfasts we have had in other premier inns . They charge over £100 per night when there is an event in Old Trafford or on the quays and to be honest it is not worth that money to stay in an old building with drafty windows and poor heaters and creaky floors when for the same kind of money you can stay in a more modern hotel close by, We have stayed in the premier inn on waters reach next to Old Trafford on numerous occasions and will be staying there in future as it is a vastly superior hotel. I was quite glad i had got an advance purchase deal for this hotel as it is not worth what they charge for full rates, My son and i were dissapointed as it casts a poor light on Premier Inns Room Tip: Insist on a room on the TOP FLOOR See more room tips","title":"“Get a room on the top floor !”","location":3,"service":4,"value":2,"cleanliness":3,"date":"9 May 2012","sleepQ":1,"rooms":3},{"text":"Overnight stop booked to coincide with tickets at the Lowry. Also ideal for Old Trafford, Imperial War Museum or Media City. Great location, free parking, easy to find and friendly staff. Good transport links into City if needed. All the basics you'd expect but far better than Travelodge etc. Ask for room overlooking waterfront. Meal deal to include Dinner and Breakfast looked pretty good value - however we just had breakfast which was a little on the expensive side but really good quality. Overall, delighted with the advanced booking deal we got £39 room only. Highly recommended.","title":"“Great for night or weekend stopover.”","location":5,"service":5,"value":5,"cleanliness":4,"date":"8 May 2012","sleepQ":4,"rooms":5},{"text":"Room spacious and clean, comfortable bed, decent bathroom. Amiable and helpful desk staff. Annoyingly penny pinching - just 2 tea bags for 2 people, no hot chocolate, no drinking water, no nibble biscuits, no hair shampoo.... Also not at all low cost, especially over week end.","title":"“Comfortable bed, penny pinching facilities and not really low cost.”","location":5,"service":3,"value":2,"cleanliness":5,"date":"8 May 2012","sleepQ":5,"rooms":4},{"text":"Stayed here for one night with my mum, all three receptionists were outstanding better than some of the 4 or 5 star hotels we have stayed at. Mum had a wheelchair and they could not have been more helpful. The room was excellent with plenty of room and good sized bed and the shower /bath was spotless. We would have no hesitation in recommending this premier inn to anyone.","title":"“Excellent Staff”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 April 2012","sleepQ":5,"rooms":5},{"text":"As everyone has commented, both the receptionists (Sharon and Sarah) were outstanding. Both were helpful and always friendly. The hotel was undergoing renovation, so was somewhat noisy during the day. However, this did not disturb our stay. The room was excellent and the adjacent restaurant very good value for money. Room Tip: Rooms on the quay side of the hotel are quieter. See more room tips","title":"“Excellent Service”","location":5,"service":5,"value":4,"cleanliness":5,"date":"23 April 2012","sleepQ":5,"rooms":5},{"text":"This was our first ever stay in a Premier Inn and we were pleasantly surprised. The receptionist was friendly and helpful and our room, although not luxurious, was clean and functional. We had a really nice view of Salford Quays and Old Trafford from our window. Breakfast was taken at the next door Beefeater hotel and that worked well. I thought the tariff might have been a bit cheaper but I think the good location of the hotel was the reason for this. Room Tip: The hotel is a 15 minute walk from Old Trafford See more room tips","title":"“A pleasant surprise”","location":5,"service":4,"value":4,"cleanliness":5,"date":"22 April 2012","sleepQ":3,"rooms":4},{"text":"Premier Inns are usually bland, personality-less places, and this one was no exception, but the greeting from the delighful young lady on reception could make up for almost anything! My room was comfortable with an enormous bed (Premier Inns do beds well!), but the winter weight duvet was too warm. Fell asleep under the duvet, got too hot, woke up and pushed the duvet aside, fell asleep, got too cold, woke up and replaced the duvet...etc etc! So not the best night's sleep. Nonetheless the hotel is only about three minutes from the Lowry and this waterside area is great. Metrolink (Salford Quays) is only a few minutes away and provides a swift and efficient connection with Manchester city centre.","title":"“good location for lowry arts centre”","location":5,"service":4,"value":3,"cleanliness":5,"date":"21 April 2012","sleepQ":3,"rooms":4},{"text":"We took advantage of a special offer for this hotel as we were going to a show in town. It's location and free parking along with friendly staff made for a very enjoyable stay. We will definately stay here again if visiting this area of the country again and will always look at what is on offer by way of special deals in Premier Inns when planning future trips. Room Tip: A room overlooking the Quay See more room tips","title":"“A refreshing change”","location":5,"service":5,"value":5,"cleanliness":5,"date":"20 April 2012","sleepQ":5,"rooms":5},{"text":"Ideal premier inn to stay at if you want shops, theatre and a place to stay for one night. Set right on the salford quays where you can watch the swimmers using the commonwealth games outside swimming arena. The pub next door had a great atmosphere with plenty of outside seating. Breakfast was also served here, and we found it offered one of the best freshly cooked breakfast we have ever eaten at any premier inn, whilst being able to look out over the swimming arena. The Lowry shopping centre was within a short walking distance, as was the Lowry Theatre.","title":"“Another great Premier Inn to stay at”","location":4,"service":4,"value":4,"cleanliness":4,"date":"11 April 2012","sleepQ":4,"rooms":4},{"text":"Nice and quiet lovely clean rooms and the lady on reception went out of her way to help throughout our stay, the inn is on the waterfront near a large shopping centre and the Lowry, old trafford is a five to ten minute walk but the inn is far enough away if football is not your cup of tea, a garage and several restaurants are near by, Frankie and Bennys is very good but check your bill as they added an £8 tip without my knowledge, I cannot praise this place enough so much better than travel lodge.","title":"“Amazing service”","location":5,"service":5,"value":5,"cleanliness":5,"date":"11 April 2012","sleepQ":5,"rooms":5},{"text":"My husband and I went to see the show Wonderful Town and because there was a special deal we decided to stay over after the show as my husband is disabled he soon gets tired and it was great to walk back to our comfortable room and also we could park easily in the bay provided...so altogether a very enjoyable experience","title":"“a visitor”","location":0,"service":0,"value":0,"cleanliness":0,"date":"10 April 2012","sleepQ":0,"rooms":0},{"text":"My son and i came here for the weekend to watch the man u v qpr match, it was our first visit to manchester. On arrival the receptionist was very friendly and helpful and presented my son with a lovely easter egg!. The room was overlooking the quay and was spotless. Refurb was still going on but never effected us. The area was perfect just a short walk to the Stadium. The Beefeater next door had a good selecction of food and i can recommend the steak. On match day was very busy for breakfast , had to wait 20 mins but was worth the wait. All of the staff in the hotel made us feel very welcome and couldnt do enough for us. We will be back! Thank you Salford Quays.","title":"“our first visit to manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 April 2012","sleepQ":4,"rooms":5},{"text":"Our 2 night stay at this Premier Inn was everything we have come to expect of them and even more. The staff were friendly , helpful and did really care that we enjoyed our stay. The area was good too, within easy walking distance of public transport and interesting buildings. Very pleasant area.","title":"“great place.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"2 April 2012","sleepQ":5,"rooms":5},{"text":"Hotel room clean and immaculately done having just been refurbished. Refurb was still going on but workmen were polite and courteous and very conscious of our safety and comfort. Gemma on reception was lovely and very helpful, couldn't do enough for us. Would definitely stay there again. Brealfast was great value with kids under 16 eating free. We were staying in Manchester to go to a concert at the arena and it was very easy to get in and back using the metrolink from near the hotel.","title":"“Perfect for a nice weekend.”","location":0,"service":0,"value":0,"cleanliness":0,"date":"1 April 2012","sleepQ":0,"rooms":0},{"text":"I stayed for a week, working at the local Lowry theatre which entailed some very late nights - unfortunately this hotel was being refurbished which meant extreme noise starting at 8am with hammering and ripping up of floorboards over my room. The staff however were exceptionally helpful and moved me to a quieter area. The hotel really should have been closed for building works and it seemed to me the staff were forced to work with a very difficult situation, but coped very well under the circumstances.","title":"“Lovely staff”","location":5,"service":5,"value":4,"cleanliness":5,"date":"21 March 2012","sleepQ":0,"rooms":5},{"text":"First things first, Sarah and Sharon. They are by far 2 of the nicest people I have come across. As soon as you enter the hotel you are greeted by 1 or both of their smiling faces. The hotel, as I have found with all Premier Inns, is clean, tidy and more then adequate for a nights stay. The rooms have everything you need and there is nothing more you can ask for. really highly recommend this hotel. Our stay was all the better for meeting two fantastic people on Reception. Perfect hotel, and beautiful location.","title":"“Great hotel, even better staff.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 March 2012","sleepQ":5,"rooms":5},{"text":"A great friendly wecome from the lady on reception who gave us loads of advice on how to get tram etc. We had a nice room overlooking the quay. On our return from town later in the evening, we were asked if we would like more tea or coffee by the helpful guy on reception. Would definitely stay again.","title":"“What a friendly place!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"12 March 2012","sleepQ":0,"rooms":4},{"text":"Usual Good standard. Good value for money. Rooms could do with an upgrade to same standard as the nicest Premier Inns I have stayed in. Room Tip: One side of the hotel has a view over the Quays. Ask for this when booking. See more room tips","title":"“Great staff friendliness”","location":4,"service":4,"value":4,"cleanliness":4,"date":"28 February 2012","sleepQ":4,"rooms":4},{"text":"Probably not the biggest premier inn around with only 50ish rooms, but never-the-less, it was a great hotel. The receptionist, (who was first class, very helpfull and full of advice), did explain the hotel has got an issue with creaking floorboards, which very soon will be sorted as the hotel gets refurbished, so she put us on the top floor (only 3 floors) which totally sorted the problem for us as there was nobody above. Great couple of nights sleep and like I said, the receptionist is a star and was always smiling and full of helpful tips. Room Tip: Until the refurbishment is complete, ask to stay on the top floor See more room tips","title":"“Great little hotel with a fantastic receptionist”","location":5,"service":5,"value":4,"cleanliness":4,"date":"26 February 2012","sleepQ":4,"rooms":4},{"text":"Just returned from 2 nights, and really cant complain about anything, the receptionist was very helpful, the room was tidy, great nights sleep both nights. The only downer was the lift being out of order, but even though we had room 52, on the top floor, that didnt create much of a problem. The Beefeater bar and grill next door (which the hotel works alongside) was equally impressive, we decided to eat there on the last night of our visit, and again the service was good, but most impressive was the quality of the food, we had smoked paprika chicken with spicy chips and salad, the chicken was superb, the chips spiced to perfection and the side salad was nice and fresh. I will definately return and would recommend it to all. Just a foot note though, the hotel is starting a bit of a refurb by the looks of things (hopefully fixing the lift while they go) but dont let that put you off. Room Tip: Top floor was quiet on my visit See more room tips","title":"“Good nights sleep, great reception staff and the food next door was lovely”","location":5,"service":5,"value":4,"cleanliness":4,"date":"21 February 2012","sleepQ":5,"rooms":4},{"text":"stayed here last year for United vs Birmingham match. Myself , my wife , 11 year old son, 9 year daughter and 2 year old son stayed in a family room. Room itself was basic but clean. Reception staff were very friendly and helpful. The bar next door served great food and the steaks are to be commended as well as the all you can eat breakfast. I would defenitely come back and recommend this hotel.","title":"“handy for old trafford”","location":4,"service":4,"value":4,"cleanliness":4,"date":"21 February 2012","sleepQ":4,"rooms":4},{"text":"Arrived on Sunday 5th Feb at 14:00, welcomed by a wonderful lady on reception who is a asset to the buisness. We were informed our room had a fantastic view, we're explained where to go out an about and what to expect from the hotel. The lift was out of order but that didn't bother us. We were in room 39 at the far end of the corridor on the 2nd floor. Room had an oldish tv with freeview, coffee and tea making facilities, hair dryer. Bathroom was nice size Beefeater next door was excellent as well. However the bedroom above has creaky floorboard which meant from 6.40am was awake due to the person in the room above us was awake and could hear all of floorboards when they moved. I would Defo stay again if in the area.","title":"“Paid &pound;19 Bargin, lady on reception is a star!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"6 February 2012","sleepQ":0,"rooms":4},{"text":"Stayed for two nights and were greeted by a very friendly receptionist who was helpful with lots of information. We had the last available room which suitable for people with disabilities so there was plenty of space. The first night we had a very good night sleep in a really comfortable bed, not so on the second night. We were kept up half the night by a couple upstairs having some kind of disagreement which resulted in security being called and it then settled down. In the morning we were informed that the previous nights hotel rate was being credited back to our card, and as we had slept so badly our check out was extended. Their good night guarantee was honoured without question. I will certainly return.","title":"“Fantastic service”","location":5,"service":5,"value":5,"cleanliness":5,"date":"5 February 2012","sleepQ":3,"rooms":5},{"text":"Stayed at Premier Inns many times and never had a problem...however.... Checked in late at night...Got to my room... It was like walking into a fridge... ( Not that I have ever walked into a fridge..but you get the idea).... It was minus 3 outside and the window was left open and the heating turned off..... I turned the heater on...it didn't work. It was midnight and I was tired and couldn't be bothered to call reception so I just got into my freezing cold bed... and shivered. And I had to pay £111 for this... Premier are keen to advertise the £29 rooms but they fail to tell you that they practically DOUBLE normal rate when there is an event on. In this case a football match.","title":"“FFFfffffffreeeezzzzing”","location":4,"service":0,"value":1,"cleanliness":3,"date":"3 February 2012","sleepQ":1,"rooms":3},{"text":"Very friendly staff and a normal, good, Premier Inn room. Well located for the Lowry, and a short drive or tram hop to middle of Manchester. Beefeater next door gave us a good meal one night. Right beside the quay, and the noisiest thing were the ducks.","title":"“The noisiest thing were the ducks”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 January 2012","sleepQ":5,"rooms":5},{"text":"We had been staying the old trafford premier inn and liked it so much that we tried to book a second night. They were full so recommended we come here. I wish we had not! The entrance is so dark and tiny. We were on the first floor and you could hear every creek of the floorboards from the people above. The room was so boring, the heating would not work and the TV was a huge box! The bed was comfy that was probably the best thing. The whole place needs a re-furb. It's not got good sound proof either as when people walked past the room you could hear clearly every word. Would not stay here again.","title":"“Old, tired and boring!”","location":3,"service":3,"value":1,"cleanliness":1,"date":"30 January 2012","sleepQ":2,"rooms":1},{"text":"Ideally situated close to the Lowry Theatre. Warm friendly welcome & comfortable room. Breakfast excellent as was the evening meal in the Beefeater.","title":"“Ideal location comfortable room warm friendly welcome”","location":5,"service":5,"value":4,"cleanliness":4,"date":"23 January 2012","sleepQ":0,"rooms":5},{"text":"stayed here monday 16th jan for 1 night. check in was fine, sarah who was on reception was very efficient and friendly and gave lots of info. room was a nice size and very clean - the usual standard i expect from a premier inn. theres a plaque on the wall outside reception saying it was the 100th premier inn to open and you can tell it is one of the older ones as it is a bit out of date but it wasnt grubby or dirty. the room had enough clean towels, tv, hairdryer and there was plenty of showergel and soap in the bathroom. had a few problems with the tv playing up at first but it seemed to sort itself out so i didnt feel the need to say anything to the staff. breakfast was good, this particular hotel serves its breakfast in the beefeater next door and you order the hot items you want from the waitress and then there is a selection of cereals and yogurts and toast layed out for you to help yourself. you also help yourself to juice, tea & coffee. breakfast is all you can eat, it was £8 which might seem pricey to to some but a coffee and a sandwich from a coffee shop in town can be as much as £7 so i think its not too bad value for money as you can have as much as you want and while i was there they doing 2 4 1 so even better value! i would definately recommend this hotel if someone is looking for somewhere to stay in salford.","title":"“nice hotel”","location":4,"service":5,"value":4,"cleanliness":5,"date":"18 January 2012","sleepQ":4,"rooms":5},{"text":"Stayed here between Christmas and New year on a discounted rate. There is a dedicated car park which is free. The check in was painless and the receptionist was helpful, friendly and welcoming. The Hotel itself is located next to a beefeater and 2 mins walk from the tram stop that takes you to eccles, Media City or Manchester City Centre. It is also within 3/4 mins walk from the Lowry Theatre. From this hotel you can see Manchester United Football Ground and another Premier inn close to the ground across the water. Prior to arrival i requested a river view which was provided. The hotel itself seems tired and the rooms spotlessly clean but need a bit of TLC. The Receptionist did say that are due for a refit in the spring. Breakfast is in the beefeater next door and is the same price as other premier inns but is cooked fresh on request. The continental part of the breakfast is laid out buffet style. The Beefeater in the evening wasn't that busy but that may be partly the time of year and the weather {it was very cold and raining}","title":"“Helpful, Friendly staff, Free Parking”","location":3,"service":5,"value":5,"cleanliness":5,"date":"17 January 2012","sleepQ":4,"rooms":3},{"text":"Two years on from my last review I find this hotel to be better than ever. The standard of staff care is first class, reception in particular could not be more helpful and friendly. Food at the adjoining Beefeater is excellent value. Breakfast is better than in any 4 star hotel where I have stayed. So pleasant to have everything cooked fresh to order and to have a wide range of fruit and cereal available. Fresh crumpets to toast are a first! With all the facilities of Salford Quays on the doorstep and easy tram access to Manchester, this is a great place to stay.","title":"“Still excellent”","location":5,"service":5,"value":5,"cleanliness":5,"date":"13 January 2012","sleepQ":0,"rooms":5},{"text":"It looked like this was going to be one of those reliable Premier Hotel stays. Nice clean comfortable room and spotless bathroom. The restaurant is in a separate building across a lane. The reception lady was charming and friendly even after the nocturnal disaster. The quayside hotel is well situated for the United ground and the Lowry Centre. We were disturbed FOUR times at 1-2 hour intervals during the night by the fire alarm, twice having to get dressed and go down to muster outside although only once having to stand outside for 15 mins. It wasn't much consolation to find out later that the culprit was one of the customers who was turfed out and black-balled after the forth alarm. It would have been nice if we'd had an apology from a senior manager or some sort of gesture of goodwill...","title":"“A night full of alarms”","location":4,"service":5,"value":3,"cleanliness":4,"date":"13 January 2012","sleepQ":1,"rooms":4},{"text":"The Hotel is like most Premier Inn places but with a great receptionist, Sarah is just great! Ive got nothing at all to complain about, Had a really good breakfast in the Beefeater next door.","title":"“An great place to stay”","location":4,"service":5,"value":5,"cleanliness":4,"date":"11 January 2012","sleepQ":4,"rooms":4},{"text":"Premier Inns are in my experience good hotels with excellent value for money. Still, this Premier Inn just might be the best I have stayed at. We had a very enjoyable stay for our end of year holiday from Dec 27th until Jan 1st. My wife, our 4 and 6 1/2 year old girls and myself shared a family room. We had a very warm welcome from receptionist Gemma and the room was nice and clean as one has come to expect from all Premier Inns and although smaller than a family room we got at a Nottingham Premier Inn exactly a year ago, it was also quieter, with really comfy double bed and nice proper beds for the little ones. I would have preferred sheets and blankets to duvets as the weather was quite mild and there was no way to get room temperature below 20ºC but the three girls were just fine. There was even a match going on on New Year's eve and more people turned up the night before (quite a few families) so it was busier but not really noisier (other guests were very nice as well). We had dinner nearly every night at the child friendly Beefeater pub next door (more on this below) and found food quality standards to be very good coupled to excellent value for money. We rented a car and drove around, it is quite easy to find one's way and everything is well signposted. The hotel car park had ample space for the estate we were given so no need to worry about returning the car with any extra dents or scratches! The Quays are an excellent location. The area has been renovated very nicely. It feels airy and invites to quiet, refreshing walks alongside the canals. The hotel is conveniently close to the Lowry outlet shopping centre which even if not too large we found to be full of interesting and keenly priced stuff we could not find in the otherwise lovely and vibrant city centre. There are quite a few other attractions at the Quays as well. You do need transport to get to the city centre but you can enjoy nice quiet walks alongside the canal and in five minutes you will be in the nearby Lowry shopping centre and other attractions at the Quays. All the staff at the hotel and pub made our stay a nice, relaxed and fulfilling one - unfortunately I cannot recall all their names but Sharon and Jim looked after us very well and Gemma and Sarah went to great lengths to help us with all sorts of information I cared to ask for, throwing in extra bits of invaluable advice. The Beefeater pub staff serving the tables and the bar were great: Mike and Zerina were nice and helpful, and in particular lovely Roisin looked after us all so well that she made the little girls (and most certainly us grown-ups) feel right at home! I would highly recommend this hotel to anyone wishing to go to Manchester on holiday as apart from being so well located for peace and quiet and in such a convenient location, the staff deserve a big thank you - they go the extra mile and really set it apart.","title":"“A very enjoyable stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"10 January 2012","sleepQ":5,"rooms":4},{"text":"Had stayed at Salford Quays before, but not at the Premier Inn. Booked a family room for an absolute bargain price of £19.00 for New Year's Day! Have stayed in quite a few Premier Inns, and they are much of a muchness. This one however, had Sarah on reception, and she was very friendly and helpful, which is what you would expect, but sadly don't get everywhere. Our room was very spacious, and even had a 'proper' bed, and not a 'put-me-up' variety which you get in many hotels. The only slight grump I would point out is that the tv was a very old style portable, but, obviously, we weren't there to watch tv, but some might find this a negative. Breakfast was at the Beefeater next door, and full English is cooked to order, and you help yourself to everything else. Can't really fault anything. Would highly recommend,and would stay again, especially for such a bargain price!","title":"“What a bargain!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"8 January 2012","sleepQ":5,"rooms":5},{"text":"We spent 3 days including new years day at this Inn. Everything was fantastic, the staff were there for any enquiries or any help you needed, nothing was to much for them. The rooms were excelent, spacies, tidy and clean more like a newley opened inn. We had breakfast in the beefeater next door and again all was excelent both food (as much as you wanted) and staff. Again the evening meal was of the same quality and the staff excelent. Room Tip: rooms overlooking the quay and top floor See more room tips","title":"“New Year Celebrations”","location":5,"service":5,"value":5,"cleanliness":5,"date":"7 January 2012","sleepQ":5,"rooms":5},{"text":"We stayed in the radisson in Liverpool the night before we came here to visit friends in Salford and have a night out in Manchester. Must say - we felt much more welcomed to the Premier Inn than to the '4 star' accommodation the night before. Gemma on reception checked us in and she was particularly helpful and welcoming. However, all of the reception staff we dealt with were lovely and very helpful at providing directions and the nights reception bloke pointing out the location of cash machines on a map for us. Lovely location - we had a great view of the river and the Salford Quays area is lovely with some impressive architecture. Room was basic as to be expected but it was perfectly clean and maintained. Would definitely stay again.","title":"“Excellent”","location":5,"service":5,"value":4,"cleanliness":5,"date":"18 December 2011","sleepQ":5,"rooms":4},{"text":"We had been very busy at work,and booked this !1night break on the quays because it was only 30 miles from home,and we wanted to visit the Imperial war museum and the Lowry outlet mall.The bedroom was as ever spotless and comfortable.The restaurant next door was good value on the £22 meal deal for Breakfast and 3 course meal.apart from waitress being very forget with our order,she forgot a bottle of wine we ordered,and or desserts would not have arrived if after waiting 20 mins we reminded her,know they had been really busy day and night before with football fans,but this must be a regular thing being so close to Old trafford.all in all a good break and the quays are ok and other places we visited worth alook","title":"“Much needed Break”","location":5,"service":3,"value":4,"cleanliness":5,"date":"14 December 2011","sleepQ":4,"rooms":5},{"text":"Hotel was clean, very helpful receptionist extremely knowledgeable about trams and places of interest to visit. Quite location, easy walk to the trams, excellent restaurant next door. The quays were a lovely site and pleasant, to walk alongside, especially in the summer. The town centre is within easy reach of numerous trams and it was very good value for money using the trams, we used a 2 day saver for nights out as well as exploring during the day. This was the best premier inn we have visited.","title":"“Miley blossom”","location":5,"service":5,"value":5,"cleanliness":5,"date":"9 December 2011","sleepQ":5,"rooms":4},{"text":"No problems parking (though we might just have been lucky there) Efficient and friendly receptionist checked us in very smoothly and managed to make the stock PI 'weclome script' a bit less robotic and a bit more welcoming with some friendly chat. Rooms were fine - the usual PI standard. Clean, free of strange smells, everything worked as it should, and it was pretty quiet (give or take another guest banging on my door at some ungodly hour but I guess PI can't be expected to control idiots!). Room temperature was excellent. I prefer cool bedrooms and hate arriving into an oven because someone thought it'd be nice to leave the heating fully up; this was just right. Location is handy for transport and there's a decent range of places to eat and things to do within a short walk. Good porridge at breakfast - which makes a nice change from many other places. Other food was fine too. Very well poached eggs, tasty bacon and sausages which seemed to contain - surprise! - more meat than breadcrumbs. Coffee was a bit non-descript but not undrinkable. Only real problem would be that the large fruit juice and milk jugs, when full, are very heavy. Ok for me but several elderly people and some children were struggling to lift and pour them without generously distributing the contents around the table/floor. Criticisms? Free wi-fi would be nice. And, being in Manchester - land of eternal rain, some kind of roof over the walk from the hotel's front door to the adjacent restaurant/bar would be good. Even a bucket full of PI umbrellas in reception would help. All in all a comfortable and uneventful stay - just what one wants on a business trip. I'd happily stay there again.","title":"“Good value, good location, good staff - good stay.”","location":4,"service":5,"value":5,"cleanliness":5,"date":"9 December 2011","sleepQ":4,"rooms":4},{"text":"not disability/ wheelchair friendly in any manner. have to leave hotel's main building to get to bar and restaurant. faulty doors in lifts--didn't open on ground floor. Room Tip: Premier inn old trafford much better!! See more room tips","title":"“premier inn salford quays manchester”","location":2,"service":3,"value":2,"cleanliness":3,"date":"28 November 2011","sleepQ":3,"rooms":3},{"text":"Stayed here for 2 nights with my wife and son, very clean ,staff nice, quiet area ,easy to get to the city centre ,10 mins on tram, a few shops, places to eat near hotel , paid 29 pounds per night so great value for money.","title":"“Salford Quays”","location":4,"service":4,"value":4,"cleanliness":4,"date":"16 November 2011","sleepQ":4,"rooms":4},{"text":"Usual Premier Inn standard rooms - if you ve been in one you ll recognise the formula Enjoyable stay - relatively quiet considering its location Friendly Staff Ample Parking Handy for tram link to central Manchester Walking distance to Salford Quays and the attractions like the Lowry, the Imperial War Museum and the Quayside itself I would stay there again","title":"“Good location”","location":5,"service":5,"value":4,"cleanliness":4,"date":"15 November 2011","sleepQ":3,"rooms":5},{"text":"I stayed at this hotel for work on 13th November. The reception staff were so friendly and helpful, just couldn't do enough for you and it was an efficient check in. I was allocated room 28 but found there was a bit of noise from upstairs so asked to be moved to a top floor room. They happily obliged and I also got a wonderful view of the quays and Old Trafford in the distance! It was a great location right next to the Lowry Outlet Mall too. I walked to Old Trafford in about 15 minutes and it was a nice walk. The Beefeater next door was lovely for dinner and breakfast, great service and good food. Would definitely come again!","title":"“Best nights sleep in a hotel I've ever had!”","location":5,"service":5,"value":5,"cleanliness":5,"date":"14 November 2011","sleepQ":0,"rooms":5},{"text":"Fabulous location for exploring Manchester. The hotel is right on the waterfront at Salford Quays, so easily and pleasantly walkable to the Lowry, the Lowry outlet mall, the Imperial War museum, Media City and a variety of chain restaurants. The tram station is very nearby. Trams are inexpensive and run regularly so it's very easy to get to the city centre. The Premier is connected to the Beefeater next door. This is where breakfast can be had for the standard Premier Inn price. Always a good option for me because children eat free. In the evening the large bar is pleasant. Receptionists were very friendly and the room was good. The lift wasn't working when we got there but they gave us a full explanation of why and how long before it would be fixed. They apologised and offered to help with anything we needed taking upstairs. It really wasn't a problem for us. The only negative I have is the creaky floorboards - a bit noisy when the person in the room above got up at 6am. Despite that I would definitely recommend it. Room Tip: Views are better at the back, overlooking the water See more room tips","title":"“Great Location”","location":5,"service":5,"value":4,"cleanliness":4,"date":"13 November 2011","sleepQ":3,"rooms":4},{"text":"We booked a one night stay for a bargain price of £19, even at the standard rate we would have been happy with the hotel. The waterfront location is perfect for The Lowry and the Imperial War Museum, both a few minutes pleasant,traffic free, level walk. The Tram stop is nearby for a trip into the City Centre. Would recommend a visit to IWM North, both for it's architecture and portrayal of war, very thought provoking. For any fan of L.S.Lowry a visit to the Gallery is a must. Premier Inn staff were very friendly and welcoming.","title":"“Excellent location, friendly staff, superb price.”","location":5,"service":5,"value":5,"cleanliness":4,"date":"8 November 2011","sleepQ":4,"rooms":4},{"text":"When you first turn up to this Premier Inn it looks fairly standard. The initial walk in however was rather unpleasant. We were hit with a strong stale smell of either industrial cheap air freshener or a damp smell. Looking around the hotel itself we put it down to a really nasty air freshener!! The next thing we saw was a display on reception stating no-one was covering the reception and we should ring the bell. It was promptly answered and we dealt with one of the best receptionists I have ever experienced on all my stays in any hotel. The member of staff in question was called Sarah and she was friendly, polite and knowledgeable of the surrounding area. As we were early we did not get into our room immediately (which was very professionally explained - all rooms were busy and rooms were being cleaned. Absolutely understandable as we were early.) Our bag was taken and we were given several recommendations for shopping and lunch in the surrounding area. I highly recommend the nearby \"Lime\" restaurant. Superb food in a really nice relaxed atmosphere. When we came back shortly after the allowed check in time we were allocated a room quickly and told it was being changed to the quieter side of the building - an added extra little touch that made Sarah superior to all receptionists out there. We got up to the room however to find our allocated room wide open and obviously not ready as we were expecting. Housekeeping staff superbly handled this over sight with a quick phone call and a room move. Personal accountability in this hotel is superb, were some house keeping staff I have experienced would have just shrugged their shoulders. The young girl that helped us is another credit to this small hotel. The hotel room was absolutely spotless, maybe a little dated but absolutely spotless. I am very fussy about this but I must say the housekeeping was superb for a budget hotel. Room temp was a little warm but the windows have been left open to help. A nice and sensible touch. After a long day we returned to the room and fell promptly asleep. The bed was comfortable and the hotel was quiet. For a budget hotel I cannot recommend this hotel high enough. As I say, a few small niggles..... but the staff were superb especially Sarah. She is a really credit to not only the Premier Inn but the hospitality industry in general. Thanks Sarah, your pleasant and professional attitude made the stay a delight. We will definitely stay in this hotel again and would recommend it highly. TIP - use the tram to get into Manchester. Quick, efficient and very handy to the hotel.","title":"“A few minor niggles saved by the superb staff”","location":4,"service":5,"value":5,"cleanliness":5,"date":"7 November 2011","sleepQ":5,"rooms":4},{"text":"when we made a change to booking the original reservation got cancelled and so did the breakfasts which we had paid for... because it was difficult to alter booking details from New Zealand as you had to call as they didn't have an obvious online email address we thought we could sort it out at the hotel... The guy was very pleasant and said he would look into it when I presented the email reciepts but said there was nothing he could do! So basically we went breakfastless even though we had paid for it!!!","title":"“Good clean hotel and pleasant service - but watch online booking”","location":4,"service":4,"value":3,"cleanliness":4,"date":"6 November 2011","sleepQ":4,"rooms":3},{"text":"The Premier Motor Inns are near identical and are more than adequate for what they are, but this one is great due to its location on Salford Quays. We were going to the Lowry Centre for an exhibition and show and it couldn't have been more convenient. We were impressed with the friendly and helpful receptionists at all the Inns we stayed at and the Salford staff were equally pleasant. We originally booked one night, and then decided a few days beforehand to book a second. The central booking line didn't ring back to confirm as promised, but when we rang the Inn directly, they amended the booking with no problems. The continental breakfast at the Beefeater next door was good value.","title":"“Good location, excellent reception staff”","location":5,"service":4,"value":4,"cleanliness":4,"date":"5 November 2011","sleepQ":4,"rooms":4},{"text":"I was unable to stay in my usual hotel, as it was full, and made a last minute booking to this hotel. After booking online, I phoned the hotel, as I am disabled and have specific needs. The girl I spoke to was extremely helpful, and reassured me that everything I needed was possible, and if I needed anything else, they would do everything they could to help. When I arrived - early - the staff were amazing. They did all they could to make me comfortable while I waited for my room, then unloaded the car for me, and helped me settle in. The disabled room was comfortable, quiet, and had a nice view over the water. Every time I ventured out, staff were helpful, and kind. Breakfast was taken at the adjoining steak house, and as I could not go upstairs to the dining room, I was served very willingly and efficiently on both mornings of my stay with an excellent breakfast. I would definitely stay at the hotel again.","title":"“Wonderful situation, fantastic staff”","location":5,"service":5,"value":4,"cleanliness":5,"date":"4 November 2011","sleepQ":4,"rooms":3},{"text":"Receptionist very friendly & easy check in. Room needs a revamp and son had to sleep on mattress on floor which he wasn't impressed with. Bathroom stank of cigarette smoke. Breakfast and staff excellent Great location for all that Salford Quays has to offer","title":"“Lovely welcome, rooms bit dated”","location":5,"service":5,"value":4,"cleanliness":3,"date":"31 October 2011","sleepQ":3,"rooms":3},{"text":"another hotel which has got it right from arrival friendly staff , lovely setting clean comfy beds lovely resturant, perfect breakfast, great for the local night life and shopping loved it well done","title":"“lovely place to stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"28 October 2011","sleepQ":5,"rooms":5},{"text":"This is my first stay in a premier inn and it was not a great experience. Although staff were very friendly and helpful the room had a very old, faulty TV and the room temperature was bad so had to leave the window open overnight and got woken at 5am by someone talking on their mobile phone in the car park outside. The llift was out of order. Staff told us that the room was one of the oldest Premier ones and due for a re-fit. The locations was handy for the War Museum and Lowry Centre but it was very dessserted around the hotel itself. Would not stay here again.","title":"“Old and Dated”","location":3,"service":4,"value":1,"cleanliness":4,"date":"27 October 2011","sleepQ":2,"rooms":2},{"text":"We stayed for one night in a family room with our 4 year old daughter. All areas of the hotel appear clean and tidy. On arrival the the receptionist was very friendly and helpful. Our room was very clean and a bed had been made up for our daughter. The hotel is located next to the quays and we had a very relaxing stroll along the quayside to the Lowry. Breakfast was great. Lots to choose from and the poached eggs were perfect :) We booked last minute so it was a little on the expensive side for what we usually pay at Premier Inns. Room Tip: Our room had a car park view, the other side of the hotel would have nicer quay views! See more room tips","title":"“Another great stay at a Premier Inn”","location":4,"service":5,"value":3,"cleanliness":5,"date":"26 October 2011","sleepQ":4,"rooms":4},{"text":"Stayed here for only 1 night on way down to holiday in Wales and wish we had booked the night before too, from the moment we arrived Sarah on the reception desk could not have been more friendly and chatted away to our little boy, we didnt get the chance to try out the Beefeater Resturent for a meal at night as went out to visit a family member but did have the breakfast the following morning which was excellent value and fantastic selection, the girl,(who I unfortunely cant remember her name ) was so welcoming and the service she gave us was wonderful, really enjoyed it as did our 5 year old, and nothing seemed to be any problem to her, with her coming back and checking if everything was ok, and asking if we needed anything else. I have never added a comment before but asked for the Managers name (Danny Ward) and Sarah who checked us in originally as wanted to say a big thank and cant wait to return, lovely area for a walk along to the Lowry Outlet Shopping centre and also well worth a visit to the Imperial War Museum which was brillient and so imformtive. Room Tip: Try and ask for room overlooing the canal, my little boy loved sitting at the window whilst we unpac... See more room tips","title":"“Staff could not do enough”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 October 2011","sleepQ":5,"rooms":5},{"text":"A friend and I stayed at this hotel because we were going to a concert in The Lowry. Rooms were clean, comfortable and functional. Thanks to a distressing car accident on the way to the hotel, we actually arrived in an RAC tow-truck. The receptionists could not have done more to help us settle and make sure we were ok. This hotel was great value, I would recommend it to anyone visiting Salford Quays and I would definitely stay there again.","title":"“Great budget hotel for Salford Quays”","location":5,"service":4,"value":4,"cleanliness":4,"date":"20 October 2011","sleepQ":4,"rooms":3},{"text":"We paid £39 and had a good night's sleep as the hotel was very quiet. We thought this was excellent value. The position is ideal for visiting the Lowry Theatre as we were and we felt happy to leave the car in the car park while we caught a nearby tram in to Manchester city centre.","title":"“Good deal.”","location":5,"service":5,"value":5,"cleanliness":5,"date":"17 October 2011","sleepQ":5,"rooms":5},{"text":"This is our favourite Premier Inn and we have been here several times over the last 9 years. The staff have always been friendly and helpful and will do anything they can to help make your stay a pleasant one. It's very convenient for getting into the city centre and other locations. We did have some disturbance from squeaky floorboards in the room above and the first time we mentioned this we couldn't move as the hotel was full. The last night the receptionist offered to use the good night guarantee and returned that night's accommodation charge. Room Tip: The Quay side rooms offer a good view. See more room tips","title":"“Great location, friendly and helpful staff who genuinely care”","location":5,"service":5,"value":5,"cleanliness":5,"date":"16 October 2011","sleepQ":3,"rooms":4},{"text":"Ideally located great staff crappy floorboards keep you awake all night and let down stay overall 2 nights no sleep for 85 quid a night u don't class as the gauranteed rest assured nights sleep the rave znd sell.","title":"“Good location and service from staff but shame about noisey creaky floors kept me awake 2 nights on trot need addressing asap”","location":4,"service":5,"value":3,"cleanliness":4,"date":"10 October 2011","sleepQ":0,"rooms":3},{"text":"We booked this hotel a few months ago for a wedding. on arrival the receptionist was very helpful and knowledgeable. Our room was very basic and small, with a double bed and 2 very small childrens beds, There was no air conditioning and the windows did not open very wide and the room was very hot and stuffy. The electrical appliance testing was out of date and it was quite expensive for a budget hotel. We stayed for 3 nights and this cost us £198. Breakfast was not included so an extra £50 on top of that. kids under 16 however did eat free. The breakfast was excellent and the staff very friendly and went out of their way to help you.","title":"“pretty average”","location":5,"service":2,"value":1,"cleanliness":4,"date":"26 September 2011","sleepQ":2,"rooms":2},{"text":"We chose this hotel as it was close to the Lowry Centre where we were visiting the art gallery and concert hall. It is also very close to the Imperial War Museum North, a large outlet mall,Old Trafford and the metro link to Manchester city centre and stations. It is a new build inn; the Salford dock buildings were all demolished, so the chance was lost to emulate the marvellous conversion of the Liverpool Albert Dock buildings which contain a Premier Inn. Nevertheless, this is a good hotel with an attached Beefeater pub where a good breakfast is served. The staff were very friendly and helpful and our standard Premier Inn comfortable room overlooked a dock now used for recreation. This was a very enjoyable, relaxing stay and we would certanly return if we visit the Lowry Centre again. Room Tip: Try to get a room overloking the old dock See more room tips","title":"“Excellent location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"24 September 2011","sleepQ":5,"rooms":5},{"text":"Lovely hotel, fantastic helpful and understanding throughout. Views of the canal on a lovely autumn morning were lovely. Only a short walk to the Metro station and frequent service into city centre. Breakfast & dinner well worth the money, as all you can eat for one price. Eat before 6.30pm and it's cheaper, with their bottomless chips!! Room Tip: If you want a room with a view of the canal, you have to ask, but the room onto the car park was in... See more room tips","title":"“Great Hotel”","location":4,"service":5,"value":5,"cleanliness":0,"date":"19 September 2011","sleepQ":0,"rooms":5},{"text":"I was very lucky to get two cheap nights together. I had a room overlooking one of the quays it was used for sailing small dingies? also ducks & swans very much in evidence the room was nice and large.","title":"“hotel is well located and metro station is near by”","location":0,"service":3,"value":4,"cleanliness":4,"date":"4 September 2011","sleepQ":4,"rooms":0},{"text":"We spent 2 nights here at the weekend for the purposes of a cruise on the Manchester Ship canal. The hotel lived up to it's expectations from other reviews, being clean and modern with a nice view of the Quays The reception staff have to be singled out as being very helpful, informative and friendly. One of the nice things about this hotel is the absence of traffic noise and the only noticable distubance came from geese from there early morning chorus as they flew around the Quays, a sight to marvel at.","title":"“Great for a short stay at Salford Quays”","location":0,"service":5,"value":5,"cleanliness":5,"date":"1 September 2011","sleepQ":5,"rooms":0},{"text":"I will make it clear from the start the staff are very friendly; there were no issues with them at all. The standard of the hotel however was not good; I would say it was dated. To start with at checking in it was not automated self-service as I had experienced before with touch screen terminals which produced key cards, no it was good old fashioned receptionist who only issued one key for two of us. The room was not impressive, it had dated fixtures such as an old fashioned fat chunky tv, no air conditioning, a window that hardly opened with condensation in the glass, only an old fashioned floor fan to attempt to regulate the temperature and a TV with limited volume. The room was too warm and stuffy due to the ventilation problems. When it came to the famous all you can eat breakfast well it wasn't so straight forward. Firstly you were asked to choose between a cooked or continental breakfast. We went for the cooked breakfast where you were required to place an order, it made you less likely to then ask for more once you had finished. In previous Premier Inns the whole breakfast both continental and cooked were buffet style help yourself and you could pick and choose from both for one price, it was excellent. At this hotel you have a choice on basics such as the sausages; my friend hated them and couldn't eat them! Sounds petty but on top of everything else we just couldn't wait to leave. I would not stay here again or recommend this hotel, however I would 1000% suggest the nearby Premier Inn at Manchester Central which is excellent.","title":"“Not up to usual Premier Inn standards”","location":0,"service":0,"value":0,"cleanliness":0,"date":"30 August 2011","sleepQ":0,"rooms":0},{"text":"After returning to our hotel at Premier Inn East Lancs Road Swinton on Saturday night after a family party, my step father was taken ill and needed to be taken to Hospital. Mary at reception was very calm and helpful and was genuinly concerned for all of us. She sorted the ambulance quickly and calmly and led them to the room once they'd arrived. After 6 hours at Hope hospital we all returned safe and sound and Mary let us back in. I really felt that Mary cared about what was happening and her calm and swift actions put everyone at ease in what was a potentially difficult situation. Also although the adjacent restaurant was currently closed, there were complimentary pastries and coffee which was very much appreciated as we were in the middle of nowhere.","title":"“Staff so helpful in a crisis”","location":0,"service":5,"value":5,"cleanliness":4,"date":"23 August 2011","sleepQ":4,"rooms":0},{"text":"We stayed here for 3 night's whilst visiting family.. great location beautiful along the quays for walks after breakfast. The staff were friendly, polite and the room was very clean..beds very comfy we had air conditioning in our room which we used every night !! the restaurant next door for breakfast was also very good we actually prefer the buffet cooked breakfasts though like they door at other premier inns , as you feel you have to hurry your cerals etc before they bring out your cooked breakfast ..that is our one and only moan.. will deff be staying here again","title":"“will deff be back”","location":0,"service":5,"value":5,"cleanliness":5,"date":"20 August 2011","sleepQ":4,"rooms":0},{"text":"We were booked on the Mersey Ferries trip and decided to stay overnight. The hotel deserved its high rating on Trip Advisor. The staff were welcoming and knowledgeable, the room was clean (we overlooked the water which was lovely) and dinner and the continental breakfast at the Beefeater next door was good value for money. Room Tip: It was a warm night and the room was quite hot and although there was a fan in the room the temperat... See more room tips","title":"“Excellent value for money”","location":0,"service":5,"value":5,"cleanliness":5,"date":"19 August 2011","sleepQ":3,"rooms":0},{"text":"We took advantage of the Premier Inn's 29-pounds-a-night prepaid deal for a two-night stay here, and while our room was very basic, the bed was as comfortable as promised and the hotel's location and the service we received more than made up for any deficiencies. We loved walking along the quays and the variety of restaurants and entertainment options available in the area, and when you get tired of this area, the tram to city centre is just a couple of blocks away. The hotel's breakfast is a pretty good deal, but I would just go with the continental buffet if I stayed there again, because it was huge and I didn't think the meat and eggs were worth an extra 2 pounds. Just so you know what isn't so great--there isn't any air conditioning (though they will give you a fan and cooler bedding if it is too warm in your room), and they use a LOT of bleach to clean the rooms. It's good to know everything is sterile, but the smell was so strong it kind of hurt to breathe in our room the first night!","title":"“Such a deal!!!!”","location":0,"service":5,"value":5,"cleanliness":5,"date":"14 August 2011","sleepQ":4,"rooms":0},{"text":"We and most of my family stayed here for my sister's wedding at the Lowry and were all really impressed with the service and the staff. The staff were friendly, helpful and well informed and nothing was too much trouble. The room was clean and bright, and considering we were onthe ground floor - there was no noise from outside at all. Breakfast - we paid more for - but it was well worth the money. We stayed with a 15 month yr old and this caused us no problems with travel cots and highchairs available. Top hotel and lovely staff!","title":"“Recommended!”","location":0,"service":5,"value":5,"cleanliness":5,"date":"11 August 2011","sleepQ":5,"rooms":0},{"text":"Stayed here for a trip to Manchester and a bit of culture Great location to use as a base v ery friendly and professional staff (especially Sarah who was on reception that day) All the staff we met were polite helpful and provided great customer service Well done Premier inns (breakfast was good too!) Great value it was very quiet but then manchester teams were playing at Wembley!!!","title":"“excellant service”","location":0,"service":5,"value":5,"cleanliness":5,"date":"8 August 2011","sleepQ":5,"rooms":0},{"text":"We stayed here in June for the Take That concert, and as always, the hotel was fantastic. The receptionist was really welcoming, couldn't do any more than she did. On arrival back from the concert (approx 12.30 am) the guy on reception gave us and others lots of coffee, tee etc, and did it with a smile! Room perfect, lovely and clean, breakfast in the Beefeater excellent. Will always come back here, see you in December!","title":"“Excellent stay here again at Salford Quays”","location":0,"service":5,"value":5,"cleanliness":5,"date":"29 July 2011","sleepQ":5,"rooms":0},{"text":"What I like about Premier Inn is that you get a reasonably priced room in a great location for whatever it is you want to do and that the rooms are consistently clean, the beds really comfortable, the staff very friendly. I would have put 5 star rating but for the fact that you have to pay for WiFi ... I really think that could be free. A mini-fridge would be good, too. But, hey, you know what to expect and PI delivers!","title":"“You know what to expect”","location":0,"service":5,"value":5,"cleanliness":5,"date":"29 July 2011","sleepQ":5,"rooms":0},{"text":"Great welcome, the receptionist did all we asked, extra pillows, tea & coffee etc with a smile. Good room comfortable bed, clean room even a view of the quays. Room Tip: with a ground floor room you can get noise from footfall above See more room tips","title":"“We loved it and we'll be back”","location":0,"service":5,"value":5,"cleanliness":5,"date":"24 July 2011","sleepQ":4,"rooms":0},{"text":"hotel,very good,Restaurant,next door,waiting times for meals,horrendous","title":"“very good”","location":0,"service":5,"value":5,"cleanliness":5,"date":"23 July 2011","sleepQ":5,"rooms":0},{"text":"Stayed here for three nights with a group of friends. It was five minutes away from the Metroline which was very convenient as we had arrived in Manchester by train. The inn was ideally situated for our pre-booked trip down the Manchester Ship canal on an ex Mersey ferry which was very enjoyable. The Lowry theatre and Art Gallery were nearby as was the new Media City, new home for the BBC. A choice of restaurants within easy walking distance was a plus too. The staff were very welcoming and acknowledged our goings in and out in a friendly attentive manner. The rooms were very spacious, clean and well appointed and if you were lucky, a view of the quay below. The only fault we found was that the quality of cooking of the cooked breakfasts next door could have been better.","title":"“Good location and friendly attentive staff”","location":0,"service":4,"value":5,"cleanliness":5,"date":"20 July 2011","sleepQ":4,"rooms":0},{"text":"The staff couldn't have done more to make us feel welcome and to offer advice on getting aroung the area based on my particular situation (I had recently suffered a back injury which was hampering my usual mobility). The location was great; centrally placed to enjoy Salford Quays and its attractions, within easy reach of Central Manchester and its museums. Free parking was an unexpected bonus. Ask for a waterside view if you want to see the plethora of activities which take place in the dock basins in early July. Room Tip: Ask for a waterside view if you want to see the plethora of activities which take place in the dock... See more room tips","title":"“Lovely welcome, great location, friendly staff”","location":0,"service":5,"value":5,"cleanliness":5,"date":"13 July 2011","sleepQ":5,"rooms":0},{"text":"We stayed in this Premier Inn for 4 days and 3 nights with our 3 children on a family holiday. Staff were extremely friendly and could not do enough for us during our stay. Ate at the \"Beefeater Restaurant\" directly beside the Premier Inn where the staff again were very friendly and the food was excellent. Kids could eat free at breakfast and at evening meal time depending upon which menu you ordered from. A great place to stay if you are visiting Old Trafford, Imperial War Museum, Lancashire Cricket Ground. We would definitely use it again.","title":"“A great place to stay!”","location":0,"service":5,"value":5,"cleanliness":5,"date":"11 July 2011","sleepQ":4,"rooms":0},{"text":"A very good hotel. The staff were excellent in all aspects of customer care. A friendly and cheerful welcome was followed by an eagerness to please. The room was well equipped and very clean, particularly the bathroom. The position was ideal, being in a quiet and restful waterside location close to the tram system and a few minutes walk from a convenient Tesco store. I would certainly recommend this hotel to anyone taking the ferry trip along the Ship Canal to Liverpool. It is only five minutes walk to the boarding point. We really enjoyed our stay and thank all the staff we encountered.","title":"“The quay to a successful stay.”","location":0,"service":5,"value":5,"cleanliness":5,"date":"8 July 2011","sleepQ":5,"rooms":0},{"text":"We have just return after a trip to manchester for my daughter sophie's birthday . I have to say the staff in this hotel are the best i have encountered nothing was to much trouble from info about the salford area to booking taxis for all our needs. if you every go to manchester this is the place to stay. many thanks to all the staff for treating us so well making my daughter's birthday stay so special :)","title":"“Excellent Can not wait to go back”","location":0,"service":5,"value":5,"cleanliness":5,"date":"7 July 2011","sleepQ":5,"rooms":0},{"text":"Back after 4 years and a few too many things have gone awry. The tv and phone did not work in my room, and the Internet is still horribly pricey. i knew what i was getting this time, and price wise it is ok and my room was nice and big. Having said that, beefeaters is simply awesome! Josie and Sharona were sensational and we were so well looked after there. Was sad to leave! I have to stay I might stay elsewhere next time, but will visit beefeaters again.","title":"“Back again and needs some love”","location":5,"service":5,"value":3,"cleanliness":5,"date":"5 July 2011","sleepQ":0,"rooms":3},{"text":"This was our first stay at a Premier Inn. The Scottish receptionist (sorry, didn't get her name!) was extremely hospitable and welcoming. The room was spotless and was very comfortable. A full range of TV channels were available which makes a change to the 4 or 5 UK channels you normally get in UK budget hotel chains. Bed was comfortable and extra pillows were provided in the room. There was, however, only 2 teabags beside the kettle! I mentioned this at the front desk and when we came back after dinner there was a small bag waiting for us with enough tea to keep us going for a week (and a fantastic smile to go with it!). Room Tip: Ask for a waterside room. See more room tips","title":"“Great Location, Fantastic Receptionist!”","location":0,"service":5,"value":4,"cleanliness":5,"date":"26 June 2011","sleepQ":4,"rooms":0},{"text":"I cannot fault the Premier Inn on Salford Quays. The staff are very helpful and sort things out without any fuss. Our room was on the top floor and was clean and comfortable. If we wanted extra coffee or anything it was provided and all in all the staff cannot do enough. They are genuine and friendly, not in a 'have a nice day' way either. The hotel is handy for Salford Quays and is also quite near the tram stop. The breakfasts are ample with everything needed. No complaints at all. Room Tip: Ask for a room on floor 3 overlooking water See more room tips","title":"“Great Staff - Good Hotel”","location":0,"service":5,"value":5,"cleanliness":5,"date":"21 June 2011","sleepQ":5,"rooms":0},{"text":"i would just like to say that we stayed here on the 10th of june after the take that concert, we arrived at 11 am just to let them know that we would not be checking in till late untill the concert finished/the very kind lady on reception said i can check you in now but i cant give you your key which was very kind of her as we just had to collect the key later /she was so friendly she even gave us written directions of how to get in to manchester and then to the stadum ,i was having some pains in my arm she seemed concerned for me even the next morning asked me how i was ,i was fine we were able to park untill late into theevening whilst we went shopping all in all it was well worth the 65 pound we paid the view was very nice looking over the quays so thankyou and hope to go back soon. Room Tip: room overlooking quays See more room tips","title":"“just brilliant”","location":5,"service":5,"value":5,"cleanliness":5,"date":"15 June 2011","sleepQ":5,"rooms":4},{"text":"stayed over on a work trip to Salford, lovely staff, nice sized spotless room. Didn't have time for breakfast so can't comment on that but did have an evening meal in the Beefeater next door which was kind of average but no complaints. Will be going back with the kids to visit the Lowry gallery and the Imperial War museum which are on the doorstep. An easy tram journey from the station drops you very close by ( Salford Quays stop) You need a ticket before you board the tram from the machine at the station. Room Tip: rooms looking out over the quay have a lovely view See more room tips","title":"“excellent hotel, will be going back”","location":0,"service":5,"value":5,"cleanliness":5,"date":"14 June 2011","sleepQ":5,"rooms":0},{"text":"Hotel was great location, very clean comfortable rooms. The staff were very helpful offering lots of information on travel links and providing us with taxi details so we could get home from the concert we went too. What really impressed us was when our car would not start in the morning they help us we jump leads to get going again - assisting above and beyond our expectations of a chain hotel. Thanks for a lovely stay and all your help","title":"“Nice hotel and great staff”","location":0,"service":5,"value":5,"cleanliness":5,"date":"12 June 2011","sleepQ":4,"rooms":0},{"text":"The hotel is located at the edge of one of the converted docks at Salford Quays, close to the outlet shopping mall, Lowry Centre, Imperial War Museum and Cinemas. The Metrolink is close by and offers a service every 12 minutes into the centre of Manchester. The staff are all incredibly friendly and helpful and the rooms are clean and comfortable. We stayed here at the end of May 2011. Room Tip: Book early to get the best price and water views. See more room tips","title":"“Relaxing location with good transport links”","location":0,"service":5,"value":5,"cleanliness":5,"date":"6 June 2011","sleepQ":5,"rooms":0},{"text":"My teenage son and I came up to Salford to look at a university and were very impressed with the Premier Inn. The receptionist was extremely helpful and kind, especially as I had never been to Manchester before. The Beefeater next door was very convenient and the food was well cooked and good value for both dinner and breakfast. The hotel is particularly quiet and we loved our view overlooking the canal. If my son goes to university here he will be spending a lot of time at Media City, so I will definitely return. Room Tip: Ask for rooms overlooking the canal See more room tips","title":"“Lovely quiet and convenient position overlooking the Canal and lock”","location":0,"service":5,"value":5,"cleanliness":5,"date":"5 June 2011","sleepQ":5,"rooms":0},{"text":"We stayed here in April 2011 and although we arrived a little early and had to wait for our room, the proximity to the lovely area of Salford Quays meant we could have a quick stroll along the canal. The room was very clean, overlooking the quays and quite spacious, just what I expected from a Premier Inn. The view was good, but the double-glazing is a little misted over, so you couldn't perhaps see as much as you ought to, but that's a tiny grumble. The surrounding area of Salford Quay is very nice and if it's good weather there are lots of things happening as you walk along the Quay. The staff were extremely helpful,polite, friendly and totally approachable, I can't praise them enough, as although we checked out on the Saturday to visit Manchester; we were allowed to leave our car in their car park until our return later that afternoon. The only negative point about our visit is that there was a Manchester United game on the following day, so the restaurant was extremely busy the night before, and unfortunately for us, our order seemed to have got lost somewhere between the bar and the restaurant. We had to ask twice before eventually after over an hour and 10 minutes we eventually got our meal. We got an apology but it was a very long wait. However the meal was certainly value for money, especially if you ordered the early meal. The noise from the bar was quite loud as it was a hot day, and patrons were drinking outside. However, by the time we were ready for bed, it was quiet. I would certainly return there again, as the links to Manchester are fabulous, cheap and easy, though perhaps not on a football weekend! Room Tip: Ask for a room overlooking the Quays. See more room tips","title":"“Very helpful and courteous staff”","location":0,"service":5,"value":5,"cleanliness":5,"date":"1 June 2011","sleepQ":5,"rooms":0},{"text":"From the time we arrived to when we left, the staff were brilliant and extremley friendly. Nothing was too much for them, same goes for the resturant. Room Tip: Just ask for want you want and it will be given, See more room tips","title":"“Best wev'e stayed at”","location":0,"service":5,"value":5,"cleanliness":5,"date":"1 June 2011","sleepQ":5,"rooms":0},{"text":"Stayed for one night, first time at a Premier Inn, went to football match and couldn't be nearer to the ground. Good nights sleep, I was expecting it to be noisy as hotel was busy but no problems. Room nice and clean, good size, shower good. Paid £88 for the room which I thought was a bit too much and a further £16 for us both to have breakfast but that was worth it, eat what you want as much as you want and all good quality, higly enjoyable. Would stay again. Only downside if I'm being picky was the miserable sod who checked us in. All in all very good","title":"“Very Good!”","location":5,"service":3,"value":3,"cleanliness":4,"date":"25 May 2011","sleepQ":4,"rooms":4},{"text":"great hotel ,room was clean and beds very comfortable.Stayed for 1 night due to going to football at old trafford (night match). Only 15 minute walk to old trafford,reasonable price compared to other hotels close by.The pub/restaurant next door were very good and the breakfast was exceptional with a wide variety of choice.The girls on reception were very polite and helpful and nothing to much trouble.My only gripe was I wanted to pay cash for my stay but was unable to do so without photo evidence,which I found strange.Other than that, I will stay there again for both football and for city break (good transport links).Also parking is free.Quays shopping centre less than 5 minutes walk.","title":"“ideal for old trafford”","location":5,"service":5,"value":4,"cleanliness":5,"date":"17 May 2011","sleepQ":5,"rooms":5},{"text":"This is the first time I have stayed at a premier inn and I thought it was excellent, the location was very good, room was nice and clean with a view out over Salford Quays - nice bonus. Parking was again good. We were made very welcome by all the staff at the Premier Inn and given advice on what was about, where to go etc. Transport links into Manchester was very good, short walk along the Quays then £2.40 return. I would deffinately stay here again and recommend it to anyone.","title":"“First time staty at premier inn”","location":5,"service":5,"value":5,"cleanliness":5,"date":"4 May 2011","sleepQ":5,"rooms":5},{"text":"this premier inn was fab great location with great pub and food next door, could not fault a thing. We went with two friends for relaxing and a bit of shopping and this met both criteria.","title":"“fab stay at the quays”","location":5,"service":5,"value":5,"cleanliness":4,"date":"26 April 2011","sleepQ":5,"rooms":5},{"text":"We have stayed at this hotel before but this time we brought our son for a birthday treat. He is a massive Man Utd fan so he was well impressed that the stadium was just across the canal from the hotel. The location of the hotel is fabulous, right on the canal, close to shops and restaurants, very very quiet and best of all just a short walk away from the stadium. We ate at the restaurant each morning and the breakfasts were great. We ate out at restaurants nearby so did not use the Beefeater at night time. The weather was great and the highlight (apart from the stadium tour) for my son was having the ducks and swans eat right out of your hand. The staff were fantastic, very friendly and helpful. A big special thank you to Gemma who arranged not only for a birthday card but also birthday sweets for my son which were waiting for us in our room. I would not hesitate in recommending this hotel and we will, without a doubt, be staying here again in the future.","title":"“BIrthday trip for hyper 7 year old”","location":5,"service":5,"value":5,"cleanliness":5,"date":"9 April 2011","sleepQ":5,"rooms":5},{"text":"Chose this Premier Inn for an overnight stay in the Manchester area - and wasn't disappointed. The usual standards of Premier Inn apply - comfortable bed, spotlessly clean. This hotel is well located for the Salford Quays attractions - we went to the Lowry and Imperial War Museum. It is very close to the Lowry Shopping Outlet, with cinema, bars and restaurants. It is also not too far away from Old Trafford. We also went into Manchester city centre on the tram - only 5 minute walk to the stop for a fast and frequent service. The staff were really friendly and helpful, especially Sharon on front desk. We had breakfast in the adjacent restaurant - ample choice of cereals, pastries etc on a self service basis, plus hot - cooked to order. All in all, another thumbs up for the brand.","title":"“Good location, friendly staff”","location":5,"service":5,"value":4,"cleanliness":5,"date":"7 March 2011","sleepQ":4,"rooms":4},{"text":"A nice, quiet and comfortable Premier Inn. Large car park out the front so very easy with our hire car, to be near the city yet away from the noise. Breakfast was nice overlooking the canal in the morning. Only disappointment was the evening meal in the adjacent restaurant, just dreadful, and was the worst meal we had in all the Premier Inns (actually the only one we were disappointed in) - and the service was extremely poor considering it was not that busy and there seemed to be plenty of staff. Even the bill was slow in coming. The rating is purely for the Premier Inn Hotel, not the restaurant - 0 stars for that.","title":"“Quiet location close to Manchester”","location":5,"service":5,"value":5,"cleanliness":5,"date":"30 December 2010","sleepQ":5,"rooms":5},{"text":"Spent last night at this hotel with friends. We had 2 rooms which were both very clean and a good size. The reception staff at this hotel are all very friendly and gave us lots of info about the area and also taxi details etc as we were visiting the theatre in Manchester. We ended up using the tram as it was so easy and only 5 mins walk to the tram stop. We opted for the meal deal which was very good value - the breakfast being particularly good. We had expected a buffet where the hot food would be pre-prepared but everything was cooked fresh to order. The breakfast waitress was very pleasant and so were the housekeeping staff - everyone said good morning and smiled which is such a change from many places. The location is fantastic just at the side of the canal - 5 mins walk to the Lowry shopping outlet, 15 mins walk to Man Utd and several restaurants nearby. Unfortunately the weather was awful and the canal was iced over so we have decided to visit again in the summer when we can have a good walk round the area.","title":"“Great hotel”","location":5,"service":5,"value":5,"cleanliness":4,"date":"29 December 2010","sleepQ":5,"rooms":4},{"text":"I paid £75 for a night which was expensive for this basic hotel. The staff were all very helpful from the moment I got out of my taxi. The breakfast is good value and the staff are genuinely friendly - though I would prefer not to have the manufactured friendliness of a handwritten note with a smiley face from someone I have never met with my morning paper saying \"Enjoy Your Paper.\" I don't like to think of the receptionist having to write out all these notes.","title":"“Nice and Helpful Staff - Can be expensive.”","location":5,"service":4,"value":2,"cleanliness":5,"date":"1 December 2010","sleepQ":4,"rooms":3},{"text":"On arrival greeted by Sarah who was so friendly and checked us in very efficiently, realised we had been given a room that may have been effected by the noise from a delivery the next morning and she quickly changed this over for us. Rooms usual premier inn standard, very clean with everything you need for a one night stay. Breakfast taken next day at beefeater and again this was excellant. The only downside was breakfast hours very early 7 to 9 am which when on a day off meant an early get up, if it had been til even 9.30 this wouldnt have been quite so bad.","title":"“Excellant Value in a nice location”","location":5,"service":5,"value":5,"cleanliness":5,"date":"28 November 2010","sleepQ":4,"rooms":4},{"text":"A clean place with efficient staff. But the extras are too pricey Breakfast £7.50pppn wifi £12pn There must be better value out there","title":"“Standard Hotel with extras that were expensive - There must be better value out there”","location":3,"service":4,"value":2,"cleanliness":4,"date":"15 November 2010","sleepQ":3,"rooms":4},{"text":"What a nice hotel - only 3 floors, which was good for us, we had quayside view which was lovely. Room was nice and clean,comfy bed,freeview tv,friendly and helpful receptionists, 15 minute walk from Man Utd Football Ground, shops nearby (and tesco express), 5 minute walk to tram which takes you to all the main places in Manchester, cheap and easy to use. We paid extra for the 'meal deal' which was fab, it is in the Beefeater Restaurant & Bar next door. 3 course meal & drink (beer/wine/soft drink) and all you can eat breakfast, food was delicious and staff friendly and helpful. It was our first time in Manchester and we had a lovely time, hope to go back.","title":"“Really Nice Friendly Hotel”","location":5,"service":5,"value":5,"cleanliness":5,"date":"1 November 2010","sleepQ":5,"rooms":5},{"text":"I stayed here with my young son the night before a Man Utd game. They're a bit stricked with the 2pm check in but when you here you check out at 12pm you understand why. very friendly smiling staff......just what you need after a long journey Clean but a little dated hotel well positioned with restaurants all around would return because the price was fine for a budget hotel £70 for me and my son and all you can eat breakfast did the job just fine for me","title":"“Perfect for Man Utd game and more”","location":5,"service":5,"value":5,"cleanliness":4,"date":"22 October 2010","sleepQ":4,"rooms":4},{"text":"My partner and I plus 2 friends stayed here for 3 nights (plus breakfast at the Beefeater) and we couldn't fault it. We visited the Lowrey, Science and Industrial Museum in Manchester - we used the tram to get there - and had a trip on the Manchester Ship Canal to Liverpool. We didn't need the car, there are several places to eat within easy walking distance.","title":"“Great stay”","location":5,"service":5,"value":5,"cleanliness":5,"date":"20 September 2010","sleepQ":5,"rooms":5},{"text":"My partner and I stayed here for a wedding which was at the Lowry Theatre. The staff were OUTSTANDING, which really made the difference in the stay. Sarah the receptionist was so helpful, letting us email her some documents to print off, and lending me a phone charger from the lost and found box. The staff were all incredibly polite and friendly. The room was basic, but spotless. The bed was actually extremely comfortable, and the level of noise in the room was non existent. As for the breakfast - for a fairly low budget hotel I thought the breakfast was really amazing. For only 7.99 you could take advantage of the continental buffet (which had yogurt and an array of fruits, nuts, seeds, granola - I have never come across such a healthy selection in a UK hotel before) as well as you could get a cooked to order Full English. In my opinion this is great value, and the food was good. I would highly reccommend staying in this hotel if visiting Manchester.","title":"“Excellent service! Great value”","location":3,"service":5,"value":5,"cleanliness":5,"date":"11 September 2010","sleepQ":4,"rooms":3},{"text":"I stayed at the Premier Inn, Salford Quays, because it's very handy for the Lowry Theatre, which is only a 5-minute walk away. I found Salford Quays to be a bit of a concrete jungle, but the Premier Inn is located in a pleasant area away from the tower blocks and next to the water. Access is relatively easy from the centre of Manchester by tram (Eccles tram, alighting at Salford Quays or Harbour City). I was a little apprehensive, as I had not been over-impressed with the Premier Inn at Manchester Airport a week earlier. The hotel is relatively small and there was just one receptionist. She was extremely enthusiastic and helpful, creating a very favourable first impression. This is not one of the new Premier Inns, so the decor feels a touch tired but is acceptable for the price. My double room was at the back of the building, so unfortunately did not have a waterfront view. It was of a good size with basic but adequate furniture. The TV was old and I felt it should have been replaced with an LCD TV by now. There was a little noise from the road but this did not prove problematic in the night. In fact, the bed was superbly comfortable and I enjoyed one of the best night's sleep I've ever had in a hotel. The bathroom was well equipped with a toilet, washbasin and bath with shower. This bathroom was better equipped than the one I had at Manchester Airport, having proper toilet rolls, although wall-mounted liquid soap dispensers were again in evidence which are just not suitable for baths. The hotel does not have its own dining room. Food is served next door in the Beefeater restaurant, which is only a few steps away. I had dinner in the restaurant, which was very reasonable as I was able to take advantage of one of their offers. Continental breakfast is also served there, which was pretty good for an additional cost of a little over £5. Overall, this hotel provides a perfectly good base for a short stay, particularly if you are attending an event at the nearby Lowry Theatre.","title":"“Good basic accommodation for a theatre visit”","location":4,"service":4,"value":5,"cleanliness":4,"date":"22 August 2010","sleepQ":5,"rooms":3},{"text":"well on arrival i wanted to book a extra night and Sarah went 100% to help us went in the beefeater next door for dinner and a tex to my phone within 15 mins to say your room is booked for 2 nights? well that's service and shaz well she's top's nothing to trouble to help and Evan the night man was chatty,and the staff at the beefeater well bob on they were so help full and the food and price was excellent thanks to all for a great e/end at the QUAY'S mick n max xx","title":"“great staff”","location":5,"service":5,"value":5,"cleanliness":5,"date":"25 July 2010","sleepQ":5,"rooms":5},{"text":"A confortable and welcoming hotel, ideal for those away on business. My daytime destination in Salford Quays was 'The Lowry' nearby, for a two-day conference earlier this week. The hotel is a pleasant 5 minute walk along the quayside up to The Lowry. But what really make this a great place to stay are the staff, really caring and helpful, make you feel at ease straight away. And breakfast, which is served at the adjacent Beafeater, was just delicious! Even the coffee is real coffee, honest! This hotel gets the thumbs up from me. Plan to stay again.","title":"“Stay here, especially if on business!”","location":4,"service":5,"value":4,"cleanliness":5,"date":"21 July 2010","sleepQ":5,"rooms":4},{"text":"Compared to other Premier Inns I have stayed in this one rates as the poorest. Noisy building with creaking floors especially if you are on the second floor and people are staying in the room above you. We managed 4 hours sleep once we had complained at 2am that our fellow guests needed to stop pacing the floor upstairs... god knows what they were doing??? Location is good and easy parking. Our room overlooked the car park so early morning deliveries will wake you up. Quality of breakfast is not as good as others - bread was cheap sliced and the croissants were anaemic and soggy. Internet wi-fi is overpriced - avoid if possible and use Costa down the road in the Lowry Shopping Mall. If you have to stay here ask for a room on the top floor.","title":"“Opt for a room on the top floor overlooking the water”","location":4,"service":4,"value":3,"cleanliness":3,"date":"18 July 2010","sleepQ":2,"rooms":3},{"text":"I often choose premier inn, because you know exactly what you are going to get - top quality, spotlessly clean, comfortable and quiet. This hotel was no exception. Although they were a little slow on check in, the lady was lovely and made sure to inform us of everything we needed to know. The room was spotless, and boasted a glorious view of the Quays. The bed was very comfortable and with the window closed, we couldnt hear a single bit of noise all night. The bathroom door was very difficult to open, but this was the only fault with everything. We went for the premier breakfast - all you can eat full english and continental for just £8. The food was high quality and the restaurant ( situated next door at a Beefeater) was newly refurbished and very welcoming. We stayed here due to a vist to the Lowry hotel to see Derren Brown ( we met him afterwards!!), but there is plenty more to do in the near area for the evening - a large shopping centre open til late, countless bars and restaurants and a lovely Quay to walk around. Will definately be staying again!","title":"“A beautiful room with a beautiful view”","location":5,"service":4,"value":5,"cleanliness":5,"date":"13 June 2010","sleepQ":5,"rooms":5},{"text":"This hotel had an absolutely fantastic reception desk. Rooms were good size, comfy beds. Try not to get a room on the carpark side - people outside chattering until 1am and lorries beeping whilst reversing at 6.30am. In general very clean. Ideal for a business, rather than pleasure trip.","title":"“Lovely staff - ideal for Lowry”","location":5,"service":5,"value":3,"cleanliness":3,"date":"25 May 2010","sleepQ":2,"rooms":3},{"text":"We stayed for one night after going to watch Manchester Utd at Old Trafford. Check-in was quick and our room was ready. Receptionists were both very friendly and helpful. The hotel was a pleasant 15 min walk from Old Trafford. There is a shopping Outlet 5 mins walk from hotel with restaurants. Next door to the hotel is a Beefeater for meals and breakfast in the morning which was very good value. We got the metro (5 min away) into Manchester city centre, all very easy. We would definately use this hotel next time we visit!","title":"“Great location, friendly and helpful staff!”","location":4,"service":5,"value":5,"cleanliness":5,"date":"11 May 2010","sleepQ":5,"rooms":4},{"text":"The title says it all. My wife and I stayed at this hotel for a quiet New Year holiday, just the 2 of us. We used the hotel as a base to explore Manchester. There is a Tesco not far away (5 minutes), which makes it very convenient to get some juice or bread. The tram station is close by also. We had a wonderful time exploring Manchester!","title":"“Middle of the road, a bit out of town, but cheap”","location":3,"service":4,"value":3,"cleanliness":4,"date":"31 March 2010","sleepQ":4,"rooms":3},{"text":"I stayed here with my partner for 1 night while we went to watch a play at the Lowry, this wasn't the best premier inn i have stayed in it seemed a bit outdated but the staff on reception were friendly and the room was a good size and the bed was one of the comfiest i have slept in. If you are planning to visit the Lowry this hotel is only a 5 minute walk away and if you want to go into the city centre the metro link is only a couple of minutes away so great location.","title":"“Cheap and cheerfull”","location":5,"service":3,"value":4,"cleanliness":3,"date":"29 December 2009","sleepQ":0,"rooms":3},{"text":"Great location for the centre of the city. The hotel is clean, spacious and comfortable, the staff were very helpful, & polite. Breakfast was good value for money, (the children eat free.) Great for a sight seeing base! I would definitely revisit.","title":"“Clean, spacious, &amp; comfortable.”","location":5,"service":0,"value":5,"cleanliness":5,"date":"28 December 2009","sleepQ":0,"rooms":4},{"text":"We chose to stay here as it was close to The Lowry and also had good tram links into the city centre. The room was clean and ready on arrival. Quiet location so little traffic noise at night. This was probably the worst Premier breakfast experience we have had, the bacon, sausage etc was cooked on the same grill as the evening steaks and you could taste the charred meat. We took breakfast at 8.45 so 15 mins before the end of breakfast but the staff were clearing up around us and we were made to feel in the way.","title":"“Good Base for Manchester”","location":4,"service":3,"value":4,"cleanliness":4,"date":"17 July 2009","sleepQ":0,"rooms":3},{"text":"I asked the manager a simple question but because she was busy she spoke to me in a very rude and condecending way. I would never stay here again","title":"“Rude manager”","location":3,"service":1,"value":3,"cleanliness":2,"date":"24 January 2009","sleepQ":0,"rooms":2},{"text":"Stayed at Premier Salford Quays for one night on business. Very easy to find, free parking, quiet location overlooking canal. Hotel is standard Premier, clean, warm, comfortable, safe, fabulous shower etc. Meals at this hotel are served in Beefeater next door. I had an evening meal, loads of choice from standard pub fare to fine dining if preferred. Comfortable spacious surroundings, good quick service, pleasant welcome. Restaurant is up steep stairs but there is a lift if required. Get a window seat and watch the canoeists on the canal, or see swans and ducks paddling slowly by. Breakfast also served here, and is the usual mix of help yourself for cereals toast coffee etc., and cooked breakfast made to order. It was quick and piping hot, even though very busy on the morning I was there. Lovely place for a stroll in the evening or after breakfast along the canalside, very peaceful, hardly any traffic noise at all even though not far from busy main road. Plenty of places to visit if your stay is social, e.g. Lowry, Imperial War Museum etc. all within 10 minute walk of each other.","title":"“More than happy”","location":4,"service":4,"value":4,"cleanliness":4,"date":"26 November 2008","sleepQ":0,"rooms":4},{"text":"We were staying at the hotel as we were seeing the Calendar Girls at the Lowry (its very good go and see it if you get the chance). The hotel is ideally situated, only a short walk to the theatre (between 5 or 10 minutes depending on the height of your girlfriends heels). Its also in an excellent location for the outlet mall and the Imperial War Museum North. If you are going to the theatre, it might be worth eating at the Beefeater next door as it gets very busy at the restaurants near the Lowry. The room was large and clean with no obvious problems. It was exactly what you want from a hotel room. We didn't order breakfast but did go and pay for it the next morning. Its all you can eat for £7.95 and the hot food is cooked to order. On the sunday we took the metrolink into Manchester and the station was only a short walk from the hotel, then about 10 minutes to the city centre. All in all I would stay there again if I was going to the Lowry.","title":"“Prefect for the Lowry Theatre”","location":5,"service":4,"value":4,"cleanliness":4,"date":"27 October 2008","sleepQ":0,"rooms":4},{"text":"This is the type of hotel you don't hang around in as it has no lounges or bars but it is a perfectly adequate place to stay. The room was basic and comfortable; I noticed some damage to the bath though. The downside to this place is that there is no restaurant on site, you have to go out of the hotel to an adjacent building for breakfast and as the breakfast room is on an upper floor with no lift the arrangement is pretty useless for the elderly or disabled. There is no room service either. The location is excellent, with a fast tram service nearby that takes you right into the centre of Manchester and to Piccadilly train station. I arrived by train with no difficulty and left from the airport which was no more than a twenty minute taxi journey. Salford Quays is a very attractive area too and is very quiet but with a good collection of bars and restaurants as you walk down towards The Lowry.","title":"“A reasonable budget type hotel”","location":5,"service":2,"value":3,"cleanliness":3,"date":"4 June 2008","sleepQ":0,"rooms":3},{"text":"Clean comfortable room. Bed was excellent. Staff were friendly and helpful. Theres a good deli type place to have breakfast along towards the Lowry. Lovely quiet situation but excellent connection to the city by tram. Only downside was that there wasnt a pub with good beer anywhere on the quays. I thoroughly recommend it.","title":"“Peaceful place to stay”","location":0,"service":0,"value":0,"cleanliness":0,"date":"5 April 2008","sleepQ":0,"rooms":0},{"text":"We stayed for 2 nights after a day in The Peak district. This hotel was under The Golden Tulip brand when we stayed but will be renamed Premier Inn on the 12th December. The main reason for our visit was to see Manchester United on the second evening. The hotel is perfect for this as it about 400 metres away. We also visited the Lowry Centre and the Imperial War Museum North which are about 10 minutes walk away. The room was fine and clean. The bed wasn't great but OK for 2 nights. The windows are not double glazed and traffic is noisy in the morning. There is no A/C - not an issue in December but watch out in Summer, I guess it will be hot in the rooms. We did not have breakfast in the hotel. Staff were helpful even supplying an adaptor when my 3 pin plug would not fit in the sockets.Note that most of the plugs have round 3 pins (!). There are some normal 3 pin sockets but very close to a table surface so if your charger is larger than a normal 3 pin plug it won't fit in! If you want to visit Man Utd stay here. Make sure you get your car parked early as the car park is v.full on match days. Don't forget your room card on match days - you won't get into the hotel without it!","title":"“Perfectly acceptable Manchester Hotel”","location":3,"service":4,"value":0,"cleanliness":3,"date":"4 December 2007","sleepQ":0,"rooms":3},{"text":"We booked this hotel as we were going to see Frank Skinner at The Lowry. We couldn't have picked a better place. Minutes from the tram stop and a short walk from The Lowry. Our room was nicely decorated and clean. We ate dinner and breakfast at the Beefeater next door - check out the set menu deals, we had steak and a lovely dessert for £7.95!! Staff were friendly and efficient. We will definitely be staying here again.","title":"“Great hotel”","location":5,"service":5,"value":4,"cleanliness":5,"date":"1 December 2007","sleepQ":0,"rooms":5},{"text":"Stayed here for 4 days whilst attending a conference at the Lowry centre. Staff were really friendly and were helpful with the smallest things (I didn't bring an umbrella and they gave me one!). The room was simple and large - I was given a roadside room and it was rather quiet, however I'd request the quays side next time. Stayed as a single in a double room - sparsely furnished but in no way small. The breakfast in the hotel next door is well worth it - also had dinner there and found it to be most satisfactory. Transportwise it is really close to the tram line into the city - only cost 1.10 return. Internet is expensive - 3 pounds a pop for 30 minutes is the cheapest option. I flew in via Manchester airport - a 20 pound trip. All in all a very clean area - shopping centre at the Lowry is a short stroll. If you wish to attend the Lowry for any function this is a great hotel in a great location.","title":"“A great cheap hotel”","location":5,"service":4,"value":4,"cleanliness":4,"date":"12 July 2007","sleepQ":0,"rooms":4},{"text":"I stayed here with my husband and four friends in February. We were down to visit friends and just wanted somewhere cheap. I was really pleased with it though, the rooms were like every other premier travel inn but clean and did the job well. The location was great however. Salford Quays is really nice now. The metrolink into the city centre was a few minutes walk away and there were restaurants nearby the hotel. All in all, excellent for our purposes.","title":"“Really good location”","location":0,"service":0,"value":0,"cleanliness":0,"date":"17 March 2007","sleepQ":0,"rooms":0},{"text":"Well, what do i say, now i have stayed in hotels with work that range from the Hilton and Hyatt to Premier Travel Inn. Never have i seen such polite, kind, nice and fantastic staff! We were booked in within seconds of arriving on a busy day (New years Eve). The member of staff of the desk was excellent, ery polite, funny and a pleasure to be around. The room was modern and clean. The TV had more channels than normally at a PTI, the beds were comfortable. I am normally very critical of hotels and like a moan but on this occasion, however hard i tried, there was nothing to moan about. A tip, when driving down the road of the hotel, its signposted \"Quay House\" and Beefeater. just turn in there (left) and then right into the car park, overflow is to the left. There is free parking, and again, out of the ordinary, there is lots of it. the location is lovely, 9 mins drive from the MEN Arena, 10 mins walk from Manchester United and there is a Tesco Express open late all of 3 mins walk (right out of the hotel to the lights and take a left) The manchester ship canal runs passed the hotel and some rooms look onto it, The Lowery Outlet Mall is 2 mins walk on the same road as the hotel. I o a lot of work in Manchester as i was on NYE and from now on, i will be staying here. I have added 2 pics of the room which was a Quad as they had run out of Twins.","title":"“Fantastic, Really friendly”","location":5,"service":5,"value":5,"cleanliness":5,"date":"3 January 2007","sleepQ":0,"rooms":5},{"text":"I stayed at this Premier Travel Inn on a Friday night in December due to a function at the nearby Willows Club. Cannot fault it in any way. Having stayed at a few of the Premier Taravel Inns in the past I know what to expect and nothing can be faulted as is the norm. Only word of advice - if you require a taxi on a Fri night, book in advance!!! Half an hour to get in touch with local taxi firm with help from girl on reception. Cannot fault even tho the Fire Alarm went off just after two in the morning - very efficient and polite even to cries of 'We want our money back as we not had a good night's sleep' Ridiculous.","title":"“Excellent”","location":4,"service":5,"value":5,"cleanliness":5,"date":"27 December 2006","sleepQ":0,"rooms":5},{"text":"","title":"“Mucho lujo para m&iacute; xD”","location":5,"service":4,"value":4,"cleanliness":5,"date":"12 October 2011","sleepQ":5,"rooms":5},{"text":"","title":"“Gem&uuml;tliches Hotel zu gutem Preis”","location":4,"service":4,"value":5,"cleanliness":4,"date":"16 January 2011","sleepQ":5,"rooms":4},